#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ChimeraPlacementHelperReplicatedBaseCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_ChimeraPlacementHelperReplicatedBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ChimeraPlacementHelperReplicatedBaseCore.BP_ChimeraPlacementHelperReplicatedBaseCore_C
// 0x0020 (0x0860 - 0x0840)
class ABP_ChimeraPlacementHelperReplicatedBaseCore_C final : public ABP_ChimeraPlacementHelperReplicatedBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ChimeraPlacementHelperReplicatedBaseCore_C; // 0x0838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        RangeOutline;                                      // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RangeVis;                                          // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RangeDecalMaterial;                                // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RangeVisMaterial;                                  // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void SetMeshColor(const struct FLinearColor& Color);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_ChimeraPlacementHelperReplicatedBaseCore(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ChimeraPlacementHelperReplicatedBaseCore_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ChimeraPlacementHelperReplicatedBaseCore_C")
	}
	static class ABP_ChimeraPlacementHelperReplicatedBaseCore_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ChimeraPlacementHelperReplicatedBaseCore_C>();
	}
};
DUMPER7_ASSERTS_ABP_ChimeraPlacementHelperReplicatedBaseCore_C;

}

