#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CloningBed_NonDeconstructible

#include "Basic.hpp"

#include "BP_CloningBed_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CloningBed_NonDeconstructible.BP_CloningBed_NonDeconstructible_C
// 0x0030 (0x06F8 - 0x06C8)
class ABP_CloningBed_NonDeconstructible_C final : public ABP_CloningBed_C
{
public:
	class USpotLightComponent*                    SpotLight1;                                        // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_EV_SimpleLightBeam_02;                           // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube1;                                             // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_EV_SimpleLightBeam_01;                           // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CloningBed_NonDeconstructible_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CloningBed_NonDeconstructible_C")
	}
	static class ABP_CloningBed_NonDeconstructible_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CloningBed_NonDeconstructible_C>();
	}
};
DUMPER7_ASSERTS_ABP_CloningBed_NonDeconstructible_C;

}

