#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RadiationArea

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RadiationArea.BP_RadiationArea_C.ExecuteUbergraph_BP_RadiationArea
// 0x0008 (0x0008 - 0x0000)
struct BP_RadiationArea_C_ExecuteUbergraph_BP_RadiationArea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_FromLoad_1;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_FromLoad;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RadiationArea_C_ExecuteUbergraph_BP_RadiationArea;

// Function BP_RadiationArea.BP_RadiationArea_C.OnDataLayerActivate_Exec
// 0x0001 (0x0001 - 0x0000)
struct BP_RadiationArea_C_OnDataLayerActivate_Exec final
{
public:
	bool                                          FromLoad;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RadiationArea_C_OnDataLayerActivate_Exec;

// Function BP_RadiationArea.BP_RadiationArea_C.OnDataLayerDeactivate_Exec
// 0x0001 (0x0001 - 0x0000)
struct BP_RadiationArea_C_OnDataLayerDeactivate_Exec final
{
public:
	bool                                          FromLoad;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RadiationArea_C_OnDataLayerDeactivate_Exec;

// Function BP_RadiationArea.BP_RadiationArea_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_RadiationArea_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_GetUnscaledBoxExtent_ReturnValue;         // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_RadiationArea_C_UserConstructionScript;

}

