#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SonicDrill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_structs.hpp"


namespace SDK::Params
{

// Function BP_SonicDrill.BP_SonicDrill_C.ExecuteUbergraph_BP_SonicDrill
// 0x0008 (0x0008 - 0x0000)
struct BP_SonicDrill_C_ExecuteUbergraph_BP_SonicDrill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrBuildingState                              K2Node_Event_InState;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SonicDrill_C_ExecuteUbergraph_BP_SonicDrill;

// Function BP_SonicDrill.BP_SonicDrill_C.OnBuildingStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_SonicDrill_C_OnBuildingStateChanged final
{
public:
	ECrBuildingState                              InState;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SonicDrill_C_OnBuildingStateChanged;

// Function BP_SonicDrill.BP_SonicDrill_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_SonicDrill_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SonicDrill_C_ReceiveEndPlay;

// Function BP_SonicDrill.BP_SonicDrill_C.GetBuildingMeshes
// 0x0018 (0x0018 - 0x0000)
struct BP_SonicDrill_C_GetBuildingMeshes final
{
public:
	class UMeshComponent*                         MainBody;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 AdditionalMeshes;                                  // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_SonicDrill_C_GetBuildingMeshes;

}

