#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_Exploder_Tier2_LOD0_RunCrAiActionBlueprintBase_DealDamageAndSpawnEntity

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Chimera_classes.hpp"
#include "AuActorPlacement_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_Exploder_Tier2_LOD0_RunCrAiActionBlueprintBase_DealDamageAndSpawnEntity.BTTask_Exploder_Tier2_LOD0_RunCrAiActionBlueprintBase_DealDamageAndSpawnEntity_C
// 0x00B8 (0x01A0 - 0x00E8)
class UBTTask_Exploder_Tier2_LOD0_RunCrAiActionBlueprintBase_DealDamageAndSpawnEntity_C final : public UBTTask_RunCrAiActionBlueprintBase
{
public:
	struct FBlackboardKeySelector                 TargetActorBBKey;                                  // 0x00E8(0x0028)(Edit, BlueprintVisible)
	TSubclassOf<class UGameplayEffect>            New_Damage_Gameplay_Effect;                        // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         New_Building_Infection_Damage;                     // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         New_Allowed_Attack_Distance;                       // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         New_Allowed_Attack_Cone_Half_Angle;                // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuAPMassSpawnedEntityType             Entity_Type;                                       // 0x0128(0x0038)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 SelfActorBBKey;                                    // 0x0160(0x0028)(Edit, BlueprintVisible)
	struct FVector                                EntityScale;                                       // 0x0188(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class UCrAiAction* CreateAiAction();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_Exploder_Tier2_LOD0_RunCrAiActionBlueprintBase_DealDamageAndSpawnEntity_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_Exploder_Tier2_LOD0_RunCrAiActionBlueprintBase_DealDamageAndSpawnEntity_C")
	}
	static class UBTTask_Exploder_Tier2_LOD0_RunCrAiActionBlueprintBase_DealDamageAndSpawnEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_Exploder_Tier2_LOD0_RunCrAiActionBlueprintBase_DealDamageAndSpawnEntity_C>();
	}
};
DUMPER7_ASSERTS_UBTTask_Exploder_Tier2_LOD0_RunCrAiActionBlueprintBase_DealDamageAndSpawnEntity_C;

}

