#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrAiAnimalPanzerHundRuntime

#include "Basic.hpp"

#include "Chimera_structs.hpp"
#include "AuWeapon_structs.hpp"
#include "AuAbilities_structs.hpp"


namespace SDK::Params
{

// Function CrAiAnimalPanzerHundRuntime.CrAiAnimalPanzerHundInterface.GetPanzerHundUpdateStateComponent
// 0x0008 (0x0008 - 0x0000)
struct CrAiAnimalPanzerHundInterface_GetPanzerHundUpdateStateComponent final
{
public:
	class UCrAiAnimalPanzerHundUpdateStateComponent* ReturnValue;                                    // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrAiAnimalPanzerHundInterface_GetPanzerHundUpdateStateComponent;

// Function CrAiAnimalPanzerHundRuntime.CrAiAnimalPanzerHundUpdateStateComponent.OnShotInAwarenessZone
// 0x0100 (0x0100 - 0x0000)
struct CrAiAnimalPanzerHundUpdateStateComponent_OnShotInAwarenessZone final
{
public:
	struct FAuEquippedWeapon                      EquippedWeapon;                                    // 0x0000(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrAiAnimalPanzerHundUpdateStateComponent_OnShotInAwarenessZone;

// Function CrAiAnimalPanzerHundRuntime.CrAiAnimalPanzerHundUpdateStateComponent.OnShotToDangerZone
// 0x0198 (0x0198 - 0x0000)
struct CrAiAnimalPanzerHundUpdateStateComponent_OnShotToDangerZone final
{
public:
	struct FAuEquippedWeapon                      EquippedWeapon;                                    // 0x0000(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAuTargetData                          Hits;                                              // 0x0100(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuCustomTargetHandle                  TargetingHandle;                                   // 0x0178(0x0001)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuCustomTraceDataHandle               CustomData;                                        // 0x0180(0x0018)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrAiAnimalPanzerHundUpdateStateComponent_OnShotToDangerZone;

// Function CrAiAnimalPanzerHundRuntime.CrAiAnimalPanzerHundUpdateStateComponent.OnWaveStateChanged
// 0x0034 (0x0034 - 0x0000)
struct CrAiAnimalPanzerHundUpdateStateComponent_OnWaveStateChanged final
{
public:
	EEnviroWave                                   Wave;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEnviroWaveStage                              Stage;                                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCrEnviroWaveSettings                  Settings;                                          // 0x0004(0x002C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Progress;                                          // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrAiAnimalPanzerHundUpdateStateComponent_OnWaveStateChanged;

}

