#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BuildingToolConfirm

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_BuildingToolConfirm.GA_BuildingToolConfirm_C.ExecuteUbergraph_GA_BuildingToolConfirm
// 0x0158 (0x0158 - 0x0000)
struct GA_BuildingToolConfirm_C_ExecuteUbergraph_GA_BuildingToolConfirm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0090(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00D0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCrAbilityTask_PlayMontage*             CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0100(0x0048)(ContainsInstancedReference)
	class ACrCharacterPlayerBase*                 K2Node_DynamicCast_AsCr_Character_Player_Base;     // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolConfirm_C_ExecuteUbergraph_GA_BuildingToolConfirm;

// Function GA_BuildingToolConfirm.GA_BuildingToolConfirm_C.OnCancelled_6DFA81154743C40AB470E18958C0264C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolConfirm_C_OnCancelled_6DFA81154743C40AB470E18958C0264C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolConfirm_C_OnCancelled_6DFA81154743C40AB470E18958C0264C;

// Function GA_BuildingToolConfirm.GA_BuildingToolConfirm_C.OnFppMontageBlendOut_6DFA81154743C40AB470E18958C0264C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolConfirm_C_OnFppMontageBlendOut_6DFA81154743C40AB470E18958C0264C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolConfirm_C_OnFppMontageBlendOut_6DFA81154743C40AB470E18958C0264C;

// Function GA_BuildingToolConfirm.GA_BuildingToolConfirm_C.OnFppMontageEnded_6DFA81154743C40AB470E18958C0264C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolConfirm_C_OnFppMontageEnded_6DFA81154743C40AB470E18958C0264C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolConfirm_C_OnFppMontageEnded_6DFA81154743C40AB470E18958C0264C;

// Function GA_BuildingToolConfirm.GA_BuildingToolConfirm_C.OnFppMontageNotifyBegin_6DFA81154743C40AB470E18958C0264C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolConfirm_C_OnFppMontageNotifyBegin_6DFA81154743C40AB470E18958C0264C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolConfirm_C_OnFppMontageNotifyBegin_6DFA81154743C40AB470E18958C0264C;

// Function GA_BuildingToolConfirm.GA_BuildingToolConfirm_C.OnFppMontageNotifyEnd_6DFA81154743C40AB470E18958C0264C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolConfirm_C_OnFppMontageNotifyEnd_6DFA81154743C40AB470E18958C0264C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolConfirm_C_OnFppMontageNotifyEnd_6DFA81154743C40AB470E18958C0264C;

// Function GA_BuildingToolConfirm.GA_BuildingToolConfirm_C.OnInterrupted_6DFA81154743C40AB470E18958C0264C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolConfirm_C_OnInterrupted_6DFA81154743C40AB470E18958C0264C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolConfirm_C_OnInterrupted_6DFA81154743C40AB470E18958C0264C;

// Function GA_BuildingToolConfirm.GA_BuildingToolConfirm_C.OnNotLocallyControlledTppMontageBlendOut_6DFA81154743C40AB470E18958C0264C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolConfirm_C_OnNotLocallyControlledTppMontageBlendOut_6DFA81154743C40AB470E18958C0264C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolConfirm_C_OnNotLocallyControlledTppMontageBlendOut_6DFA81154743C40AB470E18958C0264C;

}

