#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ShowWidget_WhenInputPressed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ShowWidget_WhenInputPressed.GA_ShowWidget_WhenInputPressed_C
// 0x0058 (0x0560 - 0x0508)
class UGA_ShowWidget_WhenInputPressed_C : public UCrGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftClassPtr<class UClass>                   WidgeToSpawn;                                      // 0x0510(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UCommonActivatableWidget*               User_Widget;                                       // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           WidgetContextsToHide;                              // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bCheat;                                            // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_PushContentToLayerForPlayer* PushContentAsyncAction;                          // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void OnWidgetDeactivated();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void ExecuteUbergraph_GA_ShowWidget_WhenInputPressed(int32 EntryPoint);
	void BeforePush_07A5E8B54EF4795F874768B89DFB5B45(class UCommonActivatableWidget* UserWidget);
	void AfterPushCheck();
	void AfterPush_07A5E8B54EF4795F874768B89DFB5B45(class UCommonActivatableWidget* UserWidget);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_ShowWidget_WhenInputPressed_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_ShowWidget_WhenInputPressed_C")
	}
	static class UGA_ShowWidget_WhenInputPressed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ShowWidget_WhenInputPressed_C>();
	}
};
DUMPER7_ASSERTS_UGA_ShowWidget_WhenInputPressed_C;

}

