#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HairStrandsSolver

#include "Basic.hpp"

#include "DataflowCore_structs.hpp"
#include "DataflowSimulation_structs.hpp"


namespace SDK
{

// ScriptStruct HairStrandsSolver.GroomSolverSettings
// 0x0068 (0x0068 - 0x0000)
struct alignas(0x08) FGroomSolverSettings final
{
public:
	int32                                         NumSubSteps;                                       // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSolverIterations;                               // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SimulationFrameRate;                               // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxLODDistance;                                    // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinLODDistance;                                    // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x54];                                      // 0x0014(0x0054)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGroomSolverSettings;

// ScriptStruct HairStrandsSolver.DataflowGroomSolverProxy
// 0x00E0 (0x0158 - 0x0078)
struct FDataflowGroomSolverProxy final : public FDataflowPhysicsSolverProxy
{
public:
	uint8                                         Pad_78[0xE0];                                      // 0x0078(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataflowGroomSolverProxy;

// ScriptStruct HairStrandsSolver.AddSolverDeformerDataflowNode
// 0x00C8 (0x0350 - 0x0288)
struct FAddSolverDeformerDataflowNode final : public FDataflowSimulationNode
{
public:
	TArray<struct FDataflowSimulationProperty>    PhysicsSolvers;                                    // 0x0288(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	struct FDataflowSimulationTime                SimulationTime;                                    // 0x0298(0x000C)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptimusDeformer*                       MeshDeformer;                                      // 0x02A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<struct FDataflowNumericTypes>          DeformerNumericInputs;                             // 0x02B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataflowVectorTypes>           DeformerVectorInputs;                              // 0x02C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataflowStringTypes>           DeformerStringInputs;                              // 0x02D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataflowBoolTypes>             DeformerBoolInputs;                                // 0x02E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataflowTransformTypes>        DeformerTransformInputs;                           // 0x02F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataflowNumericArrayTypes>     DeformerNumericArrays;                             // 0x0300(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataflowVectorArrayTypes>      DeformerVectorArrays;                              // 0x0310(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataflowStringArrayTypes>      DeformerStringArrays;                              // 0x0320(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataflowBoolArrayTypes>        DeformerBoolArrays;                                // 0x0330(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataflowTransformArrayTypes>   DeformerTransformArrays;                           // 0x0340(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAddSolverDeformerDataflowNode;

}

