#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RuntimeTests

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "MassEntity_classes.hpp"


namespace SDK
{

// Class RuntimeTests.EngineTestTickActor
// 0x0020 (0x02C8 - 0x02A8)
class AEngineTestTickActor final : public AActor
{
public:
	int32                                         TickCount;                                         // 0x02A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TickOrder;                                         // 0x02AC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldIncrementTickCount;                         // 0x02B0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldDoMath;                                     // 0x02B1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B2[0x2];                                      // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MathCounter;                                       // 0x02B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MathIncrement;                                     // 0x02B8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MathLimit;                                         // 0x02BC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBillboardComponent*                    SpriteComponent;                                   // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EngineTestTickActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EngineTestTickActor")
	}
	static class AEngineTestTickActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEngineTestTickActor>();
	}
};
DUMPER7_ASSERTS_AEngineTestTickActor;

// Class RuntimeTests.EngineTickTestProcessor
// 0x03C0 (0x0480 - 0x00C0)
class UEngineTickTestProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x3C0];                                     // 0x00C0(0x03C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EngineTickTestProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EngineTickTestProcessor")
	}
	static class UEngineTickTestProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEngineTickTestProcessor>();
	}
};
DUMPER7_ASSERTS_UEngineTickTestProcessor;

}

