#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeaderLineBuildingInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_HeaderLineBuildingInfo.WBP_HeaderLineBuildingInfo_C.SetTitleFieldSize
// 0x0018 (0x0018 - 0x0000)
struct WBP_HeaderLineBuildingInfo_C_SetTitleFieldSize final
{
public:
	int32                                         Size;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HeaderLineBuildingInfo_C_SetTitleFieldSize;

// Function WBP_HeaderLineBuildingInfo.WBP_HeaderLineBuildingInfo_C.SetTitle
// 0x0010 (0x0010 - 0x0000)
struct WBP_HeaderLineBuildingInfo_C_SetTitle final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_HeaderLineBuildingInfo_C_SetTitle;

// Function WBP_HeaderLineBuildingInfo.WBP_HeaderLineBuildingInfo_C.SetTextStyle
// 0x0001 (0x0001 - 0x0000)
struct WBP_HeaderLineBuildingInfo_C_SetTextStyle final
{
public:
	bool                                          isHighlight;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HeaderLineBuildingInfo_C_SetTextStyle;

// Function WBP_HeaderLineBuildingInfo.WBP_HeaderLineBuildingInfo_C.SetLinesEnabled
// 0x0024 (0x0024 - 0x0000)
struct WBP_HeaderLineBuildingInfo_C_SetLinesEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HeaderLineBuildingInfo_C_SetLinesEnabled;

// Function WBP_HeaderLineBuildingInfo.WBP_HeaderLineBuildingInfo_C.SetColors
// 0x0020 (0x0020 - 0x0000)
struct WBP_HeaderLineBuildingInfo_C_SetColors final
{
public:
	struct FLinearColor                           Highlight;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HeaderLineBuildingInfo_C_SetColors;

}

