#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuActorPlacement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ChimeraMassCommon_structs.hpp"
#include "AuActorPlacement_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AuActorPlacement.AuActorPlacementComponent.GetActorPlacementRotation
// 0x0018 (0x0018 - 0x0000)
struct AuActorPlacementComponent_GetActorPlacementRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementComponent_GetActorPlacementRotation;

// Function AuActorPlacement.AuActorPlacementComponent.GetIgnoredPlacementHit
// 0x0100 (0x0100 - 0x0000)
struct AuActorPlacementComponent_GetIgnoredPlacementHit final
{
public:
	struct FHitResult                             ReturnValue;                                       // 0x0000(0x0100)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementComponent_GetIgnoredPlacementHit;

// Function AuActorPlacement.AuActorPlacementComponent.GetPlacementHit
// 0x0100 (0x0100 - 0x0000)
struct AuActorPlacementComponent_GetPlacementHit final
{
public:
	struct FHitResult                             ReturnValue;                                       // 0x0000(0x0100)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementComponent_GetPlacementHit;

// Function AuActorPlacement.AuActorPlacementComponent.GetResourceConditionResult
// 0x0001 (0x0001 - 0x0000)
struct AuActorPlacementComponent_GetResourceConditionResult final
{
public:
	EAuAPlacementConditionResult                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementComponent_GetResourceConditionResult;

// Function AuActorPlacement.AuActorPlacementComponent.OnAddZLocationRequest
// 0x0008 (0x0008 - 0x0000)
struct AuActorPlacementComponent_OnAddZLocationRequest final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuActorPlacementComponent_OnAddZLocationRequest;

// Function AuActorPlacement.AuActorPlacementComponent.OnRemoveZLocationRequest
// 0x0008 (0x0008 - 0x0000)
struct AuActorPlacementComponent_OnRemoveZLocationRequest final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuActorPlacementComponent_OnRemoveZLocationRequest;

// Function AuActorPlacement.AuActorPlacementComponent.ServerDestroyHelper
// 0x0008 (0x0008 - 0x0000)
struct AuActorPlacementComponent_ServerDestroyHelper final
{
public:
	class AActor*                                 InHelperActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementComponent_ServerDestroyHelper;

// Function AuActorPlacement.AuActorPlacementComponent.ServerSetHelperDynamicExtent
// 0x0018 (0x0018 - 0x0000)
struct AuActorPlacementComponent_ServerSetHelperDynamicExtent final
{
public:
	struct FVector                                InExtent;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementComponent_ServerSetHelperDynamicExtent;

// Function AuActorPlacement.AuActorPlacementComponent.ServerSpawnActorFromSubsystem
// 0x00B0 (0x00B0 - 0x0000)
struct AuActorPlacementComponent_ServerSpawnActorFromSubsystem final
{
public:
	struct FAuAPPayloadDataHandle                 InPayloadHandle;                                   // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
	struct FTransform                             InSpawnTransform;                                  // 0x0020(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        TilesLocations;                                    // 0x0080(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bCurrentFoundation;                                // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCurrentTiles;                                     // 0x0091(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCrMassEntityReplicationHelper> InBuildingsToReplace;                              // 0x0098(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuActorPlacementComponent_ServerSpawnActorFromSubsystem;

// Function AuActorPlacement.AuActorPlacementComponent.ServerSpawnHelperActor
// 0x0048 (0x0048 - 0x0000)
struct AuActorPlacementComponent_ServerSpawnHelperActor final
{
public:
	TSubclassOf<class AAuAPHelperActor>           HelperClass;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInDynamic;                                        // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromClient;                                       // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuAPPayloadDataHandle                 InPayloadHandle;                                   // 0x0028(0x0020)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementComponent_ServerSpawnHelperActor;

// Function AuActorPlacement.AuActorPlacementData.GetActorDefaultObject
// 0x0008 (0x0008 - 0x0000)
struct AuActorPlacementData_GetActorDefaultObject final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementData_GetActorDefaultObject;

// Function AuActorPlacement.AuActorPlacementData.GetBuildingUniqueName
// 0x0008 (0x0008 - 0x0000)
struct AuActorPlacementData_GetBuildingUniqueName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementData_GetBuildingUniqueName;

// Function AuActorPlacement.AuActorPlacementFunctionLibrary.GetPayloadPlacementData
// 0x0028 (0x0028 - 0x0000)
struct AuActorPlacementFunctionLibrary_GetPayloadPlacementData final
{
public:
	struct FAuAPPayloadDataHandle                 InHandle;                                          // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
	const class UAuActorPlacementData*            ReturnValue;                                       // 0x0020(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementFunctionLibrary_GetPayloadPlacementData;

// Function AuActorPlacement.AuActorPlacementFunctionLibrary.GetSplineActorData
// 0x0100 (0x0100 - 0x0000)
struct AuActorPlacementFunctionLibrary_GetSplineActorData final
{
public:
	struct FAuAPPayloadDataHandle                 InHandle;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAuAPSplineActorPayloadData            ReturnValue;                                       // 0x0020(0x00E0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementFunctionLibrary_GetSplineActorData;

// Function AuActorPlacement.AuActorPlacementFunctionLibrary.MakePayloadHandle
// 0x0028 (0x0028 - 0x0000)
struct AuActorPlacementFunctionLibrary_MakePayloadHandle final
{
public:
	const class UAuActorPlacementData*            InPlacementData;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuAPPayloadDataHandle                 ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementFunctionLibrary_MakePayloadHandle;

// Function AuActorPlacement.AuActorPlacementFunctionLibrary.MakeSplineActorData
// 0x0070 (0x0070 - 0x0000)
struct AuActorPlacementFunctionLibrary_MakeSplineActorData final
{
public:
	class USplineComponent*                       InSpline;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAuActorPlacementData*            InPlacementData;                                   // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActorInstanceHandle                   StartActor;                                        // 0x0010(0x0020)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActorInstanceHandle                   EndActor;                                          // 0x0030(0x0020)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuAPPayloadDataHandle                 ReturnValue;                                       // 0x0050(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementFunctionLibrary_MakeSplineActorData;

// Function AuActorPlacement.AuActorPlacementFunctionLibrary.SetSplineActorData
// 0x0028 (0x0028 - 0x0000)
struct AuActorPlacementFunctionLibrary_SetSplineActorData final
{
public:
	struct FAuAPPayloadDataHandle                 InHandle;                                          // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
	class USplineComponent*                       InSpline;                                          // 0x0020(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementFunctionLibrary_SetSplineActorData;

// Function AuActorPlacement.AuActorPlacementSocketsComponent.SetAllSocketsActive
// 0x0001 (0x0001 - 0x0000)
struct AuActorPlacementSocketsComponent_SetAllSocketsActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuActorPlacementSocketsComponent_SetAllSocketsActive;

// Function AuActorPlacement.AuAPHelperActor.GetMouseLocation
// 0x0018 (0x0018 - 0x0000)
struct AuAPHelperActor_GetMouseLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_GetMouseLocation;

// Function AuActorPlacement.AuAPHelperActor.OnEvaporatingWaterBeginOverlap
// 0x0120 (0x0120 - 0x0000)
struct AuAPHelperActor_OnEvaporatingWaterBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_OnEvaporatingWaterBeginOverlap;

// Function AuActorPlacement.AuAPHelperActor.OnEvaporatingWaterEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct AuAPHelperActor_OnEvaporatingWaterEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAPHelperActor_OnEvaporatingWaterEndOverlap;

// Function AuActorPlacement.AuAPHelperActor.OnFoundationSetUp
// 0x0010 (0x0010 - 0x0000)
struct AuAPHelperActor_OnFoundationSetUp final
{
public:
	TArray<struct FTransform>                     FoundationTransforms;                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_OnFoundationSetUp;

// Function AuActorPlacement.AuAPHelperActor.OnPlacedObjectClassChange
// 0x0008 (0x0008 - 0x0000)
struct AuAPHelperActor_OnPlacedObjectClassChange final
{
public:
	TSubclassOf<class AActor>                     NewClass;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_OnPlacedObjectClassChange;

// Function AuActorPlacement.AuAPHelperActor.OnSetReplacingExistingActor
// 0x0001 (0x0001 - 0x0000)
struct AuAPHelperActor_OnSetReplacingExistingActor final
{
public:
	bool                                          bSet;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_OnSetReplacingExistingActor;

// Function AuActorPlacement.AuAPHelperActor.ServerSetCustomSkeletalMesh
// 0x0070 (0x0070 - 0x0000)
struct AuAPHelperActor_ServerSetCustomSkeletalMesh final
{
public:
	class USkeletalMesh*                          InMesh;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RelativeTransform;                                 // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_ServerSetCustomSkeletalMesh;

// Function AuActorPlacement.AuAPHelperActor.ServerSetCustomStaticMesh
// 0x0070 (0x0070 - 0x0000)
struct AuAPHelperActor_ServerSetCustomStaticMesh final
{
public:
	class UStaticMesh*                            InMesh;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RelativeTransform;                                 // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_ServerSetCustomStaticMesh;

// Function AuActorPlacement.AuAPHelperActor.ServerSetFoundationISM
// 0x0018 (0x0018 - 0x0000)
struct AuAPHelperActor_ServerSetFoundationISM final
{
public:
	class UStaticMesh*                            InMesh;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InSizeX;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InSizeY;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InYaw;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAPHelperActor_ServerSetFoundationISM;

// Function AuActorPlacement.AuAPHelperActor.ServerSetHelperVisible
// 0x0001 (0x0001 - 0x0000)
struct AuAPHelperActor_ServerSetHelperVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_ServerSetHelperVisible;

// Function AuActorPlacement.AuAPHelperActor.ServerSetMainMeshZOffset
// 0x0004 (0x0004 - 0x0000)
struct AuAPHelperActor_ServerSetMainMeshZOffset final
{
public:
	float                                         ZOffset;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_ServerSetMainMeshZOffset;

// Function AuActorPlacement.AuAPHelperActor.ServerSetPlacementConditionResult
// 0x0001 (0x0001 - 0x0000)
struct AuAPHelperActor_ServerSetPlacementConditionResult final
{
public:
	EAuAPlacementConditionResult                  InResult;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_ServerSetPlacementConditionResult;

// Function AuActorPlacement.AuAPHelperActor.ServerSetPositionToServer
// 0x0038 (0x0038 - 0x0000)
struct AuAPHelperActor_ServerSetPositionToServer final
{
public:
	struct FVector                                InLoc;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRot;                                             // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bFoundation;                                       // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MainMeshZOffset;                                   // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_ServerSetPositionToServer;

// Function AuActorPlacement.AuAPHelperActor.ServerSetReplacingExistingActor
// 0x0018 (0x0018 - 0x0000)
struct AuAPHelperActor_ServerSetReplacingExistingActor final
{
public:
	struct FCrMassActorReplicationHelper          ToReplace;                                         // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_ServerSetReplacingExistingActor;

// Function AuActorPlacement.AuAPHelperActor.ServerSetTilesISM
// 0x0018 (0x0018 - 0x0000)
struct AuAPHelperActor_ServerSetTilesISM final
{
public:
	class UStaticMesh*                            InMesh;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InSizeX;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InSizeY;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InYaw;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAPHelperActor_ServerSetTilesISM;

// Function AuActorPlacement.AuAPHelperActor.SetMeshColor
// 0x0010 (0x0010 - 0x0000)
struct AuAPHelperActor_SetMeshColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_SetMeshColor;

// Function AuActorPlacement.AuAPHelperActor.IsReplacingExistingActor
// 0x0001 (0x0001 - 0x0000)
struct AuAPHelperActor_IsReplacingExistingActor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActor_IsReplacingExistingActor;

// Function AuActorPlacement.AuAPHelperActorMultiConfirm.OnCancelPoint
// 0x0004 (0x0004 - 0x0000)
struct AuAPHelperActorMultiConfirm_OnCancelPoint final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActorMultiConfirm_OnCancelPoint;

// Function AuActorPlacement.AuAPHelperActorMultiConfirm.OnConfirmedPoint
// 0x0148 (0x0148 - 0x0000)
struct AuAPHelperActorMultiConfirm_OnConfirmedPoint final
{
public:
	struct FAuAPConfirmPointData                  NewPoint;                                          // 0x0000(0x0148)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActorMultiConfirm_OnConfirmedPoint;

// Function AuActorPlacement.AuAPHelperActorMultiConfirm.OnRep_ConfirmedPoints
// 0x0010 (0x0010 - 0x0000)
struct AuAPHelperActorMultiConfirm_OnRep_ConfirmedPoints final
{
public:
	TArray<struct FAuAPConfirmPointData>          LastPoints;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActorMultiConfirm_OnRep_ConfirmedPoints;

// Function AuActorPlacement.AuAPHelperActorMultiConfirm.ServerAddConfirmPoint
// 0x0148 (0x0148 - 0x0000)
struct AuAPHelperActorMultiConfirm_ServerAddConfirmPoint final
{
public:
	struct FAuAPConfirmPointData                  NewPoint;                                          // 0x0000(0x0148)(ConstParm, Parm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActorMultiConfirm_ServerAddConfirmPoint;

// Function AuActorPlacement.AuAPHelperActorMultiConfirm.ServerRemoveConfirmPoint
// 0x0004 (0x0004 - 0x0000)
struct AuAPHelperActorMultiConfirm_ServerRemoveConfirmPoint final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActorMultiConfirm_ServerRemoveConfirmPoint;

// Function AuActorPlacement.AuAPHelperActorMultiConfirm.ServerSetMouseLocation
// 0x0018 (0x0018 - 0x0000)
struct AuAPHelperActorMultiConfirm_ServerSetMouseLocation final
{
public:
	struct FVector                                NewLoc;                                            // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActorMultiConfirm_ServerSetMouseLocation;

// Function AuActorPlacement.AuAPHelperActorSpline.OnSplinePointAdded
// 0x0004 (0x0004 - 0x0000)
struct AuAPHelperActorSpline_OnSplinePointAdded final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActorSpline_OnSplinePointAdded;

// Function AuActorPlacement.AuAPHelperActorSpline.OnSplinePointRemoved
// 0x0004 (0x0004 - 0x0000)
struct AuAPHelperActorSpline_OnSplinePointRemoved final
{
public:
	int32                                         PointIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActorSpline_OnSplinePointRemoved;

// Function AuActorPlacement.AuAPHelperActorSpline.ServerSetEndPointAndTangents
// 0x0048 (0x0048 - 0x0000)
struct AuAPHelperActorSpline_ServerSetEndPointAndTangents final
{
public:
	struct FVector                                NewLoc;                                            // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StartTangent;                                      // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndTangent;                                        // 0x0030(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAPHelperActorSpline_ServerSetEndPointAndTangents;

}

