#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuCueTranslator

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct AuCueTranslator.AuTranslationUnit
// 0x0018 (0x0018 - 0x0000)
struct FAuTranslationUnit final
{
public:
	class FName                                   From;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           To;                                                // 0x0008(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuTranslationUnit;

// ScriptStruct AuCueTranslator.AuTranslatorUnit
// 0x0038 (0x0038 - 0x0000)
struct FAuTranslatorUnit final
{
public:
	TSoftClassPtr<class UClass>                   TranslatorClass;                                   // 0x0000(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Units;                                             // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuTranslatorUnit;

// ScriptStruct AuCueTranslator.AuCueName
// 0x0008 (0x0008 - 0x0000)
struct FAuCueName final
{
public:
	class FName                                   CueName;                                           // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuCueName;

}

