#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuNotification

#include "Basic.hpp"

#include "AuNotification_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class AuNotification.AuNotificationSettings
// 0x0050 (0x0088 - 0x0038)
class UAuNotificationSettings final : public UDeveloperSettings
{
public:
	TMap<class FName, struct FAuNotificationSetting> NotificationWidgets;                            // 0x0038(0x0050)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuNotificationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuNotificationSettings")
	}
	static class UAuNotificationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuNotificationSettings>();
	}
};
DUMPER7_ASSERTS_UAuNotificationSettings;

// Class AuNotification.AuNotificationSubsystem
// 0x0020 (0x0050 - 0x0030)
class UAuNotificationSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuNotificationSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuNotificationSubsystem")
	}
	static class UAuNotificationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuNotificationSubsystem>();
	}
};
DUMPER7_ASSERTS_UAuNotificationSubsystem;

// Class AuNotification.AuUW_NotificationBase
// 0x0008 (0x03A8 - 0x03A0)
class UAuUW_NotificationBase : public UUserWidget
{
public:
	float                                         MaxLifetime;                                       // 0x03A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuUW_NotificationBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuUW_NotificationBase")
	}
	static class UAuUW_NotificationBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuUW_NotificationBase>();
	}
};
DUMPER7_ASSERTS_UAuUW_NotificationBase;

// Class AuNotification.AuUW_NotificationContainer
// 0x0098 (0x0438 - 0x03A0)
class UAuUW_NotificationContainer : public UUserWidget
{
public:
	TArray<struct FAuNotifyItem>                  ActiveNotifications;                               // 0x03A0(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FAuNotifyItem>                  PendingAddNotifications;                           // 0x03B0(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FAuNotifyItem>                  PendingRemovals;                                   // 0x03C0(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class FName, float>                      DisplayTimes;                                      // 0x03D0(0x0050)(NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UObject>>            LoadedNotificationWidgets;                         // 0x0420(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_430[0x8];                                      // 0x0430(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNotificationAdded(class UAuUW_NotificationBase* NewNotification);
	void OnNotificationRemoved(class UAuUW_NotificationBase* NewNotification);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuUW_NotificationContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuUW_NotificationContainer")
	}
	static class UAuUW_NotificationContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuUW_NotificationContainer>();
	}
};
DUMPER7_ASSERTS_UAuUW_NotificationContainer;

}

