#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CoolerActive

#include "Basic.hpp"

#include "Chimera_structs.hpp"


namespace SDK::Params
{

// Function BP_CoolerActive.BP_CoolerActive_C.ExecuteUbergraph_BP_CoolerActive
// 0x0020 (0x0020 - 0x0000)
struct BP_CoolerActive_C_ExecuteUbergraph_BP_CoolerActive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_Event_ConnectedSockets;                     // 0x0008(0x0010)(ConstParm, ReferenceParm)
	float                                         K2Node_Event_UsedSpaceNormalized;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrMassHeaterCoolerState                      K2Node_Event_State;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CoolerActive_C_ExecuteUbergraph_BP_CoolerActive;

// Function BP_CoolerActive.BP_CoolerActive_C.OnHeaterCoolerConnectionsChanged
// 0x0010 (0x0010 - 0x0000)
struct BP_CoolerActive_C_OnHeaterCoolerConnectionsChanged final
{
public:
	TArray<class FName>                           ConnectedSockets;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CoolerActive_C_OnHeaterCoolerConnectionsChanged;

// Function BP_CoolerActive.BP_CoolerActive_C.OnHeaterCoolerInventoryChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_CoolerActive_C_OnHeaterCoolerInventoryChanged final
{
public:
	float                                         UsedSpaceNormalized;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CoolerActive_C_OnHeaterCoolerInventoryChanged;

// Function BP_CoolerActive.BP_CoolerActive_C.OnHeaterCoolerStateChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_CoolerActive_C_OnHeaterCoolerStateChanged final
{
public:
	ECrMassHeaterCoolerState                      State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CoolerActive_C_OnHeaterCoolerStateChanged;

// Function BP_CoolerActive.BP_CoolerActive_C.OnSocketConnected
// 0x0008 (0x0008 - 0x0000)
struct BP_CoolerActive_C_OnSocketConnected final
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CoolerActive_C_OnSocketConnected;

// Function BP_CoolerActive.BP_CoolerActive_C.OnSocketDisconnected
// 0x0008 (0x0008 - 0x0000)
struct BP_CoolerActive_C_OnSocketDisconnected final
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CoolerActive_C_OnSocketDisconnected;

}

