#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DroneRailHelperT1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DroneRailHelperT1.BP_DroneRailHelperT1_C
// 0x0060 (0x0970 - 0x0910)
class ABP_DroneRailHelperT1_C : public ACrHelperDroneRailSpline
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0910(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   RailConnector;                                     // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class USplineMeshComponent*>           SplineMeshes;                                      // 0x0920(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        DesiredSectionLength;                              // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SectionLength;                                     // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentSegments;                                   // 0x0940(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_944[0x4];                                      // 0x0944(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBillboardComponent*>            CollisionHitsIndicators;                           // 0x0948(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UStaticMesh*                            SplineMeshAsset;                                   // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 ArrowsColor;                                       // 0x0960(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnCollisionHitsChanged();
	void ExecuteUbergraph_BP_DroneRailHelperT1(int32 EntryPoint);
	void OnConfirmedPoint(const struct FAuAPConfirmPointData& NewPoint);
	void OnSetReplacingExistingActor(bool bSet);
	void ReceiveTick(float DeltaSeconds);
	void SetMeshColor(const struct FLinearColor& Color);
	void SetSplineSegment(class USplineMeshComponent* SplineMeshComponent, int32 FirstPointIndex, int32 SecondPointIndex);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DroneRailHelperT1_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DroneRailHelperT1_C")
	}
	static class ABP_DroneRailHelperT1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DroneRailHelperT1_C>();
	}
};
DUMPER7_ASSERTS_ABP_DroneRailHelperT1_C;

}

