#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FloatingDrone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FloatingDrone.BP_FloatingDrone_C
// 0x0028 (0x04D8 - 0x04B0)
class ABP_FloatingDrone_C final : public ACrCharacterDroneBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Capsule;                                           // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_BuidingDrone;                                   // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCrHeroComponent*                       HeroComponent;                                     // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FloatingDrone(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FloatingDrone_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FloatingDrone_C")
	}
	static class ABP_FloatingDrone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FloatingDrone_C>();
	}
};
DUMPER7_ASSERTS_ABP_FloatingDrone_C;

}

