#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Gatherable_Plant_h

#include "Basic.hpp"

#include "Chimera_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Gatherable_Plant_h.BP_Gatherable_Plant_h_C.BP_OnWaveChangedUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_Gatherable_Plant_h_C_BP_OnWaveChangedUpdate final
{
public:
	EEnviroWave                                   WaveType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWaveStage                              WaveStage;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWaveFadeoutSubstage                    FadeoutSubstage;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWaveGrowbackSubstage                   GrowbackSubstage;                                  // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Gatherable_Plant_h_C_BP_OnWaveChangedUpdate;

// Function BP_Gatherable_Plant_h.BP_Gatherable_Plant_h_C.ExecuteUbergraph_BP_Gatherable_Plant_h
// 0x0020 (0x0020 - 0x0000)
struct BP_Gatherable_Plant_h_C_ExecuteUbergraph_BP_Gatherable_Plant_h final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWave                                   K2Node_Event_WaveType;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWaveStage                              K2Node_Event_WaveStage;                            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWaveFadeoutSubstage                    K2Node_Event_FadeoutSubstage;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWaveGrowbackSubstage                   K2Node_Event_GrowbackSubstage;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrGatherableSpawnersSubsystem*         CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsGatherableDepleted_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Gatherable_Plant_h_C_ExecuteUbergraph_BP_Gatherable_Plant_h;

// Function BP_Gatherable_Plant_h.BP_Gatherable_Plant_h_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Gatherable_Plant_h_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Gatherable_Plant_h_C_ReceiveEndPlay;

}

