#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MassAILocalSpawnerWithPCG_Placeable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MassAIPrototypeEnemyRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MassAILocalSpawnerWithPCG_Placeable.BP_MassAILocalSpawnerWithPCG_Placeable_C
// 0x0038 (0x0548 - 0x0510)
class ABP_MassAILocalSpawnerWithPCG_Placeable_C : public AMassEnemyAiSpawner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMassEnemySpawnerTriggerSphere*         DisableSphere;                                     // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMassEnemySpawnerTriggerSphere*         EnableSphere;                                      // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMassEnemySpawnPositionComponent*       SpawnPosition;                                     // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 ConfigurationStatusString;                         // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MassAILocalSpawnerWithPCG_Placeable(int32 EntryPoint);
	void NotifyShowDebugVariableChanged(bool ShouldShowDebug);
	void OnDebugTick();
	void RotateStatusTextTowardsPlayer();
	void UpdateStatusText();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MassAILocalSpawnerWithPCG_Placeable_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MassAILocalSpawnerWithPCG_Placeable_C")
	}
	static class ABP_MassAILocalSpawnerWithPCG_Placeable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MassAILocalSpawnerWithPCG_Placeable_C>();
	}
};
DUMPER7_ASSERTS_ABP_MassAILocalSpawnerWithPCG_Placeable_C;

}

