#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Melee_Tier1_Actor_Character

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_BaseAI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Melee_Tier1_Actor_Character.BP_Melee_Tier1_Actor_Character_C
// 0x0040 (0x0C40 - 0x0C00)
class ABP_Melee_Tier1_Actor_Character_C final : public ABP_BaseAI_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Melee_Tier1_Actor_Character_C;   // 0x0BF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCrAiMeleeAnimationStateSyncComponent*  CrAiMeleeAnimationStateSync;                       // 0x0C00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Tendrils;                                       // 0x0C08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraEyes;                                       // 0x0C10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StrafePositionModifier;                            // 0x0C18(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FakeStrafeAlphaMod;                                // 0x0C30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C34[0x4];                                      // 0x0C34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FakeStrafeMagnitudeMod;                            // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CanChangeEyeColor(bool* Result);
	void ExecuteUbergraph_BP_Melee_Tier1_Actor_Character(int32 EntryPoint);
	void OnAiDied(const struct FHitResult& HitResult, const struct FGameplayTag& KillingDamageTag);
	void OnVisualVariationChanged(const struct FVector& NewVisualVariationSeed);
	void SetIsAggroEyeColor(bool NewIsAggro);
	void SetIsBoostedEyeColor(bool NewIsBoosted);
	void SetIsJumpEyeBehaviour(bool NewIsJumpEyeBehaviour);
	void TryApplySpeedup();
	void TryApplySpeedupRemoveActivator();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Melee_Tier1_Actor_Character_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Melee_Tier1_Actor_Character_C")
	}
	static class ABP_Melee_Tier1_Actor_Character_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Melee_Tier1_Actor_Character_C>();
	}
};
DUMPER7_ASSERTS_ABP_Melee_Tier1_Actor_Character_C;

}

