#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerCharacter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CommonInput_structs.hpp"
#include "AuCamera_structs.hpp"
#include "BS_WeaponFOV_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AuActorPlacement_structs.hpp"
#include "Chimera_structs.hpp"
#include "Chimera_classes.hpp"
#include "EPlayerState_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerCharacter.BP_PlayerCharacter_C
// 0x0390 (0x18B0 - 0x1520)
class ABP_PlayerCharacter_C final : public ACrCharacterPlayerBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCrAgentAudioSourceComponent*           CrAgentAudioSource;                                // 0x1528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    StatusIcon;                                        // 0x1530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPlayer_DPS_Evaluation_Comp_C*          Player_DPS_Evaluation_Comp;                        // 0x1538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FPP_CameraAnimsComp_C*              BP_FPP_CameraAnimsComp;                            // 0x1540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SKM_Legs;                                          // 0x1548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x1550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      WindyDust;                                         // 0x1558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   TPP_Player_Cosmetics_ChildActor;                   // 0x1560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   FPP_Player_Cosmetics_ChildActor;                   // 0x1568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArmFpp;                                      // 0x1570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_HeadBobbingComp_C*                  BP_HeadBobbingComp;                                // 0x1578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       FPPMontageCamera;                                  // 0x1580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCrHeroComponent*                       CrHeroComponent;                                   // 0x1588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_ShakeScale_4511BEB9664BA65AD90ED1A1985F1BC6; // 0x1590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_4511BEB9664BA65AD90ED1A1985F1BC6; // 0x1594(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1595[0x3];                                     // 0x1595(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x1598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         FocusInteractionDirection_Lerp_FFBD6D444F930AD27A3B74A76ED8EB1F; // 0x15A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FocusInteractionDirection__Direction_FFBD6D444F930AD27A3B74A76ED8EB1F; // 0x15A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A5[0x3];                                     // 0x15A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FocusInteractionDirection;                         // 0x15A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBS_WeaponFOV                          DefaultFOV;                                        // 0x15B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCrouching_;                                      // 0x15D8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D9[0x3];                                     // 0x15D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DeathType;                                         // 0x15DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Damage_Tag;                                        // 0x15E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          isMontagePlaying_;                                 // 0x15E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E9[0x3];                                     // 0x15E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WeaponId;                                          // 0x15EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   OccupyingSpawnPointMontages;                       // 0x15F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnJumpEventDisptacher;                             // 0x1600(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnLandedEventDispatcher;                           // 0x1618(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FVector                                InitialRelativeFPPCameraLocation;                  // 0x1630(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         SpawnPointImmunityGE;                              // 0x1648(0x0010)(Edit, BlueprintVisible)
	TArray<struct FActiveGameplayEffectHandle>    ActiveImmunityEffectHandles;                       // 0x1658(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSubclassOf<class UGameplayEffect>            DeathClearEffect;                                  // 0x1668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CanZipline;                                        // 0x1670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1671[0x7];                                     // 0x1671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ZipStart;                                          // 0x1678(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ZipEnd;                                            // 0x1690(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   In_Tool_Tip_Text;                                  // 0x16A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        ZiplineSpeedModifier;                              // 0x16B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveVector*                           WeaponSwayCurve;                                   // 0x16C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WeaponSwayVector;                                  // 0x16C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanMove_;                                          // 0x16E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E1[0x7];                                     // 0x16E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AnimationName;                                     // 0x16E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsOnZipline;                                       // 0x16F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDeconstructing_;                                 // 0x16F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasLeftHandSocket;                                 // 0x16FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16FB[0x5];                                     // 0x16FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             WeaponLeftHandSocketTransform;                     // 0x1700(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UAnimInstance>              Unarmed_Anim_Layers_FPP;                           // 0x1760(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAudioComponent*                        Player_Slide_SFX;                                  // 0x1768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioComponentDialogue;                            // 0x1770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UDialogueWave*>                  LoadedDialogueWaves;                               // 0x1778(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCrSurfaceFootstepData*                 FootstepSounds;                                    // 0x1788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UW_ChimeraHitmark_C*>            HitmarksWidgets;                                   // 0x1790(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FAuCameraAdditiveHandle                SlideCameraModifier;                               // 0x17A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FAuCameraAdditiveHandle                SprintCameraModifier;                              // 0x17A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UCrAsyncTaskGameplayTag*                ZiplineTagAsyncTask;                               // 0x17B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_ZiplineArm_C*                       ZiplineArmActor;                                   // 0x17B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          RidingZipline;                                     // 0x17C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C1[0x7];                                     // 0x17C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrAsyncTaskGameplayTag*                CrAsyncTaskListenForInWater;                       // 0x17C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Landed;                                            // 0x17D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D1[0x7];                                     // 0x17D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ECrHitmarkType, class UW_ChimeraHitmark_C*> DisplayedHitmarksPertype;                       // 0x17D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UCrAsyncTaskEffectStackChanged*         ListenInfectionEffectAsync_Task;                   // 0x1828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              DashCostFailed;                                    // 0x1830(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<EProfessionType, class UCrPlayerCharacterSpecificPossessionSettings*> ProfessionsData;      // 0x1848(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CurrentDialogueIsImportant;                        // 0x1898(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1899[0x3];                                     // 0x1899(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CurrentDialogueResponseName;                       // 0x189C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A4[0x4];                                     // 0x18A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialogueWave*                          LoadedDialogueWave;                                // 0x18A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool BlockEnergyLoweringDuringSprint();
	void BndEvt__BP_PlayerCharacter_FlashlightComponent_K2Node_ComponentBoundEvent_0_OnFlashlightActivated__DelegateSignature();
	void BndEvt__BP_PlayerCharacter_FlashlightComponent_K2Node_ComponentBoundEvent_1_OnFlashlightDeactivated__DelegateSignature();
	void BndEvt__BP_PlayerCharacter_FlashlightComponent_K2Node_ComponentBoundEvent_2_OnFlashlightModeChanged__DelegateSignature();
	void BP_OnPlayerEnteredMovingWave();
	void BP_OnPossess();
	void CanPlaceChestOnChest(const struct FHitResult& Hit_Result, bool* Return);
	void DestroyEquippedWeaponActor();
	void EquipWeaponWithDelay(const struct FAuItemSlot& Slot, float Delay);
	bool ExecuteContextualResponse(const struct FContextualResponsePayload& ResponseData, class FName RuleNameContainingResponseData);
	void ExecuteContextualResponseMulticast(TSoftObjectPtr<class UDialogueWave> Dialogue_Wave, bool is_Important, class FName Response_Name);
	void ExecuteUbergraph_BP_PlayerCharacter(int32 EntryPoint);
	void FixRoll();
	void FocusInteractionDirection__FinishedFunc();
	void FocusInteractionDirection__UpdateFunc();
	void ForceRemoveAllHitmarks();
	TArray<class AActor*> GetAllIgnoreActorForLocalInteractionTraces();
	struct FVector GetDropItemsLocation();
	TArray<struct FVector> GetDropItemsLocations(int32 LocationsAmount);
	void GetFppCameraHeight(double* Height);
	void GetProfessionBasedCharacterData(class UCrPlayerCharacterSpecificPossessionSettings** Profession_Data, bool* Return);
	void Getting_Current_State(EPlayerState* PlayerState_0);
	void GetUnarmedAnimInstanceTPPForCurrentProfession(class UClass** Anim_Instance);
	void HasValidWeaponEquipped(bool* Return_Value);
	void HeroComponentReady(const struct FActorInitStateChangedParams& Params_0);
	void InpActEvt_CloseInGameMenu_K2Node_EnhancedInputActionEvent_7(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_Crouch_K2Node_EnhancedInputActionEvent_12(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_Crouch_K2Node_EnhancedInputActionEvent_13(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_Dash_K2Node_EnhancedInputActionEvent_6(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_GiveUp_K2Node_EnhancedInputActionEvent_8(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_GiveUp_K2Node_EnhancedInputActionEvent_9(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_HolsterWeapon_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_HolsterWeapon_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_Interact_K2Node_EnhancedInputActionEvent_11(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_Jump_K2Node_EnhancedInputActionEvent_10(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_L_K2Node_InputDebugKeyEvent_1(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_OpenEOSOverlay_K2Node_EnhancedInputActionEvent_5(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_Reload_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_Reload_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_Reload_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_X_K2Node_InputDebugKeyEvent_0(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_X_K2Node_InputDebugKeyEvent_3(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Z_K2Node_InputDebugKeyEvent_2(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void IsAnyKillTypeHitmarkDisplayed(bool* Return);
	void K2_ClientOnInteractionEnded(class AActor* TargetActor);
	void K2_ClientOnInteractionStarted(class AActor* TargetActor);
	void K2_OnBecomeViewTarget(class APlayerController* PC);
	void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
	void K2_OnEndViewTarget(class APlayerController* PC);
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
	void LocalEquipFirstSlotWeapon();
	void LowerEnergyForSecondJump(bool* Return_Value);
	void On_Sprinting_Changed(class ACharacter* Character, bool bIsNowSprinting);
	void OnBlendOut_3C917D864D3A56CADF569987ABEAC42F(class FName NotifyName);
	void OnBPStartOccupyingSpawnPoint();
	void OnCompleted_3C917D864D3A56CADF569987ABEAC42F(class FName NotifyName);
	void OnDashMovementModeChanged(bool bIsDoingDash);
	void OnDialogueWaveLoaded(class UDialogueWave* DialogueWaveLoaded);
	void OnDied();
	void OnDoubleJumpFailedOfEnergyCost();
	void OnEnterIncapacitatedState();
	void OnExitSpawnPointBP();
	void OnGameplayEffectStackChange_12F7879349C7C8D4A64C77947458706C(const struct FGameplayTag& EffectGameplayTag, const struct FActiveGameplayEffectHandle& Handle, int32 NewStackCount, int32 OldStackCount);
	void OnHealingTargetsComfirmed(const struct FGameplayTag& TraceTag, const struct FHitResult& HitResult);
	void OnHealingTargetsUnconfirmed(const struct FGameplayTag& TraceTag, class AActor* Actor);
	void OnIncapacitadedStateChanged(bool bNowIncapacitated, bool Revived);
	void OnInterrupted_3C917D864D3A56CADF569987ABEAC42F(class FName NotifyName);
	void OnJumped();
	void OnJumpedMulticast(bool DoubleJump);
	void OnLanded(const struct FHitResult& Hit);
	void OnNotifyBegin_3C917D864D3A56CADF569987ABEAC42F(class FName NotifyName);
	void OnNotifyEnd_3C917D864D3A56CADF569987ABEAC42F(class FName NotifyName);
	void OnReplicatedHeatStackCount(const struct FHarvesterRepHeatStackInfo& OutCurrentHarvesterHeatStack);
	void OnRespawn();
	bool OnResponseFinished(const struct FContextualResponsePayload& ResponseData, class FName RuleNameContainingResponseData);
	void OnSlideMovementModeChanged(bool IsSliding);
	void OnTagAdded_1109671788423649D6346B9CDC564413(const struct FGameplayTag& Tag);
	void OnTagAdded_A6EB94DC44B2FF09F8430B98BC792FA8(const struct FGameplayTag& Tag);
	void OnTagRemoved_1109671788423649D6346B9CDC564413(const struct FGameplayTag& Tag);
	void OnTagRemoved_A6EB94DC44B2FF09F8430B98BC792FA8(const struct FGameplayTag& Tag);
	void OnZiplineModeEnded();
	void OnZiplineModeStarted();
	void OnZipLineMovementModeChanged(bool OnZipline);
	void OnZiplineTravelCancelled();
	void OnZiplineTravelEnded();
	void OnZiplineTravelStarted();
	void PostRespawn();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceivePossessed(class AController* NewController);
	void ReceiveTick(float DeltaSeconds);
	void ResetFPPCameraTransform(bool Delay);
	void ServerSetCrouching(bool bIsCrouching);
	void Set_Zipline(bool Enable, const struct FVector& Pos1, const struct FVector& Pos2);
	void SetDeconstruct(bool bInDeconstruct);
	void SetFppLegsVisibility(bool NewVisible);
	void ShowHitmark(class AActor* TargetActor, ECrHitmarkType HitmarkToShow);
	void SkipCurrentDialogueInternal();
	void SpawnHitmarkWidget(ECrHitmarkType Hitmark);
	void SwitchToAnimatedFppCamera();
	void SwitchToNormalFppCamera();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UpdateCharacterCollisionBasedOnDeadStatus();
	bool UpdateCharacterCosmeticsForCurrentProfession();
	void UpdateHitmarksSounds(ECrHitmarkType New_Hitmark_Type, bool* Fade_Out_Previous_, bool* Play_New_Hitmark_Sound);
	void UserConstructionScript();

	bool CanJumpInternal() const;
	void GatherAllIgnoredActors(TArray<class AActor*>* OutIgnoredActors) const;
	bool IsCharacterGameplayReady() const;
	bool IsPlayingDialogue() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PlayerCharacter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PlayerCharacter_C")
	}
	static class ABP_PlayerCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayerCharacter_C>();
	}
};
DUMPER7_ASSERTS_ABP_PlayerCharacter_C;

}

