#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Purplant

#include "Basic.hpp"

#include "Chimera_structs.hpp"


namespace SDK::Params
{

// Function BP_Purplant.BP_Purplant_C.BP_OnWaveChangedUpdate
// 0x0004 (0x0004 - 0x0000)
struct BP_Purplant_C_BP_OnWaveChangedUpdate final
{
public:
	EEnviroWave                                   WaveType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWaveStage                              WaveStage;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWaveFadeoutSubstage                    FadeoutSubstage;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWaveGrowbackSubstage                   GrowbackSubstage;                                  // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Purplant_C_BP_OnWaveChangedUpdate;

// Function BP_Purplant.BP_Purplant_C.ExecuteUbergraph_BP_Purplant
// 0x0008 (0x0008 - 0x0000)
struct BP_Purplant_C_ExecuteUbergraph_BP_Purplant final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWave                                   K2Node_Event_WaveType;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWaveStage                              K2Node_Event_WaveStage;                            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWaveFadeoutSubstage                    K2Node_Event_FadeoutSubstage;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWaveGrowbackSubstage                   K2Node_Event_GrowbackSubstage;                     // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Purplant_C_ExecuteUbergraph_BP_Purplant;

}

