#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_FindRandomShootingLocationFromTarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_FindRandomShootingLocationFromTarget.BTT_FindRandomShootingLocationFromTarget_C
// 0x0070 (0x0118 - 0x00A8)
class UBTT_FindRandomShootingLocationFromTarget_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Target;                                            // 0x00B0(0x0028)(Edit, BlueprintVisible)
	double                                        HalfAngleDeg;                                      // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SearchCenterDistance;                              // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SearchRadius;                                      // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 OutLocationKey;                                    // 0x00F0(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_FindRandomShootingLocationFromTarget(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_FindRandomShootingLocationFromTarget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_FindRandomShootingLocationFromTarget_C")
	}
	static class UBTT_FindRandomShootingLocationFromTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_FindRandomShootingLocationFromTarget_C>();
	}
};
DUMPER7_ASSERTS_UBTT_FindRandomShootingLocationFromTarget_C;

}

