#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_CalculateBuildingShootAtLocation

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_CalculateBuildingShootAtLocation.BTT_CalculateBuildingShootAtLocation_C
// 0x0100 (0x01A8 - 0x00A8)
class UBTT_CalculateBuildingShootAtLocation_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          UseTopOfTargetExtents;                             // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseRandomizedHeight;                               // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RemoveExtents;                                     // 0x00B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              AimPointTargetHeightRatioRange;                    // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 TargetLocation;                                    // 0x00C8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 OutLocationKey;                                    // 0x00F0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 TargetExtents;                                     // 0x0118(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 TargetRotator;                                     // 0x0140(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 SelfActorKey;                                      // 0x0168(0x0028)(Edit, BlueprintVisible)
	struct FVector                                TopExtentsOffset;                                  // 0x0190(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_CalculateBuildingShootAtLocation(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_CalculateBuildingShootAtLocation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_CalculateBuildingShootAtLocation_C")
	}
	static class UBTT_CalculateBuildingShootAtLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_CalculateBuildingShootAtLocation_C>();
	}
};
DUMPER7_ASSERTS_UBTT_CalculateBuildingShootAtLocation_C;

}

