#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_Animal_Panzerhund_SaveDangerSignalTimestamp

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTTask_Animal_Panzerhund_SaveDangerSignalTimestamp.BTTask_Animal_Panzerhund_SaveDangerSignalTimestamp_C.ExecuteUbergraph_BTTask_Animal_Panzerhund_SaveDangerSignalTimestamp
// 0x0028 (0x0028 - 0x0000)
struct BTTask_Animal_Panzerhund_SaveDangerSignalTimestamp_C_ExecuteUbergraph_BTTask_Animal_Panzerhund_SaveDangerSignalTimestamp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetTimeSeconds_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBlackboardValueAsFloat_Value_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTTask_Animal_Panzerhund_SaveDangerSignalTimestamp_C_ExecuteUbergraph_BTTask_Animal_Panzerhund_SaveDangerSignalTimestamp;

// Function BTTask_Animal_Panzerhund_SaveDangerSignalTimestamp.BTTask_Animal_Panzerhund_SaveDangerSignalTimestamp_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_Animal_Panzerhund_SaveDangerSignalTimestamp_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTTask_Animal_Panzerhund_SaveDangerSignalTimestamp_C_ReceiveExecuteAI;

}

