#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChimeraInteriorsMapper

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ChimeraInteriorsMapper.CrInteriorsMapperBoxComponent
// 0x0050 (0x05C0 - 0x0570)
class UCrInteriorsMapperBoxComponent final : public UBoxComponent
{
public:
	uint8                                         Pad_568[0x8];                                      // 0x0568(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          UseOnlyWithNiagara;                                // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Only2D;                                            // 0x0571(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_572[0x6];                                      // 0x0572(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   PlaneMesh;                                         // 0x0578(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UStaticMesh*                            BasicPlane;                                        // 0x0580(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterialInterface*                     TargetBoxMaterial;                                 // 0x0588(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class URuntimeVirtualTexture*                 TargetTexture;                                     // 0x0590(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class FName                                   InteriorMapperZMinName;                            // 0x0598(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   InteriorMapperZMaxName;                            // 0x05A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 AddonKeyword;                                      // 0x05A8(0x0010)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5B8[0x8];                                      // 0x05B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrInteriorsMapperBoxComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrInteriorsMapperBoxComponent")
	}
	static class UCrInteriorsMapperBoxComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrInteriorsMapperBoxComponent>();
	}
};
DUMPER7_ASSERTS_UCrInteriorsMapperBoxComponent;

// Class ChimeraInteriorsMapper.CrInteriorsMapperDebugActor
// 0x0018 (0x02C0 - 0x02A8)
class ACrInteriorsMapperDebugActor final : public AActor
{
public:
	class UCrInteriorsMapperSphereComponent*      SphereMapper;                                      // 0x02A8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UTextureRenderTarget2D*                 MappersRT;                                         // 0x02B0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x02B8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrInteriorsMapperDebugActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrInteriorsMapperDebugActor")
	}
	static class ACrInteriorsMapperDebugActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACrInteriorsMapperDebugActor>();
	}
};
DUMPER7_ASSERTS_ACrInteriorsMapperDebugActor;

// Class ChimeraInteriorsMapper.CrInteriorsMapperInterface
// 0x0000 (0x0000 - 0x0000)
class ICrInteriorsMapperInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrInteriorsMapperInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrInteriorsMapperInterface")
	}
	static class ICrInteriorsMapperInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICrInteriorsMapperInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICrInteriorsMapperInterface;

// Class ChimeraInteriorsMapper.CrInteriorsMapperSphereComponent
// 0x0030 (0x0590 - 0x0560)
class UCrInteriorsMapperSphereComponent final : public USphereComponent
{
public:
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          UseOnlyWithNiagara;                                // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   SphereMesh;                                        // 0x0568(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UStaticMesh*                            BasicPlane;                                        // 0x0570(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterialInterface*                     TargetSphereMaterial;                              // 0x0578(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class URuntimeVirtualTexture*                 TargetTexture;                                     // 0x0580(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_588[0x8];                                      // 0x0588(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrInteriorsMapperSphereComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrInteriorsMapperSphereComponent")
	}
	static class UCrInteriorsMapperSphereComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrInteriorsMapperSphereComponent>();
	}
};
DUMPER7_ASSERTS_UCrInteriorsMapperSphereComponent;

// Class ChimeraInteriorsMapper.CrInteriorsMapperWorldSubsystem
// 0x0070 (0x00B0 - 0x0040)
class UCrInteriorsMapperWorldSubsystem final : public UTickableWorldSubsystem
{
public:
	TArray<TScriptInterface<class ICrInteriorsMapperInterface>> MapperSpheres;                       // 0x0040(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TScriptInterface<class ICrInteriorsMapperInterface>> MapperBoxes;                         // 0x0050(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 SphereMappersRT;                                   // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UTextureRenderTarget2D*                 BoxMappersOriginRT;                                // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UTextureRenderTarget2D*                 BoxMappersExtentRT;                                // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UMaterialParameterCollection*           InteriorsMPC;                                      // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	int32                                         MaxInteriorMapper;                                 // 0x0080(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         UpdateThreshold;                                   // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxSearchDistance;                                 // 0x0088(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C[0x24];                                      // 0x008C(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UTextureRenderTarget2D* GetBoxMappersExtentRenderTarget() const;
	class UTextureRenderTarget2D* GetBoxMappersOriginRenderTarget() const;
	class UTextureRenderTarget2D* GetSphereMappersRenderTarget() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrInteriorsMapperWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrInteriorsMapperWorldSubsystem")
	}
	static class UCrInteriorsMapperWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrInteriorsMapperWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_UCrInteriorsMapperWorldSubsystem;

}

