#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrAiMeleeRuntime

#include "Basic.hpp"

#include "Chimera_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CrAiMeleeRuntime_structs.hpp"
#include "MassAIPrototypeEnemyRuntime_structs.hpp"
#include "MassAIPrototypeEnemyRuntime_classes.hpp"
#include "MassSpawner_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class CrAiMeleeRuntime.CrAiActionModifyMeleeT3AnimData
// 0x0008 (0x0090 - 0x0088)
class UCrAiActionModifyMeleeT3AnimData final : public UCrAiAction
{
public:
	bool                                          bIsCoverActive;                                    // 0x0088(0x0001)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsUpCover;                                        // 0x0089(0x0001)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasAggroTarget;                                   // 0x008A(0x0001)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCrAiActionModifyMeleeT3AnimData* Create_CrAiActionModifyMeleeT3AnimData(TSubclassOf<class UCrAiActionModifyMeleeT3AnimData> ActionType, float NewMaxLifetimeS, bool NewHasAggroTarget, bool NewIsCoverActive, bool NewIsUpCover);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiActionModifyMeleeT3AnimData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiActionModifyMeleeT3AnimData")
	}
	static class UCrAiActionModifyMeleeT3AnimData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrAiActionModifyMeleeT3AnimData>();
	}
};
DUMPER7_ASSERTS_UCrAiActionModifyMeleeT3AnimData;

// Class CrAiMeleeRuntime.CrAiMeleeAnimationStateSyncComponent
// 0x0008 (0x00C0 - 0x00B8)
class UCrAiMeleeAnimationStateSyncComponent final : public UActorComponent
{
public:
	float                                         Dissolve;                                          // 0x00B8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiMeleeAnimationStateSyncComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiMeleeAnimationStateSyncComponent")
	}
	static class UCrAiMeleeAnimationStateSyncComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrAiMeleeAnimationStateSyncComponent>();
	}
};
DUMPER7_ASSERTS_UCrAiMeleeAnimationStateSyncComponent;

// Class CrAiMeleeRuntime.CrAiMeleeAnimUpdateProcessor
// 0x0000 (0x0420 - 0x0420)
class UCrAiMeleeAnimUpdateProcessor final : public UMassEnemyVertexAnimProcessor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiMeleeAnimUpdateProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiMeleeAnimUpdateProcessor")
	}
	static class UCrAiMeleeAnimUpdateProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrAiMeleeAnimUpdateProcessor>();
	}
};
DUMPER7_ASSERTS_UCrAiMeleeAnimUpdateProcessor;

// Class CrAiMeleeRuntime.CrMassMeleeBubbleReplicatedSerializerHolder
// 0x0348 (0x0600 - 0x02B8)
class ACrMassMeleeBubbleReplicatedSerializerHolder final : public ACrMassBubbleReplicatedSerializerHolder
{
public:
	struct FMeleeClientBubbleSerializer           Serializer;                                        // 0x02B8(0x0348)(Net, Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMassMeleeBubbleReplicatedSerializerHolder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMassMeleeBubbleReplicatedSerializerHolder")
	}
	static class ACrMassMeleeBubbleReplicatedSerializerHolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACrMassMeleeBubbleReplicatedSerializerHolder>();
	}
};
DUMPER7_ASSERTS_ACrMassMeleeBubbleReplicatedSerializerHolder;

// Class CrAiMeleeRuntime.MeleeClientBubbleInfo
// 0x0000 (0x0330 - 0x0330)
class AMeleeClientBubbleInfo final : public ACrMassClientBubbleInfo
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeleeClientBubbleInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeleeClientBubbleInfo")
	}
	static class AMeleeClientBubbleInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMeleeClientBubbleInfo>();
	}
};
DUMPER7_ASSERTS_AMeleeClientBubbleInfo;

// Class CrAiMeleeRuntime.CrAiMeleeDataAsset
// 0x0060 (0x0768 - 0x0708)
class UCrAiMeleeDataAsset final : public UMassEnemyDataAsset
{
public:
	struct FAiFloatConfigurationValue             AoeAttackRange;                                    // 0x0708(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FAiFloatConfigurationValue             TimeToRangedAttackS;                               // 0x0714(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FAiFloatConfigurationValue             MatchTargetSpeedRangeAttack;                       // 0x0720(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FAiFloatConfigurationValue             MatchTargetSpeedRange;                             // 0x072C(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FAiFloatConfigurationValue             MatchTargetSpeedModifier;                          // 0x0738(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FAiFloatConfigurationValue             MatchTargetSpeedModifierAttack;                    // 0x0744(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FAiFloatConfigurationValue             WalkBackRange;                                     // 0x0750(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FAiFloatConfigurationValue             JumpAttackRange;                                   // 0x075C(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiMeleeDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiMeleeDataAsset")
	}
	static class UCrAiMeleeDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrAiMeleeDataAsset>();
	}
};
DUMPER7_ASSERTS_UCrAiMeleeDataAsset;

// Class CrAiMeleeRuntime.CrAiMeleeMassStateTranslator
// 0x0350 (0x0430 - 0x00E0)
class UCrAiMeleeMassStateTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_E0[0x350];                                     // 0x00E0(0x0350)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiMeleeMassStateTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiMeleeMassStateTranslator")
	}
	static class UCrAiMeleeMassStateTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrAiMeleeMassStateTranslator>();
	}
};
DUMPER7_ASSERTS_UCrAiMeleeMassStateTranslator;

// Class CrAiMeleeRuntime.MeleeReplicator
// 0x0000 (0x0028 - 0x0028)
class UMeleeReplicator final : public UCrMassReplicatorBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeleeReplicator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeleeReplicator")
	}
	static class UMeleeReplicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeleeReplicator>();
	}
};
DUMPER7_ASSERTS_UMeleeReplicator;

// Class CrAiMeleeRuntime.CrAiMeleeRepresentationActorManagement
// 0x0000 (0x0028 - 0x0028)
class UCrAiMeleeRepresentationActorManagement final : public UMassEnemyRepresentationActorManagement
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiMeleeRepresentationActorManagement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiMeleeRepresentationActorManagement")
	}
	static class UCrAiMeleeRepresentationActorManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrAiMeleeRepresentationActorManagement>();
	}
};
DUMPER7_ASSERTS_UCrAiMeleeRepresentationActorManagement;

// Class CrAiMeleeRuntime.CrAiMeleeT3
// 0x0000 (0x0000 - 0x0000)
class ICrAiMeleeT3 final
{
public:
	void CacheLongAoePoints(const TArray<struct FVector>& Points);
	TArray<struct FVector> GetCachedLongAoePoints();
	void SetHasAggroTarget(bool bNewHasAggroTarget);
	void SetIsCoverActive(bool bNewIsCoverActive);
	void SetIsUpCover(bool bNewIsUpCover);
	void ShowLongAoeAttackEffect();
	void UpdateAnimState();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiMeleeT3")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiMeleeT3")
	}
	static class ICrAiMeleeT3* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICrAiMeleeT3>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICrAiMeleeT3;

// Class CrAiMeleeRuntime.MassEnemyMeleeTier0Trait
// 0x0000 (0x0028 - 0x0028)
class UMassEnemyMeleeTier0Trait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEnemyMeleeTier0Trait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEnemyMeleeTier0Trait")
	}
	static class UMassEnemyMeleeTier0Trait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnemyMeleeTier0Trait>();
	}
};
DUMPER7_ASSERTS_UMassEnemyMeleeTier0Trait;

// Class CrAiMeleeRuntime.MassEnemyMeleeTier1Trait
// 0x0000 (0x0028 - 0x0028)
class UMassEnemyMeleeTier1Trait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEnemyMeleeTier1Trait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEnemyMeleeTier1Trait")
	}
	static class UMassEnemyMeleeTier1Trait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnemyMeleeTier1Trait>();
	}
};
DUMPER7_ASSERTS_UMassEnemyMeleeTier1Trait;

// Class CrAiMeleeRuntime.MassEnemyMeleeTier3Trait
// 0x0000 (0x0028 - 0x0028)
class UMassEnemyMeleeTier3Trait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEnemyMeleeTier3Trait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEnemyMeleeTier3Trait")
	}
	static class UMassEnemyMeleeTier3Trait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnemyMeleeTier3Trait>();
	}
};
DUMPER7_ASSERTS_UMassEnemyMeleeTier3Trait;

// Class CrAiMeleeRuntime.CrArMeleeRepresentationSubsystem
// 0x0000 (0x0100 - 0x0100)
class UCrArMeleeRepresentationSubsystem final : public UMassEnemyRepresentationSubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrArMeleeRepresentationSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrArMeleeRepresentationSubsystem")
	}
	static class UCrArMeleeRepresentationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrArMeleeRepresentationSubsystem>();
	}
};
DUMPER7_ASSERTS_UCrArMeleeRepresentationSubsystem;

// Class CrAiMeleeRuntime.MeleeAnimationInstance
// 0x0000 (0x05A0 - 0x05A0)
class UMeleeAnimationInstance : public UMassEnemyAnimationInstance
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeleeAnimationInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeleeAnimationInstance")
	}
	static class UMeleeAnimationInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeleeAnimationInstance>();
	}
};
DUMPER7_ASSERTS_UMeleeAnimationInstance;

// Class CrAiMeleeRuntime.CrMeleeT3AvoidanceComponent
// 0x0080 (0x05B0 - 0x0530)
class UCrMeleeT3AvoidanceComponent final : public UPrimitiveComponent
{
public:
	float                                         AvoidanceRadius;                                   // 0x0530(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AvoidanceHalfHeight;                               // 0x0534(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AvoidanceWeight;                                   // 0x0538(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNavAvoidanceMask                      AvoidanceGroupMask;                                // 0x053C(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_540[0x60];                                     // 0x0540(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrAvoidanceManager*                    AvoidanceManager;                                  // 0x05A0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_5A8[0x8];                                      // 0x05A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMeleeT3AvoidanceComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMeleeT3AvoidanceComponent")
	}
	static class UCrMeleeT3AvoidanceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMeleeT3AvoidanceComponent>();
	}
};
DUMPER7_ASSERTS_UCrMeleeT3AvoidanceComponent;

// Class CrAiMeleeRuntime.CrMeleeT3BatteringRamComponent
// 0x0010 (0x0570 - 0x0560)
class UCrMeleeT3BatteringRamComponent final : public UCapsuleComponent
{
public:
	float                                         MinVelocityToAddPush;                              // 0x0558(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ActorPushSideVelocity;                             // 0x055C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ActorPushUpVelocity;                               // 0x0560(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MassPushSideVelocity;                              // 0x0564(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MassPushUpVelocity;                                // 0x0568(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMeleeT3BatteringRamComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMeleeT3BatteringRamComponent")
	}
	static class UCrMeleeT3BatteringRamComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMeleeT3BatteringRamComponent>();
	}
};
DUMPER7_ASSERTS_UCrMeleeT3BatteringRamComponent;

// Class CrAiMeleeRuntime.CrMeleeT3MoveTargetActor
// 0x0038 (0x02E0 - 0x02A8)
class ACrMeleeT3MoveTargetActor final : public AActor
{
public:
	class USphereComponent*                       SphereComponent;                                   // 0x02A8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class AMassEnemyCharacterBase*                MeleeT3CharacterOwner;                             // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_2B8[0x18];                                     // 0x02B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UNavigationSystemV1*                    NavigationSystem;                                  // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LockOnTargetForDuration(float Duration);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMeleeT3MoveTargetActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMeleeT3MoveTargetActor")
	}
	static class ACrMeleeT3MoveTargetActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACrMeleeT3MoveTargetActor>();
	}
};
DUMPER7_ASSERTS_ACrMeleeT3MoveTargetActor;

}

