#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrAiExploderRuntime

#include "Basic.hpp"

#include "MassAIPrototypeEnemyRuntime_structs.hpp"
#include "AuActorPlacement_structs.hpp"
#include "Chimera_structs.hpp"
#include "MassReplication_structs.hpp"
#include "MassAIBehavior_structs.hpp"
#include "MassEntity_structs.hpp"


namespace SDK
{

// ScriptStruct CrAiExploderRuntime.CrAnimState_ExploderTaunt
// 0x0000 (0x0068 - 0x0068)
struct FCrAnimState_ExploderTaunt final : public FCrAnimState_Taunt
{
};
DUMPER7_ASSERTS_FCrAnimState_ExploderTaunt;

// ScriptStruct CrAiExploderRuntime.CrReplicatedExploderInfection
// 0x0048 (0x0070 - 0x0028)
struct FCrReplicatedExploderInfection final : public FReplicatedAgentBase
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FReplicatedAgentPositionRotationData   PositionRotation;                                  // 0x0030(0x0040)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCrReplicatedExploderInfection;

// ScriptStruct CrAiExploderRuntime.CrExploderInfectionFastArrayItem
// 0x0070 (0x0080 - 0x0010)
struct FCrExploderInfectionFastArrayItem final : public FMassFastArrayItemBase
{
public:
	struct FCrReplicatedExploderInfection         Agent;                                             // 0x0010(0x0070)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrExploderInfectionFastArrayItem;

// ScriptStruct CrAiExploderRuntime.CrMassExploderInfectionClientBubbleSerializer
// 0x0120 (0x0258 - 0x0138)
struct FCrMassExploderInfectionClientBubbleSerializer final : public FMassClientBubbleSerializerBase
{
public:
	uint8                                         Pad_138[0x110];                                    // 0x0138(0x0110)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCrExploderInfectionFastArrayItem> Infection;                                      // 0x0248(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FCrMassExploderInfectionClientBubbleSerializer;

// ScriptStruct CrAiExploderRuntime.ReplicatedExploderVertexAnimationData
// 0x0008 (0x0008 - 0x0000)
struct FReplicatedExploderVertexAnimationData final
{
public:
	bool                                          bIsActivated;                                      // 0x0000(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsExploded;                                       // 0x0001(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         CurrentAimStateID;                                 // 0x0002(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EnterStateTimestamp;                               // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FReplicatedExploderVertexAnimationData;

// ScriptStruct CrAiExploderRuntime.ReplicatedExploderAgent
// 0x0090 (0x00B8 - 0x0028)
struct FReplicatedExploderAgent final : public FReplicatedAgentBase
{
public:
	struct FCrMassEnemyReplicatedAgentPositionYawData PositionYaw;                                   // 0x0028(0x0020)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	struct FReplicatedExploderVertexAnimationData VertexAnimationData;                               // 0x0048(0x0008)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	struct FMassEnemyCommonReplicationData        CommonReplicationData;                             // 0x0050(0x0050)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	struct FMassEnemyFrequentlyReplicatedData     FrequentlyReplicatedData;                          // 0x00A0(0x0018)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FReplicatedExploderAgent;

// ScriptStruct CrAiExploderRuntime.ExploderFastArrayItem
// 0x00B8 (0x00C8 - 0x0010)
struct FExploderFastArrayItem final : public FMassFastArrayItemBase
{
public:
	struct FReplicatedExploderAgent               Agent;                                             // 0x0010(0x00B8)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FExploderFastArrayItem;

// ScriptStruct CrAiExploderRuntime.ExploderClientBubbleSerializer
// 0x01F8 (0x0330 - 0x0138)
struct FExploderClientBubbleSerializer final : public FMassClientBubbleSerializerBase
{
public:
	uint8                                         Pad_138[0x1E8];                                    // 0x0138(0x01E8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FExploderFastArrayItem>         Ais;                                               // 0x0320(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FExploderClientBubbleSerializer;

// ScriptStruct CrAiExploderRuntime.ExploderStateEvaluatorInstanceData
// 0x0004 (0x0004 - 0x0000)
struct FExploderStateEvaluatorInstanceData final
{
public:
	float                                         AttackAngle;                                       // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FExploderStateEvaluatorInstanceData;

// ScriptStruct CrAiExploderRuntime.ExploderStateEvaluator
// 0x0008 (0x0028 - 0x0020)
struct FExploderStateEvaluator final : public FMassStateTreeEvaluatorBase
{
public:
	float                                         AttackAngle;                                       // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FExploderStateEvaluator;

// ScriptStruct CrAiExploderRuntime.ExploderFollowTargetTask
// 0x0000 (0x0088 - 0x0088)
struct FExploderFollowTargetTask final : public FMassEnemyFollowTargetTask
{
};
DUMPER7_ASSERTS_FExploderFollowTargetTask;

// ScriptStruct CrAiExploderRuntime.ExploderTier1Tag
// 0x0000 (0x0001 - 0x0001)
struct FExploderTier1Tag final : public FMassTag
{
};
DUMPER7_ASSERTS_FExploderTier1Tag;

// ScriptStruct CrAiExploderRuntime.ExploderTier1LodGroupTag
// 0x0000 (0x0001 - 0x0001)
struct FExploderTier1LodGroupTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FExploderTier1LodGroupTag;

// ScriptStruct CrAiExploderRuntime.ExploderTier2LodGroupTag
// 0x0000 (0x0001 - 0x0001)
struct FExploderTier2LodGroupTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FExploderTier2LodGroupTag;

// ScriptStruct CrAiExploderRuntime.ExploderTier3LodGroupTag
// 0x0000 (0x0001 - 0x0001)
struct FExploderTier3LodGroupTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FExploderTier3LodGroupTag;

// ScriptStruct CrAiExploderRuntime.ExploderUpdateAttackTag
// 0x0000 (0x0001 - 0x0001)
struct FExploderUpdateAttackTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FExploderUpdateAttackTag;

// ScriptStruct CrAiExploderRuntime.ExploderSpawnExplosionSphereTag
// 0x0000 (0x0001 - 0x0001)
struct FExploderSpawnExplosionSphereTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FExploderSpawnExplosionSphereTag;

// ScriptStruct CrAiExploderRuntime.ExploderStateDataFragment
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FExploderStateDataFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FExploderStateDataFragment;

// ScriptStruct CrAiExploderRuntime.ExploderSpecificConfigurationFragment
// 0x0088 (0x0088 - 0x0000)
struct FExploderSpecificConfigurationFragment final : public FMassConstSharedFragment
{
public:
	float                                         DistanceToActivate;                                // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActivationTimeS;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceToExplode;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionTimeS;                                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDistance;                                       // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuAPMassSpawnedEntityType             BigExplosionSphereEntity;                          // 0x0018(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FAuAPMassSpawnedEntityType             SmallExplosionSphereEntity;                        // 0x0050(0x0038)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FExploderSpecificConfigurationFragment;

// ScriptStruct CrAiExploderRuntime.ExploderInfectionSphereConfigurationFragment
// 0x0028 (0x0028 - 0x0000)
struct FExploderInfectionSphereConfigurationFragment final : public FMassConstSharedFragment
{
public:
	float                                         ExplosionEffectsForBuildingRadius;                 // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionEffectsRadius;                            // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            ExplosionInstantInfectionEffect;                   // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            ExplosionPlayerDamageEffect;                       // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            ExplosionAiDamageEffect;                           // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionBuildingInfectionDamage;                  // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FExploderInfectionSphereConfigurationFragment;

// ScriptStruct CrAiExploderRuntime.CrMassInfectionCloudNiagaraParameterDriver
// 0x0008 (0x0010 - 0x0008)
struct FCrMassInfectionCloudNiagaraParameterDriver final : public FCrMassBuildingNiagaraParameterDriverBase
{
public:
	float                                         Duration;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrMassInfectionCloudNiagaraParameterDriver;

}

