#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_GenericAutoFire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AuAbilities_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_GenericAutoFire.GA_GenericAutoFire_C
// 0x0070 (0x0578 - 0x0508)
class UGA_GenericAutoFire_C final : public UCrGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAuCustomTraceDataHandle               LineTraceData;                                     // 0x0510(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAuAT_WaitWeaponAutoFire*               AutoFireTaskHandle;                                // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAuTraceDebugParams                    TraceDebugParams;                                  // 0x0530(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bDrawDebug;                                        // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDrawServerDebug;                                  // 0x0539(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53A[0x6];                                      // 0x053A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  PlayerCharRef;                                     // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      WaitADSTagAddTask;                                 // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagRemoved*    WaitADSTagRemoveTask;                              // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCrWeaponItemDataBase*                  EquippedWeaponItem;                                // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAuCustomTargetHandle                  CurrentlyUsedTraceConfig;                          // 0x0560(0x0001)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int64>                                 FramesFireExecuted;                                // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Added_B8B45F6C4CA31C50D845FB90C5AC5AE9();
	void CheckDPSEvaluatorHit(const struct FHitResult& Hit);
	void ExecuteUbergraph_GA_GenericAutoFire(int32 EntryPoint);
	void GetFireAnimPlayRate(double* Playrate);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnCancelled_2B08750A4150850AB7B11B8BC1544130(class FName NotifyName);
	void OnCancelled_E9EAAC22423DBF451A3A0D8990CF93C5(class FName NotifyName);
	void OnClientTraceResult(const struct FAuTargetData& OutHits, const TArray<struct FHitResult>& RawHits, bool bServerConfirmed);
	void OnCostCheckFailed_0E6849794CE62F5F48580D82ABC44E88(float TimeHeld, bool bEnded);
	void OnEnded_0E6849794CE62F5F48580D82ABC44E88(float TimeHeld, bool bEnded);
	void OnFinish_260A803D428ABB89BF3610807185470B();
	void OnFinish_4444F23E3142CD91C036588398CC8AA1();
	void OnFppMontageBlendOut_2B08750A4150850AB7B11B8BC1544130(class FName NotifyName);
	void OnFppMontageBlendOut_E9EAAC22423DBF451A3A0D8990CF93C5(class FName NotifyName);
	void OnFppMontageEnded_2B08750A4150850AB7B11B8BC1544130(class FName NotifyName);
	void OnFppMontageEnded_E9EAAC22423DBF451A3A0D8990CF93C5(class FName NotifyName);
	void OnFppMontageNotifyBegin_2B08750A4150850AB7B11B8BC1544130(class FName NotifyName);
	void OnFppMontageNotifyBegin_E9EAAC22423DBF451A3A0D8990CF93C5(class FName NotifyName);
	void OnFppMontageNotifyEnd_2B08750A4150850AB7B11B8BC1544130(class FName NotifyName);
	void OnFppMontageNotifyEnd_E9EAAC22423DBF451A3A0D8990CF93C5(class FName NotifyName);
	void OnInterrupted_2B08750A4150850AB7B11B8BC1544130(class FName NotifyName);
	void OnInterrupted_E9EAAC22423DBF451A3A0D8990CF93C5(class FName NotifyName);
	void OnNotLocallyControlledTppMontageBlendOut_2B08750A4150850AB7B11B8BC1544130(class FName NotifyName);
	void OnNotLocallyControlledTppMontageBlendOut_E9EAAC22423DBF451A3A0D8990CF93C5(class FName NotifyName);
	void OnRelease_0E6849794CE62F5F48580D82ABC44E88(float TimeHeld, bool bEnded);
	void OnServerTraceResult(const struct FAuTargetData& OutHits, const TArray<struct FHitResult>& RawHits, bool bServerConfirmed);
	void OnTick_0E6849794CE62F5F48580D82ABC44E88(float TimeHeld, bool bEnded);
	void Removed_BA9B6F24428A5AA9C8C82D82CBB42554();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_GenericAutoFire_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_GenericAutoFire_C")
	}
	static class UGA_GenericAutoFire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_GenericAutoFire_C>();
	}
};
DUMPER7_ASSERTS_UGA_GenericAutoFire_C;

}

