#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GE_CamEffect_Snot_Heat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GE_CamEffect_Snot_Heat.GE_CamEffect_Snot_Heat_C
// 0x0020 (0x0AC8 - 0x0AA8)
class UGE_CamEffect_Snot_Heat_C final : public UCrCameraGameplayEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          HeatIncreased;                                     // 0x0AB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HeatDecreased;                                     // 0x0AB1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB2[0x6];                                      // 0x0AB2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        LoopSound_AC;                                      // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACrCharacterPlayerBase*                 CrChP;                                             // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GE_CamEffect_Snot_Heat(int32 EntryPoint);
	void OnAttributeChanged_005920A8448198C38A0C39B27109AE82(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);
	void OnInitialized(class UAbilitySystemComponent* AbilitySystemComponent, TSubclassOf<class UGameplayEffect> GameplayEffect, class USceneComponent* OwnerRootComponent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GE_CamEffect_Snot_Heat_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GE_CamEffect_Snot_Heat_C")
	}
	static class UGE_CamEffect_Snot_Heat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGE_CamEffect_Snot_Heat_C>();
	}
};
DUMPER7_ASSERTS_UGE_CamEffect_Snot_Heat_C;

}

