#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveLinkHubMessaging

#include "Basic.hpp"

#include "LiveLinkInterface_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LiveLink_structs.hpp"
#include "LiveLinkMessageBusFramework_structs.hpp"


namespace SDK
{

// Enum LiveLinkHubMessaging.ELiveLinkHubAutoConnectMode
// NumValues: 0x0004
enum class ELiveLinkHubAutoConnectMode : uint8
{
	Disabled                                 = 0,
	All                                      = 1,
	LocalOnly                                = 2,
	ELiveLinkHubAutoConnectMode_MAX          = 3,
};

// Enum LiveLinkHubMessaging.ELiveLinkHubTimecodeSource
// NumValues: 0x0004
enum class ELiveLinkHubTimecodeSource : uint32
{
	NotDefined                               = 0,
	SystemTimeEditor                         = 1,
	UseSubjectName                           = 2,
	ELiveLinkHubTimecodeSource_MAX           = 3,
};

// Enum LiveLinkHubMessaging.ELiveLinkClientStatus
// NumValues: 0x0004
enum class ELiveLinkClientStatus : uint32
{
	Connected                                = 0,
	Disconnected                             = 1,
	Recording                                = 2,
	ELiveLinkClientStatus_MAX                = 3,
};

// ScriptStruct LiveLinkHubMessaging.LiveLinkHubCustomTimeStepSettings
// 0x0018 (0x0018 - 0x0000)
struct FLiveLinkHubCustomTimeStepSettings final
{
public:
	bool                                          bResetCustomTimeStep;                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLockStepMode;                                     // 0x0001(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        FrameRateDivider;                                  // 0x0004(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLiveLinkSubjectName                   SubjectName;                                       // 0x0008(0x0008)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             CustomTimeStepRate;                                // 0x0010(0x0008)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLiveLinkHubCustomTimeStepSettings;

// ScriptStruct LiveLinkHubMessaging.LiveLinkHubTimecodeSettings
// 0x0020 (0x0020 - 0x0000)
struct FLiveLinkHubTimecodeSettings final
{
public:
	ELiveLinkHubTimecodeSource                    Source;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLiveLinkSubjectName                   SubjectName;                                       // 0x0004(0x0008)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             DesiredFrameRate;                                  // 0x000C(0x0008)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrameDelay;                                        // 0x0014(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BufferSize;                                        // 0x0018(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELiveLinkTimecodeProviderEvaluationType       EvaluationType;                                    // 0x001C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLiveLinkHubTimecodeSettings;

// ScriptStruct LiveLinkHubMessaging.LiveLinkClientInfoMessage
// 0x0060 (0x0060 - 0x0000)
struct FLiveLinkClientInfoMessage final
{
public:
	class FString                                 LongName;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELiveLinkClientStatus                         Status;                                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 HostName;                                          // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProjectName;                                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentLevel;                                      // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LiveLinkInstanceName;                              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELiveLinkTopologyMode                         TopologyMode;                                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LiveLinkVersion;                                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLiveLinkClientInfoMessage;

// ScriptStruct LiveLinkHubMessaging.LiveLinkHubConnectMessage
// 0x0060 (0x0060 - 0x0000)
struct FLiveLinkHubConnectMessage final
{
public:
	struct FLiveLinkClientInfoMessage             ClientInfo;                                        // 0x0000(0x0060)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLiveLinkHubConnectMessage;

// ScriptStruct LiveLinkHubMessaging.LiveLinkHubDisconnectMessage
// 0x0020 (0x0020 - 0x0000)
struct FLiveLinkHubDisconnectMessage final
{
public:
	class FString                                 ProviderName;                                      // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MachineName;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLiveLinkHubDisconnectMessage;

// ScriptStruct LiveLinkHubMessaging.LiveLinkHubDiscoveryMessage
// 0x0048 (0x0048 - 0x0000)
struct FLiveLinkHubDiscoveryMessage final
{
public:
	class FString                                 ProviderName;                                      // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELiveLinkTopologyMode                         Mode;                                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MachineName;                                       // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InstanceId;                                        // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CreationTime;                                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LiveLinkVersion;                                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLiveLinkHubDiscoveryMessage;

}

