#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_MainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Map_MainMenu.Map_MainMenu_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Map_MainMenu_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Map_MainMenu_C_ReceiveEndPlay;

// Function Map_MainMenu.Map_MainMenu_C.ExecuteUbergraph_Map_MainMenu
// 0x0030 (0x0030 - 0x0000)
struct Map_MainMenu_C_ExecuteUbergraph_Map_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
};
DUMPER7_ASSERTS_Map_MainMenu_C_ExecuteUbergraph_Map_MainMenu;

}

