#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_DPS_Evaluation_Comp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Player_DPS_Evaluation_Comp.Player_DPS_Evaluation_Comp_C
// 0x0028 (0x00E0 - 0x00B8)
class UPlayer_DPS_Evaluation_Comp_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        DamageAccumulated;                                 // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AllShots;                                          // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ValidShots;                                        // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimePassed;                                        // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Player_DPS_Evaluation_Comp(int32 EntryPoint);
	void OnFired(bool Valid_Hit, double Damage);
	void ReceiveTick(float DeltaSeconds);
	void ResetTimer();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Player_DPS_Evaluation_Comp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Player_DPS_Evaluation_Comp_C")
	}
	static class UPlayer_DPS_Evaluation_Comp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_DPS_Evaluation_Comp_C>();
	}
};
DUMPER7_ASSERTS_UPlayer_DPS_Evaluation_Comp_C;

}

