#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RigVM_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_0
// 0x0000 (0x0000 - 0x0000)
struct FPropertyBag_0 final
{
};
DUMPER7_ASSERTS_FPropertyBag_0;

// PropertyBag Transient.PropertyBag_cabadb914aa8333d
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBag_cabadb914aa8333d final
{
public:
	TArray<class UClass*>                         Actors;                                            // 0x0000(0x0010)(Edit)
};
DUMPER7_ASSERTS_FPropertyBag_cabadb914aa8333d;

// PropertyBag Transient.PropertyBag_806ebca74f343b9c
// 0x0540 (0x0540 - 0x0000)
struct FPropertyBag_806ebca74f343b9c final
{
public:
	struct FRigElementKey                         RigVMModel___Set_Transform_Item__Const;            // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_Space__Const;           // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_bInitial__Const;        // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_2_Item__Const;           // 0x0010(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_Weight__Const;          // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Transform_bPropagateToChildren__Const; // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Transform_1_Item__Const;          // 0x0024(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_Item__Const;         // 0x0030(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_2_Item__Const;          // 0x003C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_2_Item__Const;         // 0x0048(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_1_1_Item__Const;        // 0x0054(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_2_1_1_Item__Const;       // 0x0060(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___ParentConstraint_Child__Const;        // 0x006C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FTransformFilter                       RigVMModel___ParentConstraint_Filter__Const;       // 0x0078(0x0009)(Edit, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConstraintParent>              RigVMModel___ParentConstraint_Parents__Const;      // 0x0088(0x0010)(Edit)
	struct FRigUnit_ParentConstraint_AdvancedSettings RigVMModel___ParentConstraint_AdvancedSettings__Const; // 0x0098(0x0002)(Edit, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___ParentConstraint_1_Child__Const;      // 0x009C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConstraintParent>              RigVMModel___ParentConstraint_1_Parents__Const;    // 0x00A8(0x0010)(Edit)
	struct FRigElementKey                         RigVMModel___DrawSlope_Item__Const;                // 0x00B8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RigVMModel___DrawSlope_Color__Const;               // 0x00C4(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___DrawSlope_Rectangle_Size__Const;      // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___DrawSlope_Rectangle_Thickness__Const; // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___DrawSlope_Axis__Const;                // 0x00E8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___DrawSlope_Hit_Radius__Const;          // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___DrawSlope_Sphere_Radius__Const;       // 0x0108(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        LocalVariableDefault__DrawSlope_hitPoints__Const;  // 0x0110(0x0010)(Edit)
	bool                                          LocalVariableDefault__DrawSlope_isSloping__Const;  // 0x0120(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalVariableDefault__DrawSlope_slopeAngle__Const; // 0x0128(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalVariableDefault__DrawSlope_HitNormal__Const;  // 0x0140(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DrawSlope___DrawSlope_Scale_1_Factor__Const;       // 0x0158(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      DrawSlope___DrawSlope_SphereTraceByObjectTypes_ObjectTypes__Const; // 0x0160(0x0010)(Edit)
	struct FRigUnit_AimBone_DebugSettings         DrawSlope___DrawSlope_AimBoneMath_DebugSettings__Const; // 0x0170(0x0070)(Edit, NoDestructor)
	EEulerRotationOrder                           DrawSlope___DrawSlope_RigVMFunction_MathQuaternionToEuler_RotationOrder__Const; // 0x01E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawSlope___DrawSlope_IsNearlyZero_Tolerance__Const; // 0x01E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMDebugDrawSettings                DrawSlope___DrawSlope_RigVMFunction_DebugRectangleNoSpace_DebugDrawSettings__Const; // 0x01E8(0x0008)(Edit, NoDestructor)
	struct FTransform                             DrawSlope___DrawSlope_RigVMFunction_DebugRectangleNoSpace_WorldOffset__Const; // 0x01F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DrawSlope___DrawSlope_RigVMFunction_DebugLineNoSpace_Color__Const; // 0x0250(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DrawSlope___DrawSlope_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x0260(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitDebugTransformMode                    DrawSlope___DrawSlope_RigVMFunction_DebugTransformMutableNoSpace_Mode__Const; // 0x0264(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawSlope___DrawSlope_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x0268(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___ProcessFootTrace_SphereRadius__Const; // 0x0270(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProcessFootTrace___ProcessFootTrace_Add_B__Const;  // 0x0278(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ProcessFootTrace___ProcessFootTrace_If_True__Const; // 0x0290(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ProcessFootTrace___ProcessFootTrace_If_False__Const; // 0x02A0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProcessFootTrace___ProcessFootTrace_RigVMFunction_DebugLineNoSpace_Thickness__Const; // 0x02B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProcessFootTrace___ProcessFootTrace_RigVMFunction_DebugTransformMutableNoSpace_Scale__Const; // 0x02B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProcessFootTrace___ProcessFootTrace_SpringInterp_Strength__Const; // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProcessFootTrace___ProcessFootTrace_Scale_Factor__Const; // 0x02BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_Strength__Const;         // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_Force__Const;            // 0x02C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_TargetVelocityAmount__Const; // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Transform_3_Item__Const;          // 0x02CC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___Set_Transform_3_Space__Const;         // 0x02D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___If_1_1_True__Const;                   // 0x02DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_1_Scale__Const;           // 0x02E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputRange                            RigVMModel___AlphaInterp_1_InRange__Const;         // 0x02E4(0x0008)(Edit, NoDestructor)
	float                                         RigVMModel___AlphaInterp_1_InterpSpeedIncreasing__Const; // 0x02EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatRemap_SourceMaximum__Const;  // 0x02F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatRemap_TargetMaximum__Const;  // 0x02F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Multiply_B__Const;                    // 0x02F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___Set_Transform_3_Weight__Const;        // 0x0300(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___OffsetTransformForItem_Item__Const;   // 0x0304(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___OffsetTransformForItem_1_Item__Const; // 0x0310(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	bool                                          ProcessFootOffset_0___ProcessFootOffset_SpringInterp_bUseCurrentInput__Const; // 0x031C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                ProcessFootOffset_0___ProcessFootOffset_AimBoneMath_Secondary__Const; // 0x0320(0x0048)(Edit, NoDestructor)
	struct FRigVMDebugDrawSettings                RigVMModel___DebugTransformMutableItemSpace_2_DebugDrawSettings__Const; // 0x0368(0x0008)(Edit, NoDestructor)
	ERigUnitDebugTransformMode                    RigVMModel___DebugTransformMutableItemSpace_2_Mode__Const; // 0x0370(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           RigVMModel___DebugTransformMutableItemSpace_2_Color__Const; // 0x0374(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___DebugTransformMutableItemSpace_2_Scale__Const; // 0x0384(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___DebugTransformMutableItemSpace_2_WorldOffset__Const; // 0x0390(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_ItemA__Const;  // 0x03F0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_ItemB__Const;  // 0x03FC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TwoBoneIKSimplePerItem_PrimaryAxis__Const; // 0x0408(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TwoBoneIKSimplePerItem_SecondaryAxis__Const; // 0x0420(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EControlRigVectorKind                         RigVMModel___TwoBoneIKSimplePerItem_PoleVectorKind__Const; // 0x0438(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_PoleVectorSpace__Const; // 0x043C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___TwoBoneIKSimplePerItem_StretchMaximumRatio__Const; // 0x0448(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_TwoBoneIKSimple_DebugSettings RigVMModel___TwoBoneIKSimplePerItem_DebugSettings__Const; // 0x0450(0x0070)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_1_ItemA__Const; // 0x04C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_1_ItemB__Const; // 0x04CC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TwoBoneIKSimplePerItem_1_PrimaryAxis__Const; // 0x04D8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TwoBoneIKSimplePerItem_1_SecondaryAxis__Const; // 0x04F0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___VariableNode_Value__Const;            // 0x0508(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetControlOffset_Control__Const;      // 0x0520(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetControlOffset_1_Control__Const;    // 0x0528(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___SetControlOffset_2_Control__Const;    // 0x0530(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_806ebca74f343b9c;

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChaosDestructionEvent_SWC;

// PropertyBag Transient.PropertyBag_801cfb727f7c8279
// 0x27A0 (0x27A0 - 0x0000)
struct FPropertyBag_801cfb727f7c8279 final
{
public:
	struct FTransform                             RigVMModel___GetTransform_2_Transform;             // 0x0000(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_CachedIndex;           // 0x0060(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_CachedIndex;            // 0x0070(0x0010)(Edit)
	struct FTransform                             RigVMModel___GetTransform_2_1_Transform;           // 0x0080(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_CachedIndex;         // 0x00E0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_CachedIndex;          // 0x00F0(0x0010)(Edit)
	struct FTransform                             RigVMModel___GetTransform_2_2_Transform;           // 0x0100(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_2_CachedIndex;         // 0x0160(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_2_CachedIndex;          // 0x0170(0x0010)(Edit)
	struct FTransform                             RigVMModel___GetTransform_2_1_1_Transform;         // 0x0180(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_2_1_1_CachedIndex;       // 0x01E0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_1_1_CachedIndex;        // 0x01F0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___ParentConstraint_ChildCache;          // 0x0200(0x0010)(Edit)
	TArray<TArray<struct FCachedRigElement>>      RigVMModel___ParentConstraint_ParentCaches;        // 0x0210(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___ParentConstraint_1_ChildCache;        // 0x0220(0x0010)(Edit)
	TArray<TArray<struct FCachedRigElement>>      RigVMModel___ParentConstraint_1_ParentCaches;      // 0x0230(0x0010)(Edit)
	bool                                          RigVMModel___DrawSlope_Is_Sloping;                 // 0x0240(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___DrawSlope_Slope_Angle;                // 0x0248(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope___DrawSlope_RigVMFunction_MathQuaternionToEuler_Result; // 0x0260(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       DrawSlopete_3376918846;                            // 0x0278(0x0050)(Edit)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DrawSlope___DrawSlope_AimBoneMath_Result;          // 0x02D0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       DrawSlopete_1556345758;                            // 0x0330(0x0050)(Edit)
	struct FVector                                DrawSlope___DrawSlope_SphereTraceByObjectTypes_HitLocation; // 0x0380(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope___DrawSlope_Add_Result;                  // 0x0398(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             DrawSlope___DrawSlope_GetTransform_Transform;      // 0x03B0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              DrawSlope___DrawSlope_GetTransform_CachedIndex;    // 0x0410(0x0010)(Edit)
	struct FVector                                DrawSlope___DrawSlope_Add_A;                       // 0x0420(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope___DrawSlope_Scale_Result;                // 0x0438(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DrawSlope___DrawSlope_Scale_Factor;                // 0x0450(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DrawSlope___DrawSlope_Add_1_Result;                // 0x0458(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope___DrawSlope_Scale_1_Result;              // 0x0470(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DrawSlope___DrawSlope_SphereTraceByObjectTypes_Radius; // 0x0488(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawSlope___DrawSlope_SphereTraceByObjectTypes_bHit; // 0x048C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48D[0x3];                                      // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DrawSlope___DrawSlope_SphereTraceByObjectTypes_HitNormal; // 0x0490(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  DrawSlope___DrawSlope_SphereTraceByObjectTypes_WorkData; // 0x04A8(0x0010)(Edit)
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DrawSlope___DrawSlope_AimBoneMath_InputTransform__IO; // 0x04C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope___DrawSlope_SphereTraceByObjectTypes_1_HitLocation; // 0x0520(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope___DrawSlope_Add_2_Result;                // 0x0538(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             DrawSlope___DrawSlope_GetTransform_1_Transform;    // 0x0550(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              DrawSlope___DrawSlope_GetTransform_1_CachedIndex;  // 0x05B0(0x0010)(Edit)
	struct FVector                                DrawSlope___DrawSlope_Add_2_A;                     // 0x05C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope___DrawSlope_Add_3_Result;                // 0x05D8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DrawSlope___DrawSlope_SphereTraceByObjectTypes_1_Radius; // 0x05F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawSlope___DrawSlope_SphereTraceByObjectTypes_1_bHit; // 0x05F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F5[0x3];                                      // 0x05F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DrawSlope___DrawSlope_SphereTraceByObjectTypes_1_HitNormal; // 0x05F8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  DrawSlope___DrawSlope_SphereTraceByObjectTypes_1_WorkData; // 0x0610(0x0010)(Edit)
	struct FRigUnit_AimItem_Target                DrawSlope___DrawSlope_AimBoneMath_Primary__IO;     // 0x0620(0x0048)(Edit, NoDestructor)
	struct FRigUnit_AimItem_Target                DrawSlope___DrawSlope_AimBoneMath_Secondary__IO;   // 0x0668(0x0048)(Edit, NoDestructor)
	TArray<struct FCachedRigElement>              DrawSlope___DrawSlope_AimBoneMath_PrimaryCachedSpace; // 0x06B0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              DrawSlope___DrawSlope_AimBoneMath_SecondaryCachedSpace; // 0x06C0(0x0010)(Edit)
	TArray<bool>                                  DrawSlope___DrawSlope_AimBoneMath_bIsInitialized;  // 0x06D0(0x0010)(Edit)
	struct FQuat                                  DrawSlope___DrawSlope_RigVMFunction_MathQuaternionToEuler_Value; // 0x06E0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawSlope___DrawSlope_RigVMFunction_MathBoolNot_Result; // 0x0700(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawSlope___DrawSlope_IsNearlyZero_Result;         // 0x0701(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_702[0x2];                                      // 0x0702(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawSlope___DrawSlope_RigVMFunction_DebugRectangleNoSpace_Scale; // 0x0704(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DrawSlope___DrawSlope_RigVMFunction_DebugRectangleNoSpace_Thickness; // 0x0708(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70C[0x4];                                      // 0x070C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DrawSlope___DrawSlope_RigVMFunction_DebugTransformMutableNoSpace_1_Transform__IO; // 0x0710(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DrawSlope___DrawSlope_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x0770(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DrawSlope___DrawSlope_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0778(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___Unit_Result;                          // 0x0780(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___DrawSlope_2_Is_Sloping;               // 0x0798(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_799[0x7];                                      // 0x0799(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___DrawSlope_2_Slope_Angle;              // 0x07A0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope_2___DrawSlope_RigVMFunction_MathQuaternionToEuler_Result; // 0x07B8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       DrawSlope_2te_3376918846;                          // 0x07D0(0x0050)(Edit)
	struct FTransform                             DrawSlope_2___DrawSlope_AimBoneMath_Result;        // 0x0820(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       DrawSlope_2te_1556345758;                          // 0x0880(0x0050)(Edit)
	struct FVector                                DrawSlope_2___DrawSlope_SphereTraceByObjectTypes_HitLocation; // 0x08D0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope_2___DrawSlope_Add_Result;                // 0x08E8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             DrawSlope_2___DrawSlope_GetTransform_Transform;    // 0x0900(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              DrawSlope_2___DrawSlope_GetTransform_CachedIndex;  // 0x0960(0x0010)(Edit)
	struct FVector                                DrawSlope_2___DrawSlope_Add_A;                     // 0x0970(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope_2___DrawSlope_Scale_Result;              // 0x0988(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DrawSlope_2___DrawSlope_Scale_Factor;              // 0x09A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A4[0x4];                                      // 0x09A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DrawSlope_2___DrawSlope_Add_1_Result;              // 0x09A8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope_2___DrawSlope_Scale_1_Result;            // 0x09C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DrawSlope_2___DrawSlope_SphereTraceByObjectTypes_Radius; // 0x09D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawSlope_2___DrawSlope_SphereTraceByObjectTypes_bHit; // 0x09DC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9DD[0x3];                                      // 0x09DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DrawSlope_2___DrawSlope_SphereTraceByObjectTypes_HitNormal; // 0x09E0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  DrawSlope_2___DrawSlope_SphereTraceByObjectTypes_WorkData; // 0x09F8(0x0010)(Edit)
	uint8                                         Pad_A08[0x8];                                      // 0x0A08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DrawSlope_2___DrawSlope_AimBoneMath_InputTransform__IO; // 0x0A10(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope_2___DrawSlope_SphereTraceByObjectTypes_1_HitLocation; // 0x0A70(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope_2___DrawSlope_Add_2_Result;              // 0x0A88(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             DrawSlope_2___DrawSlope_GetTransform_1_Transform;  // 0x0AA0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              DrawSlope_2___DrawSlope_GetTransform_1_CachedIndex; // 0x0B00(0x0010)(Edit)
	struct FVector                                DrawSlope_2___DrawSlope_Add_2_A;                   // 0x0B10(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrawSlope_2___DrawSlope_Add_3_Result;              // 0x0B28(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DrawSlope_2___DrawSlope_SphereTraceByObjectTypes_1_Radius; // 0x0B40(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawSlope_2___DrawSlope_SphereTraceByObjectTypes_1_bHit; // 0x0B44(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B45[0x3];                                      // 0x0B45(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DrawSlope_2___DrawSlope_SphereTraceByObjectTypes_1_HitNormal; // 0x0B48(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  DrawSlope_2___DrawSlope_SphereTraceByObjectTypes_1_WorkData; // 0x0B60(0x0010)(Edit)
	struct FRigUnit_AimItem_Target                DrawSlope_2___DrawSlope_AimBoneMath_Primary__IO;   // 0x0B70(0x0048)(Edit, NoDestructor)
	struct FRigUnit_AimItem_Target                DrawSlope_2___DrawSlope_AimBoneMath_Secondary__IO; // 0x0BB8(0x0048)(Edit, NoDestructor)
	TArray<struct FCachedRigElement>              DrawSlope_2___DrawSlope_AimBoneMath_PrimaryCachedSpace; // 0x0C00(0x0010)(Edit)
	TArray<struct FCachedRigElement>              DrawSlope_2___DrawSlope_AimBoneMath_SecondaryCachedSpace; // 0x0C10(0x0010)(Edit)
	TArray<bool>                                  DrawSlope_2___DrawSlope_AimBoneMath_bIsInitialized; // 0x0C20(0x0010)(Edit)
	struct FQuat                                  DrawSlope_2___DrawSlope_RigVMFunction_MathQuaternionToEuler_Value; // 0x0C30(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawSlope_2___DrawSlope_RigVMFunction_MathBoolNot_Result; // 0x0C50(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawSlope_2___DrawSlope_IsNearlyZero_Result;       // 0x0C51(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C52[0x2];                                      // 0x0C52(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawSlope_2___DrawSlope_RigVMFunction_DebugRectangleNoSpace_Scale; // 0x0C54(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DrawSlope_2___DrawSlope_RigVMFunction_DebugRectangleNoSpace_Thickness; // 0x0C58(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5C[0x4];                                      // 0x0C5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DrawSlope_2___DrawSlope_RigVMFunction_DebugTransformMutableNoSpace_1_Transform__IO; // 0x0C60(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DrawSlope_2___DrawSlope_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x0CC0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DrawSlope_2___DrawSlope_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0CC8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigVMFunction_MathBoolAnd_Result;     // 0x0CD0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD1[0x7];                                      // 0x0CD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___ProcessFootTrace_TargetOffsetZ;       // 0x0CD8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___ProcessFootTrace_NewHitNormal;        // 0x0CE0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___ProcessFootTrace_DidTraceHit;         // 0x0CF8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF9[0x7];                                      // 0x0CF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigVMInstructionSetExecuteState       ProcessFootTracete_2060103934;                     // 0x0D00(0x0050)(Edit)
	struct FVector                                ProcessFootTrace___ProcessFootTrace_Add_Result;    // 0x0D50(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D68[0x8];                                      // 0x0D68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ProcessFootTrace___ProcessFootTrace_GetTransform_Transform; // 0x0D70(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              ProcessFootTrace___ProcessFootTrace_GetTransform_CachedIndex; // 0x0DD0(0x0010)(Edit)
	struct FVector                                ProcessFootTrace___ProcessFootTrace_Add_A;         // 0x0DE0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProcessFootTrace___ProcessFootTrace_Subtract_Result; // 0x0DF8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ProcessFootTrace___ProcessFootTrace_If_Result;     // 0x0E10(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       ProcessFootTracete_2685736755;                     // 0x0E20(0x0050)(Edit)
	float                                         ProcessFootTrace___ProcessFootTrace_SphereTraceByObjectTypes_Radius; // 0x0E70(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E74[0x4];                                      // 0x0E74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ProcessFootTrace___ProcessFootTrace_SphereTraceByObjectTypes_HitLocation; // 0x0E78(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProcessFootTrace___ProcessFootTrace_SphereTraceByObjectTypes_HitNormal; // 0x0E90(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  ProcessFootTrace___ProcessFootTrace_SphereTraceByObjectTypes_WorkData; // 0x0EA8(0x0010)(Edit)
	struct FVector                                ProcessFootTrace___ProcessFootTrace_If_1_Result;   // 0x0EB8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ProcessFootTrace___ProcessFootTrace_If_1_Condition; // 0x0ED0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED1[0xF];                                      // 0x0ED1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ProcessFootTrace___ProcessFootTrace_RigVMFunction_DebugTransformMutableNoSpace_Transform__IO; // 0x0EE0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ProcessFootTrace___ProcessFootTrace_Break_Elements; // 0x0F40(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProcessFootTrace___ProcessFootTrace_RigVMFunction_DebugLineNoSpace_1_A; // 0x0FA0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProcessFootTrace___ProcessFootTrace_Add_1_Result;  // 0x0FB8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProcessFootTrace___ProcessFootTrace_Scale_Result;  // 0x0FD0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       ProcessFootTracete_706990341;                      // 0x0FE8(0x0050)(Edit)
	struct FVector                                ProcessFootTrace___ProcessFootTrace_If_2_Result;   // 0x1038(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ProcessFootTrace___ProcessFootTrace_If_2_Condition; // 0x1050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1051[0x7];                                     // 0x1051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ProcessFootTrace___ProcessFootTrace_SpringInterp_Velocity; // 0x1058(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        ProcessFootTrace___ProcessFootTrace_SpringInterp_SimulatedResult; // 0x1070(0x0010)(Edit)
	TArray<struct FVectorSpringState>             ProcessFootTrace___ProcessFootTrace_SpringInterp_SpringState; // 0x1080(0x0010)(Edit)
	class FName                                   ProcessFootTrace___ProcessFootTrace_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x1090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProcessFootTrace___ProcessFootTrace_Break_1_Elements; // 0x1098(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___ProcessFootTrace_1_TargetOffsetZ;     // 0x10B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___ProcessFootTrace_1_NewHitNormal;      // 0x10B8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___ProcessFootTrace_1_DidTraceHit;       // 0x10D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D1[0x7];                                     // 0x10D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigVMInstructionSetExecuteState       ProcessFootTrace_1te_2060103934;                   // 0x10D8(0x0050)(Edit)
	struct FVector                                ProcessFootTrace_1___ProcessFootTrace_Add_Result;  // 0x1128(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ProcessFootTrace_1___ProcessFootTrace_GetTransform_Transform; // 0x1140(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              ProcessFootTrace_1___ProcessFootTrace_GetTransform_CachedIndex; // 0x11A0(0x0010)(Edit)
	struct FVector                                ProcessFootTrace_1___ProcessFootTrace_Add_A;       // 0x11B0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProcessFootTrace_1___ProcessFootTrace_Subtract_Result; // 0x11C8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ProcessFootTrace_1___ProcessFootTrace_If_Result;   // 0x11E0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       ProcessFootTrace_1te_2685736755;                   // 0x11F0(0x0050)(Edit)
	float                                         ProcessFootTrace_1___ProcessFootTrace_SphereTraceByObjectTypes_Radius; // 0x1240(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1244[0x4];                                     // 0x1244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ProcessFootTrace_1___ProcessFootTrace_SphereTraceByObjectTypes_HitLocation; // 0x1248(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProcessFootTrace_1___ProcessFootTrace_SphereTraceByObjectTypes_HitNormal; // 0x1260(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  ProcessFootTrace_1___ProcessFootTrace_SphereTraceByObjectTypes_WorkData; // 0x1278(0x0010)(Edit)
	struct FVector                                ProcessFootTrace_1___ProcessFootTrace_If_1_Result; // 0x1288(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ProcessFootTrace_1___ProcessFootTrace_If_1_Condition; // 0x12A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A1[0xF];                                     // 0x12A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ProcessFootTrace_1___ProcessFootTrace_RigVMFunction_DebugTransformMutableNoSpace_Transform__IO; // 0x12B0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             ProcessFootTrace_1___ProcessFootTrace_Break_Elements; // 0x1310(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProcessFootTrace_1___ProcessFootTrace_RigVMFunction_DebugLineNoSpace_1_A; // 0x1370(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProcessFootTrace_1___ProcessFootTrace_Add_1_Result; // 0x1388(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProcessFootTrace_1___ProcessFootTrace_Scale_Result; // 0x13A0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       ProcessFootTrace_1te_706990341;                    // 0x13B8(0x0050)(Edit)
	struct FVector                                ProcessFootTrace_1___ProcessFootTrace_If_2_Result; // 0x1408(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ProcessFootTrace_1___ProcessFootTrace_If_2_Condition; // 0x1420(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1421[0x7];                                     // 0x1421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ProcessFootTrace_1___ProcessFootTrace_SpringInterp_Velocity; // 0x1428(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        ProcessFootTrace_1___ProcessFootTrace_SpringInterp_SimulatedResult; // 0x1440(0x0010)(Edit)
	TArray<struct FVectorSpringState>             ProcessFootTrace_1___ProcessFootTrace_SpringInterp_SpringState; // 0x1450(0x0010)(Edit)
	class FName                                   ProcessFootTrace_1___ProcessFootTrace_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x1460(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ProcessFootTrace_1___ProcessFootTrace_Break_1_Elements; // 0x1468(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_Result;                  // 0x1480(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1484[0x4];                                     // 0x1484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___Minimum_Result;                       // 0x1488(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_Target;                  // 0x1490(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_Current;                 // 0x1494(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SpringInterp_Velocity;                // 0x1498(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149C[0x4];                                     // 0x149C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 RigVMModel___SpringInterp_SimulatedResult;         // 0x14A0(0x0010)(Edit)
	TArray<struct FFloatSpringState>              RigVMModel___SpringInterp_SpringState;             // 0x14B0(0x0010)(Edit)
	struct FVector                                RigVMModel___Rotate_Vector_Result;                 // 0x14C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D8[0x8];                                     // 0x14D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___Inverse_Result;                       // 0x14E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___GetTransform_3_Transform;             // 0x1540(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___GetTransform_3_CachedIndex;           // 0x15A0(0x0010)(Edit)
	float                                         RigVMModel___AlphaInterp_1_Result;                 // 0x15B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___If_1_1_Result;                        // 0x15B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_1840785817;                      // 0x15B8(0x0050)(Edit)
	bool                                          RigVMModel___MathBoolAnd_1_Result;                 // 0x1608(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___MathBoolNot_Result;                   // 0x1609(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_160A[0x6];                                     // 0x160A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_1_ScaleBiasClamp;         // 0x1610(0x0010)(Edit)
	struct FVector                                RigVMModel___Rotate_Vector_Vector__IO;             // 0x1620(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Multiply_Result;                      // 0x1638(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Add_Result;                           // 0x1640(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___AlphaInterp_Result;                   // 0x1648(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___If_1_Result;                          // 0x164C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___If_1_Condition;                       // 0x1650(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1651[0x3];                                     // 0x1651(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___MathFloatRemap_Result;                // 0x1654(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatRemap_Value;                 // 0x1658(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165C[0x4];                                     // 0x165C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputScaleBiasClamp>           RigVMModel___AlphaInterp_ScaleBiasClamp;           // 0x1660(0x0010)(Edit)
	double                                        RigVMModel___Add_B;                                // 0x1670(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1678[0x8];                                     // 0x1678(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___Set_Transform_3_Value__IO;            // 0x1680(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___Set_Transform_3_CachedIndex;          // 0x16E0(0x0010)(Edit)
