#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ChimeraHitmark

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ChimeraHitmark.W_ChimeraHitmark_C
// 0x0038 (0x03D8 - 0x03A0)
class UW_ChimeraHitmark_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              ScaleBox_Hitmark;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hitmark_Image;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowHitmark;                                       // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	ECrHitmarkType                                Hitmark_Type;                                      // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        Sound;                                             // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Play_Hitmark_Sound;                                // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x03D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_ChimeraHitmark(int32 EntryPoint);
	void OnAnimShowFinished();
	void OnLoaded_EBCC1DA0D442DF17FBC7149AE1073925(class UObject* Loaded);
	void PreConstruct(bool IsDesignTime);
	void ResetAnim();
	void StopSound(double Fade_Out_Duration);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ChimeraHitmark_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ChimeraHitmark_C")
	}
	static class UW_ChimeraHitmark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ChimeraHitmark_C>();
	}
};
DUMPER7_ASSERTS_UW_ChimeraHitmark_C;

}

