#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryGemSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ChimeraUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryGemSlot.WBP_InventoryGemSlot_C
// 0x0048 (0x0560 - 0x0518)
class UWBP_InventoryGemSlot_C final : public UCrUW_GemInventorySlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0518(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBoxWidget;                                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               NameFieldSizeBox;                                  // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NameField;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockedIcon;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Level;                                             // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FColor                                 BackgroundColor;                                   // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 FullStackColor;                                    // 0x054C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HighlightColor;                                    // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FLinearColor ConvertToGrayScale(const struct FColor& InColor);
	void ExecuteUbergraph_WBP_InventoryGemSlot(int32 EntryPoint);
	void HideFullStackIcon();
	void SetBackgroundColor(const struct FColor& InColor);
	void SetDefaultBrush();
	void SetFullStackColor(const struct FColor& InColor);
	void SetFullStackHighlight();
	void SetGrayedNames(bool bGray);
	void SetGrayScaleTex(const struct FSlateBrush& InBrush);
	void SetHighlightColor(const struct FLinearColor& InColor);
	void SetSlotSize(const struct FVector2D& InSize);
	void ShowItemNameInIcon(const class FText& InText, bool Show);
	void UpdateVisuals(bool bInLocked, int32 Level_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InventoryGemSlot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InventoryGemSlot_C")
	}
	static class UWBP_InventoryGemSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryGemSlot_C>();
	}
};
DUMPER7_ASSERTS_UWBP_InventoryGemSlot_C;

}

