#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RecipesBoxWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_RecipesBoxWidget.WBP_RecipesBoxWidget_C.EnableLine
// 0x0001 (0x0001 - 0x0000)
struct WBP_RecipesBoxWidget_C_EnableLine final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RecipesBoxWidget_C_EnableLine;

// Function WBP_RecipesBoxWidget.WBP_RecipesBoxWidget_C.ExecuteUbergraph_WBP_RecipesBoxWidget
// 0x0080 (0x0080 - 0x0000)
struct WBP_RecipesBoxWidget_C_ExecuteUbergraph_WBP_RecipesBoxWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bExpand;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnabled;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Level;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
	const class UCrCommonUIColorsDevSettings*     K2Node_Event_Settings;                             // 0x0060(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFocused;                             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Text;                                 // 0x0070(0x0010)(ConstParm)
};
DUMPER7_ASSERTS_WBP_RecipesBoxWidget_C_ExecuteUbergraph_WBP_RecipesBoxWidget;

// Function WBP_RecipesBoxWidget.WBP_RecipesBoxWidget_C.ExpandRecipes
// 0x0001 (0x0001 - 0x0000)
struct WBP_RecipesBoxWidget_C_ExpandRecipes final
{
public:
	bool                                          bExpand;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RecipesBoxWidget_C_ExpandRecipes;

// Function WBP_RecipesBoxWidget.WBP_RecipesBoxWidget_C.SetColors
// 0x0008 (0x0008 - 0x0000)
struct WBP_RecipesBoxWidget_C_SetColors final
{
public:
	const class UCrCommonUIColorsDevSettings*     Settings;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RecipesBoxWidget_C_SetColors;

// Function WBP_RecipesBoxWidget.WBP_RecipesBoxWidget_C.SetExpanded
// 0x0001 (0x0001 - 0x0000)
struct WBP_RecipesBoxWidget_C_SetExpanded final
{
public:
	bool                                          bExpand;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RecipesBoxWidget_C_SetExpanded;

// Function WBP_RecipesBoxWidget.WBP_RecipesBoxWidget_C.SetIgnoreFocusColor
// 0x0001 (0x0001 - 0x0000)
struct WBP_RecipesBoxWidget_C_SetIgnoreFocusColor final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RecipesBoxWidget_C_SetIgnoreFocusColor;

// Function WBP_RecipesBoxWidget.WBP_RecipesBoxWidget_C.SetLevel
// 0x0004 (0x0004 - 0x0000)
struct WBP_RecipesBoxWidget_C_SetLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RecipesBoxWidget_C_SetLevel;

// Function WBP_RecipesBoxWidget.WBP_RecipesBoxWidget_C.SetLevelButtonFocus
// 0x0001 (0x0001 - 0x0000)
struct WBP_RecipesBoxWidget_C_SetLevelButtonFocus final
{
public:
	bool                                          bFocused;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RecipesBoxWidget_C_SetLevelButtonFocus;

// Function WBP_RecipesBoxWidget.WBP_RecipesBoxWidget_C.SetTitle
// 0x0010 (0x0010 - 0x0000)
struct WBP_RecipesBoxWidget_C_SetTitle final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_RecipesBoxWidget_C_SetTitle;

// Function WBP_RecipesBoxWidget.WBP_RecipesBoxWidget_C.SetWidgetTitle
// 0x0010 (0x0010 - 0x0000)
struct WBP_RecipesBoxWidget_C_SetWidgetTitle final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_RecipesBoxWidget_C_SetWidgetTitle;

// Function WBP_RecipesBoxWidget.WBP_RecipesBoxWidget_C.SetWidth
// 0x0010 (0x0010 - 0x0000)
struct WBP_RecipesBoxWidget_C_SetWidth final
{
public:
	double                                        InSize;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_RecipesBoxWidget_C_SetWidth;

}

