#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DoubleLine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_DoubleLine.WBP_DoubleLine_C.ExecuteUbergraph_WBP_DoubleLine
// 0x0004 (0x0004 - 0x0000)
struct WBP_DoubleLine_C_ExecuteUbergraph_WBP_DoubleLine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_DoubleLine_C_ExecuteUbergraph_WBP_DoubleLine;

// Function WBP_DoubleLine.WBP_DoubleLine_C.Set Text Size
// 0x0008 (0x0008 - 0x0000)
struct WBP_DoubleLine_C_Set_Text_Size final
{
public:
	class UClass*                                 InStyle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_DoubleLine_C_Set_Text_Size;

// Function WBP_DoubleLine.WBP_DoubleLine_C.SetTextStyle
// 0x0044 (0x0044 - 0x0000)
struct WBP_DoubleLine_C_SetTextStyle final
{
public:
	bool                                          isHighlight;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_2;    // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_3;    // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_DoubleLine_C_SetTextStyle;

// Function WBP_DoubleLine.WBP_DoubleLine_C.SetTitle
// 0x0010 (0x0010 - 0x0000)
struct WBP_DoubleLine_C_SetTitle final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_DoubleLine_C_SetTitle;

}

