#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EncyclopediaDatapadInfoMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_EncyclopediaDatapadInfoMenu.WBP_EncyclopediaDatapadInfoMenu_C.ExecuteUbergraph_WBP_EncyclopediaDatapadInfoMenu
// 0x0028 (0x0028 - 0x0000)
struct WBP_EncyclopediaDatapadInfoMenu_C_ExecuteUbergraph_WBP_EncyclopediaDatapadInfoMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Title;                                // 0x0008(0x0010)(ConstParm)
	class FText                                   K2Node_Event_Author;                               // 0x0018(0x0010)(ConstParm)
};
DUMPER7_ASSERTS_WBP_EncyclopediaDatapadInfoMenu_C_ExecuteUbergraph_WBP_EncyclopediaDatapadInfoMenu;

// Function WBP_EncyclopediaDatapadInfoMenu.WBP_EncyclopediaDatapadInfoMenu_C.SetEntryAuthorTextBP
// 0x0010 (0x0010 - 0x0000)
struct WBP_EncyclopediaDatapadInfoMenu_C_SetEntryAuthorTextBP final
{
public:
	class FText                                   Author;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_EncyclopediaDatapadInfoMenu_C_SetEntryAuthorTextBP;

// Function WBP_EncyclopediaDatapadInfoMenu.WBP_EncyclopediaDatapadInfoMenu_C.SetEntryTitleBP
// 0x0010 (0x0010 - 0x0000)
struct WBP_EncyclopediaDatapadInfoMenu_C_SetEntryTitleBP final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_EncyclopediaDatapadInfoMenu_C_SetEntryTitleBP;

}

