#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToolSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ToolSlot.WBP_ToolSlot_C.ExecuteUbergraph_WBP_ToolSlot
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_ToolSlot_C_ExecuteUbergraph_WBP_ToolSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_Event_InBrush;                              // 0x0010(0x00B0)()
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ToolSlot_C_ExecuteUbergraph_WBP_ToolSlot;

// Function WBP_ToolSlot.WBP_ToolSlot_C.SetIcon
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_ToolSlot_C_SetIcon final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_ToolSlot_C_SetIcon;

// Function WBP_ToolSlot.WBP_ToolSlot_C.SetTitle
// 0x0010 (0x0010 - 0x0000)
struct WBP_ToolSlot_C_SetTitle final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_ToolSlot_C_SetTitle;

}

