#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventorySingleItemContainer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AuItems_structs.hpp"


namespace SDK::Params
{

// Function WBP_InventorySingleItemContainer.WBP_InventorySingleItemContainer_C.ExecuteUbergraph_WBP_InventorySingleItemContainer
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_InventorySingleItemContainer_C_ExecuteUbergraph_WBP_InventorySingleItemContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Event_InBrush;                              // 0x0010(0x00B0)(ConstParm)
	EUIItemType                                   K2Node_Event_InUIType;                             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InventorySingleItemContainer_C_ExecuteUbergraph_WBP_InventorySingleItemContainer;

// Function WBP_InventorySingleItemContainer.WBP_InventorySingleItemContainer_C.SetItemEmptyBrush
// 0x0004 (0x0004 - 0x0000)
struct WBP_InventorySingleItemContainer_C_SetItemEmptyBrush final
{
public:
	struct FColor                                 CallFunc_GetIconTypeColor_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InventorySingleItemContainer_C_SetItemEmptyBrush;

// Function WBP_InventorySingleItemContainer.WBP_InventorySingleItemContainer_C.SetItemSize
// 0x0030 (0x0030 - 0x0000)
struct WBP_InventorySingleItemContainer_C_SetItemSize final
{
public:
	double                                        InSize;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_C*                   K2Node_DynamicCast_AsWBP_Inventory_Slot;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InventorySingleItemContainer_C_SetItemSize;

// Function WBP_InventorySingleItemContainer.WBP_InventorySingleItemContainer_C.SetRecipeOutSlot
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_InventorySingleItemContainer_C_SetRecipeOutSlot final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EUIItemType                                   InUIType;                                          // 0x00B0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InventorySingleItemContainer_C_SetRecipeOutSlot;

}

