#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventorySingleOutItemContainer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "AuItems_structs.hpp"


namespace SDK::Params
{

// Function WBP_InventorySingleOutItemContainer.WBP_InventorySingleOutItemContainer_C.ExecuteUbergraph_WBP_InventorySingleOutItemContainer
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_InventorySingleOutItemContainer_C_ExecuteUbergraph_WBP_InventorySingleOutItemContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Event_InBrush;                              // 0x0010(0x00B0)(ConstParm)
	EUIItemType                                   K2Node_Event_InUIType;                             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAmount_ReturnValue;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InventorySingleOutItemContainer_C_ExecuteUbergraph_WBP_InventorySingleOutItemContainer;

// Function WBP_InventorySingleOutItemContainer.WBP_InventorySingleOutItemContainer_C.SetItemEmptyBrush
// 0x0004 (0x0004 - 0x0000)
struct WBP_InventorySingleOutItemContainer_C_SetItemEmptyBrush final
{
public:
	struct FColor                                 CallFunc_GetIconTypeColor_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InventorySingleOutItemContainer_C_SetItemEmptyBrush;

// Function WBP_InventorySingleOutItemContainer.WBP_InventorySingleOutItemContainer_C.SetRecipeOutSlot
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_InventorySingleOutItemContainer_C_SetRecipeOutSlot final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EUIItemType                                   InUIType;                                          // 0x00B0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InventorySingleOutItemContainer_C_SetRecipeOutSlot;

}

