#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuildingLogisticsPriorityButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Chimera_structs.hpp"
#include "ChimeraUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BuildingLogisticsPriorityButton.WBP_BuildingLogisticsPriorityButton_C
// 0x0040 (0x16F0 - 0x16B0)
class UWBP_BuildingLogisticsPriorityButton_C final : public UCrUW_BuildingPriorityButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x16B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       Text;                                              // 0x16B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonIcon;                                        // 0x16C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x16C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bInitialized;                                      // 0x16D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x16D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D2[0x2];                                     // 0x16D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           HighlightColor;                                    // 0x16D4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_WBP_BuildingLogisticsPriorityButton(int32 EntryPoint);
	void InitializeMaterial();
	void SetColors();
	void UpdateVisuals(ECrLogisticsRequestPriority InPriority);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_BuildingLogisticsPriorityButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_BuildingLogisticsPriorityButton_C")
	}
	static class UWBP_BuildingLogisticsPriorityButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BuildingLogisticsPriorityButton_C>();
	}
};
DUMPER7_ASSERTS_UWBP_BuildingLogisticsPriorityButton_C;

}

