#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryItemContainer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_InventoryItemContainer.WBP_InventoryItemContainer_C.ExecuteUbergraph_WBP_InventoryItemContainer
// 0x0028 (0x0028 - 0x0000)
struct WBP_InventoryItemContainer_C_ExecuteUbergraph_WBP_InventoryItemContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              K2Node_Event_InSlot;                               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InventoryItemContainer_C_ExecuteUbergraph_WBP_InventoryItemContainer;

// Function WBP_InventoryItemContainer.WBP_InventoryItemContainer_C.SetSlotOffset
// 0x0008 (0x0008 - 0x0000)
struct WBP_InventoryItemContainer_C_SetSlotOffset final
{
public:
	class UGridSlot*                              InSlot;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_InventoryItemContainer_C_SetSlotOffset;

}

