#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_TabButton.WBP_TabButton_C.ExecuteUbergraph_WBP_TabButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Selected;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Show;                                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabButton_C_ExecuteUbergraph_WBP_TabButton;

// Function WBP_TabButton.WBP_TabButton_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabButton_C_SetSelected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabButton_C_SetSelected;

// Function WBP_TabButton.WBP_TabButton_C.ShowWarningIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabButton_C_ShowWarningIcon final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabButton_C_ShowWarningIcon;

}

