#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OverallUILayout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_OverallUILayout.WBP_OverallUILayout_C
// 0x0028 (0x0458 - 0x0430)
class UWBP_OverallUILayout_C final : public UPrimaryGameLayout
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActivatableWidgetStack*          Modal_Stack;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetStack*          Menu_Stack;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetStack*          GameMenu_Stack;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetStack*          GameLayer_Stack;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_OverallUILayout(int32 EntryPoint);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_OverallUILayout_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_OverallUILayout_C")
	}
	static class UWBP_OverallUILayout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_OverallUILayout_C>();
	}
};
DUMPER7_ASSERTS_UWBP_OverallUILayout_C;

}

