#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZoneGraphDebug

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ZoneGraph_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ZoneGraphDebug.ZoneLaneTest
// 0x0008 (0x0030 - 0x0028)
class UZoneLaneTest : public UObject
{
public:
	class UZoneGraphTestingComponent*             OwnerComponent;                                    // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZoneLaneTest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZoneLaneTest")
	}
	static class UZoneLaneTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneLaneTest>();
	}
};
DUMPER7_ASSERTS_UZoneLaneTest;

// Class ZoneGraphDebug.ZoneGraphTestingComponent
// 0x02E0 (0x0810 - 0x0530)
class UZoneGraphTestingComponent final : public UPrimitiveComponent
{
public:
	uint8                                         Pad_530[0x10];                                     // 0x0530(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UZoneGraphSubsystem*                    ZoneGraph;                                         // 0x0540(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	struct FZoneGraphLaneLocation                 LaneLocation;                                      // 0x0548(0x0070)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphLaneLocation                 NextLaneLocation;                                  // 0x05B8(0x0070)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphLaneLocation                 NearestLaneLocation;                               // 0x0628(0x0070)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                SearchExtent;                                      // 0x0698(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AdvanceDistance;                                   // 0x06B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6B4[0x4];                                      // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NearestTestOffset;                                 // 0x06B8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FZoneGraphTagFilter                    QueryFilter;                                       // 0x06D0(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bDrawLinkedLanes;                                  // 0x06DC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawLaneTangentVectors;                           // 0x06DD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawLaneSmoothing;                                // 0x06DE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawBVTreeQuery;                                  // 0x06DF(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawLanePath;                                     // 0x06E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AZoneGraphTestingActor*                 OtherActor;                                        // 0x06E8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_6F0[0x100];                                    // 0x06F0(0x0100)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UZoneLaneTest*>                  CustomTests;                                       // 0x07F0(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_800[0x10];                                     // 0x0800(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisableCustomTests();
	void EnableCustomTests();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZoneGraphTestingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZoneGraphTestingComponent")
	}
	static class UZoneGraphTestingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphTestingComponent>();
	}
};
DUMPER7_ASSERTS_UZoneGraphTestingComponent;

// Class ZoneGraphDebug.ZoneGraphTestingActor
// 0x0008 (0x02B0 - 0x02A8)
class AZoneGraphTestingActor final : public AActor
{
public:
	class UZoneGraphTestingComponent*             DebugComp;                                         // 0x02A8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void DisableCustomTests();
	void EnableCustomTests();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZoneGraphTestingActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZoneGraphTestingActor")
	}
	static class AZoneGraphTestingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZoneGraphTestingActor>();
	}
};
DUMPER7_ASSERTS_AZoneGraphTestingActor;

}

