#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ItemAnimLayers_FPP_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EAnimEnum_CardinalDirection_structs.hpp"


namespace SDK::Params
{

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_AnimGraph;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.BlueprintThreadSafeUpdateAnimation
// 0x0020 (0x0020 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Update_Blend_Weight_Data_DeltaTime_ImplicitCast; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_BlueprintThreadSafeUpdateAnimation;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_BlueprintUpdateAnimation;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.CanPlayIdleBreak
// 0x0070 (0x0070 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_CanPlayIdleBreak final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_1;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_2;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_3;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_4;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  CallFunc_GetMainPlayerBP_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequence*>                  K2Node_Select_Default;                             // 0x0058(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_CanPlayIdleBreak;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.ChooseIdleBreakDelayTime
// 0x0050 (0x0050 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_ChooseIdleBreakDelayTime final
{
public:
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_ChooseIdleBreakDelayTime;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.ExecuteUbergraph_ABP_ItemAnimLayers_FPP_Base
// 0x02B8 (0x02B8 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_ExecuteUbergraph_ABP_ItemAnimLayers_FPP_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_1;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_2;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_3;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_4;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_5;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_6;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_7;    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_8;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_9;    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_10;   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_11;   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_12;   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  CallFunc_GetMainPlayerBP_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_13;   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_14;   // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  CallFunc_GetMainPlayerBP_ReturnValue_1;            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_15;   // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_16;   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_17;   // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  CallFunc_GetMainPlayerBP_ReturnValue_2;            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_18;   // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_19;   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  CallFunc_GetMainPlayerBP_ReturnValue_3;            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_20;   // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_21;   // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_22;   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_12;                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  CallFunc_GetMainPlayerBP_ReturnValue_4;            // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_13;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_23;   // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_24;   // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_14;                 // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_25;   // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_26;   // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMovingPerpendicularToInitialPivot_ReturnValue; // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_27;   // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPlayIdleBreak_ReturnValue;             // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_28;   // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_29;   // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_30;   // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_3;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_31;   // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_32;   // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_33;   // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_34;   // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_15;                 // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_35;   // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_36;   // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_37;   // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_38;   // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_16;                 // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_17;                 // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_293[0x5];                                      // 0x0293(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_39;   // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_18;                 // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_19;                 // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_20;                 // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_ExecuteUbergraph_ABP_ItemAnimLayers_FPP_Base;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_Aiming
// 0x0030 (0x0030 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_Aiming final
{
public:
	struct FPoseLink                              PreAimPose;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        AimYaw_0;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AimPitch_0;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              FullBody_Aiming_0;                                 // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_Aiming;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_CycleState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_CycleState final
{
public:
	struct FPoseLink                              FullBody_CycleState_0;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_CycleState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_Dash
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_Dash final
{
public:
	struct FPoseLink                              FullBody_Dash_0;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_Dash;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_DoubleJump
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_DoubleJump final
{
public:
	struct FPoseLink                              FullBody_DoubleJump_0;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_DoubleJump;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_EntryState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_EntryState final
{
public:
	struct FPoseLink                              FullBody_EntryState_0;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_EntryState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_FallLandState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_FallLandState final
{
public:
	struct FPoseLink                              FullBody_FallLandState_0;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_FallLandState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_FallLoopState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_FallLoopState final
{
public:
	struct FPoseLink                              FullBody_FallLoopState_0;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_FallLoopState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_IdleState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_IdleState final
{
public:
	struct FPoseLink                              FullBody_IdleState_0;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_IdleState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_JumpApexState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_JumpApexState final
{
public:
	struct FPoseLink                              FullBody_JumpApexState_0;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_JumpApexState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_JumpStartLoopState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_JumpStartLoopState final
{
public:
	struct FPoseLink                              FullBody_JumpStartLoopState_0;                     // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_JumpStartLoopState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_JumpStartState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_JumpStartState final
{
public:
	struct FPoseLink                              FullBody_JumpStartState_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_JumpStartState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_PivotState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_PivotState final
{
public:
	struct FPoseLink                              FullBody_PivotState_0;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_PivotState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_SkeletalControls
// 0x0020 (0x0020 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_SkeletalControls final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FullBody_SkeletalControls_0;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_SkeletalControls;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_SlideInState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_SlideInState final
{
public:
	struct FPoseLink                              FullBody_SlideInState_0;                           // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_SlideInState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_SlideLoopState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_SlideLoopState final
{
public:
	struct FPoseLink                              FullBody_SlideLoopState_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_SlideLoopState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_SlideOutState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_SlideOutState final
{
public:
	struct FPoseLink                              FullBody_SlideOutState_0;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_SlideOutState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_StartState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_StartState final
{
public:
	struct FPoseLink                              FullBody_StartState_0;                             // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_StartState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBody_StopState
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBody_StopState final
{
public:
	struct FPoseLink                              FullBody_StopState_0;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBody_StopState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.FullBodyAdditives
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_FullBodyAdditives final
{
public:
	struct FPoseLink                              FullBodyAdditives_0;                               // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_FullBodyAdditives;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.GetCameraRotationAxis
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_GetCameraRotationAxis final
{
public:
	double                                        MouseX_0;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MouseY_0;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_GetCameraRotationAxis;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.GetDesiredPivotSequence
// 0x00F8 (0x00F8 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_GetDesiredPivotSequence final
{
public:
	EAnimEnum_CardinalDirection                   InDirection;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  CallFunc_GetMainPlayerBP_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_1;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  CallFunc_GetMainPlayerBP_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_1;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_2;                              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_2;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_3;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_3;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_4;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_5;    // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_4;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_5;                              // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  CallFunc_GetMainPlayerBP_ReturnValue_2;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_6;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Select_Default;                             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_1;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_2;                           // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_7;    // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Select_Default_3;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_4;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_5;                           // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_6;                           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_7;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_8;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_9;                           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default_10;                          // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_GetDesiredPivotSequence;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.GetMainAnimBPThreadSafe
// 0x0018 (0x0018 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_GetMainAnimBPThreadSafe final
{
public:
	class UABP_Mannequin_FPP_Base_C*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              K2Node_DynamicCast_AsABP_Mannequin_FPP_Base;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_GetMainAnimBPThreadSafe;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.GetMainPlayerBP
// 0x0018 (0x0018 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_GetMainPlayerBP final
{
public:
	class ABP_PlayerCharacter_C*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_GetMainPlayerBP;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.GetMovementComponent
// 0x0018 (0x0018 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_GetMovementComponent final
{
public:
	class UCharacterMovementComponent*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*            K2Node_DynamicCast_AsCharacter_Movement_Component; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_GetMovementComponent;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.GetPlayerRotation
// 0x0008 (0x0008 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_GetPlayerRotation final
{
public:
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_GetPlayerRotation;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.GetPlayerSpeed
// 0x0078 (0x0078 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_GetPlayerSpeed final
{
public:
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_1;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_2;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDeltaSeconds_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue_3;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_B_ImplicitCast;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Current_ImplicitCast;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_WalkSpeed_ImplicitCast;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_GetPlayerSpeed;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.GetZiplineState
// 0x0008 (0x0008 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_GetZiplineState final
{
public:
	class ABP_PlayerCharacter_C*                  CallFunc_GetMainPlayerBP_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_GetZiplineState;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.Head_FaceLayer
// 0x0010 (0x0010 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_Head_FaceLayer final
{
public:
	struct FPoseLink                              Head_FaceLayer_0;                                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_Head_FaceLayer;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.Land Recovery Start
// 0x0040 (0x0040 - 0x0000)
struct ABP_ItemAnimLayers_FPP_Base_C_Land_Recovery_Start final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class UABP_Mannequin_FPP_Base_C*              CallFunc_GetMainAnimBPThreadSafe_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_ItemAnimLayers_FPP_Base_C_Land_Recovery_Start;

// Function ABP_ItemAnimLayers_FPP_Base.ABP_ItemAnimLayers_FPP_Base_C.LeftHandPose_OverrideState
// 0x0020 (0x0020 - 0x0000)
