#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsyncMessageSystem

#include "Basic.hpp"

#include "AsyncMessageSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class AsyncMessageSystem.AsyncAction_ListenForAsyncMessage
// 0x0068 (0x0098 - 0x0030)
class UAsyncAction_ListenForAsyncMessage final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FAsyncMessage& Message)> OnMessageReceived;           // 0x0030(0x0018)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x50];                                      // 0x0048(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_ListenForAsyncMessage* StartListeningForAsyncMessage(class UObject* WorldContextObject, const struct FAsyncMessageId& MessageId, TScriptInterface<class IAsyncMessageBindingEndpointInterface> DesiredEndpoint, const ETickingGroup TickGroup);

	void StopListeningForAsyncMessage();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncAction_ListenForAsyncMessage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncAction_ListenForAsyncMessage")
	}
	static class UAsyncAction_ListenForAsyncMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ListenForAsyncMessage>();
	}
};
DUMPER7_ASSERTS_UAsyncAction_ListenForAsyncMessage;

// Class AsyncMessageSystem.AsyncMessageBindingEndpointInterface
// 0x0000 (0x0000 - 0x0000)
class IAsyncMessageBindingEndpointInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncMessageBindingEndpointInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncMessageBindingEndpointInterface")
	}
	static class IAsyncMessageBindingEndpointInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAsyncMessageBindingEndpointInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAsyncMessageBindingEndpointInterface;

// Class AsyncMessageSystem.AsyncMessageBindingComponent
// 0x0018 (0x00D0 - 0x00B8)
class UAsyncMessageBindingComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncMessageBindingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncMessageBindingComponent")
	}
	static class UAsyncMessageBindingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncMessageBindingComponent>();
	}
};
DUMPER7_ASSERTS_UAsyncMessageBindingComponent;

// Class AsyncMessageSystem.AsyncMessageSystemBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAsyncMessageSystemBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FString Conv_AsyncMessageIdToString(const struct FAsyncMessageId& MessageId);
	static class FString GetMessageBlueprintScriptCallstack(const struct FAsyncMessage& Message);
	static class FString GetMessageNativeQueueCallstack(const struct FAsyncMessage& Message);
	static bool QueueAsyncMessageForBroadcast(class UObject* WorldContextObject, const struct FAsyncMessageId& MessageId, const struct FInstancedStruct& Payload, TScriptInterface<class IAsyncMessageBindingEndpointInterface> DesiredEndpoint);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncMessageSystemBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncMessageSystemBlueprintLibrary")
	}
	static class UAsyncMessageSystemBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncMessageSystemBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UAsyncMessageSystemBlueprintLibrary;

// Class AsyncMessageSystem.AsyncMessageDeveloperSettings
// 0x0020 (0x0058 - 0x0038)
class UAsyncMessageDeveloperSettings final : public UDeveloperSettings
{
public:
	bool                                          bMessageQueueDebugEnabled;                         // 0x0038(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bTriggerDebugBreakpointWhenMessageQueued;          // 0x0039(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPrintScriptCallstackWhenMessageQueued;            // 0x003A(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShouldRecordQueueCallstackOnMessages;             // 0x003B(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnabledDebuggingForAllQueuedMessages;             // 0x003C(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAsyncMessageId>                EnabledDebugMessages;                              // 0x0040(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	bool                                          bEnableWorldSubsystem;                             // 0x0050(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableWorldSubsystemInEditor;                     // 0x0051(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncMessageDeveloperSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncMessageDeveloperSettings")
	}
	static class UAsyncMessageDeveloperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncMessageDeveloperSettings>();
	}
};
DUMPER7_ASSERTS_UAsyncMessageDeveloperSettings;

// Class AsyncMessageSystem.TestAsyncObject
// 0x0008 (0x0030 - 0x0028)
class UTestAsyncObject final : public UObject
{
public:
	int32                                         TestValue;                                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TestAsyncObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TestAsyncObject")
	}
	static class UTestAsyncObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestAsyncObject>();
	}
};
DUMPER7_ASSERTS_UTestAsyncObject;

// Class AsyncMessageSystem.AsyncMessageWorldSubsystem
// 0x0030 (0x0060 - 0x0030)
class UAsyncMessageWorldSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncMessageWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncMessageWorldSubsystem")
	}
	static class UAsyncMessageWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncMessageWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_UAsyncMessageWorldSubsystem;

}

