#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuAbilities

#include "Basic.hpp"

#include "AuAbilities_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AuItems_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AuAbilities.AuAbilitiesBPF.AddInstigator
// 0x0028 (0x0028 - 0x0000)
struct AuAbilitiesBPF_AddInstigator final
{
public:
	struct FGameplayEffectContextHandle           Context;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	class AActor*                                 InInstigator;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InEffectCauser;                                    // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_AddInstigator;

// Function AuAbilities.AuAbilitiesBPF.AddSpecTag
// 0x0018 (0x0018 - 0x0000)
struct AuAbilitiesBPF_AddSpecTag final
{
public:
	struct FGameplayEffectSpecHandle              Spec;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_AddSpecTag;

// Function AuAbilities.AuAbilitiesBPF.AddSpecTags
// 0x0030 (0x0030 - 0x0000)
struct AuAbilitiesBPF_AddSpecTags final
{
public:
	struct FGameplayEffectSpecHandle              Spec;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Tags;                                              // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_AddSpecTags;

// Function AuAbilities.AuAbilitiesBPF.DuplicateEffectContext
// 0x0030 (0x0030 - 0x0000)
struct AuAbilitiesBPF_DuplicateEffectContext final
{
public:
	struct FGameplayEffectContextHandle           Context;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_DuplicateEffectContext;

// Function AuAbilities.AuAbilitiesBPF.EqualEqual_NxAttribute
// 0x0088 (0x0088 - 0x0000)
struct AuAbilitiesBPF_EqualEqual_NxAttribute final
{
public:
	struct FAuGameplayAttribute                   A;                                                 // 0x0000(0x0040)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuGameplayAttribute                   B;                                                 // 0x0040(0x0040)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAbilitiesBPF_EqualEqual_NxAttribute;

// Function AuAbilities.AuAbilitiesBPF.EqualEqual_NxToGameplayAttribute
// 0x0080 (0x0080 - 0x0000)
struct AuAbilitiesBPF_EqualEqual_NxToGameplayAttribute final
{
public:
	struct FAuGameplayAttribute                   A;                                                 // 0x0000(0x0040)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAttribute                     B;                                                 // 0x0040(0x0038)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAbilitiesBPF_EqualEqual_NxToGameplayAttribute;

// Function AuAbilities.AuAbilitiesBPF.GetAttributeName
// 0x0048 (0x0048 - 0x0000)
struct AuAbilitiesBPF_GetAttributeName final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_GetAttributeName;

// Function AuAbilities.AuAbilitiesBPF.GetCooldownTimeRemainingAndDuration
// 0x0010 (0x0010 - 0x0000)
struct AuAbilitiesBPF_GetCooldownTimeRemainingAndDuration final
{
public:
	class UGameplayAbility*                       Ability;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeRemaining;                                     // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CooldownDuration;                                  // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_GetCooldownTimeRemainingAndDuration;

// Function AuAbilities.AuAbilitiesBPF.GetNxAttributeName
// 0x0050 (0x0050 - 0x0000)
struct AuAbilitiesBPF_GetNxAttributeName final
{
public:
	struct FAuGameplayAttribute                   Attribute;                                         // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_GetNxAttributeName;

// Function AuAbilities.AuAbilitiesBPF.GetOwnerItem
// 0x0020 (0x0020 - 0x0000)
struct AuAbilitiesBPF_GetOwnerItem final
{
public:
	struct FGameplayEffectContextHandle           Context;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UAuItemDataBase*                  ReturnValue;                                       // 0x0018(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_GetOwnerItem;

// Function AuAbilities.AuAbilitiesBPF.GetSpecName
// 0x0020 (0x0020 - 0x0000)
struct AuAbilitiesBPF_GetSpecName final
{
public:
	struct FGameplayEffectSpecHandle              Spec;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_GetSpecName;

// Function AuAbilities.AuAbilitiesBPF.MakeSpecHandle
// 0x0030 (0x0030 - 0x0000)
struct AuAbilitiesBPF_MakeSpecHandle final
{
public:
	TSubclassOf<class UGameplayEffect>            InGameplayEffect;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InInstigator;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InEffectCauser;                                    // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InLevel;                                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_MakeSpecHandle;

// Function AuAbilities.AuAbilitiesBPF.RemoveEffectsFromTarget
// 0x0038 (0x0038 - 0x0000)
struct AuAbilitiesBPF_RemoveEffectsFromTarget final
{
public:
	TArray<struct FActiveGameplayEffectHandle>    Handles;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayAbilityTargetDataHandle       Target;                                            // 0x0010(0x0028)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_RemoveEffectsFromTarget;

// Function AuAbilities.AuAbilitiesBPF.SetAbilityProjectile
// 0x0068 (0x0068 - 0x0000)
struct AuAbilitiesBPF_SetAbilityProjectile final
{
public:
	struct FGameplayAbilityTargetDataHandle       To;                                                // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	class AActor*                                 Instigator;                                        // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectSpecHandle              EffectSpec;                                        // 0x0030(0x0010)(Parm, NativeAccessSpecifierPublic)
	float                                         InSpeed;                                           // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InLocation;                                        // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuAbilityPMC*                          ReturnValue;                                       // 0x0060(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_SetAbilityProjectile;

// Function AuAbilities.AuAbilitiesBPF.SetAbilityProjectileHit
// 0x0060 (0x0060 - 0x0000)
struct AuAbilitiesBPF_SetAbilityProjectileHit final
{
public:
	struct FGameplayAbilityTargetDataHandle       To;                                                // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	class AActor*                                 Instigator;                                        // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectSpecHandle              EffectSpec;                                        // 0x0030(0x0010)(Parm, NativeAccessSpecifierPublic)
	float                                         InSpeed;                                           // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     TargetLocation;                                    // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UAuAbilityPMC*                          ReturnValue;                                       // 0x0058(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_SetAbilityProjectileHit;

// Function AuAbilities.AuAbilitiesBPF.SetContextInSpec
// 0x0028 (0x0028 - 0x0000)
struct AuAbilitiesBPF_SetContextInSpec final
{
public:
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           Context;                                           // 0x0010(0x0018)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitiesBPF_SetContextInSpec;

// Function AuAbilities.AuAbilitiesBPF.SetTargetHandleInContext
// 0x0020 (0x0020 - 0x0000)
struct AuAbilitiesBPF_SetTargetHandleInContext final
{
public:
	struct FGameplayEffectContextHandle           Context;                                           // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	struct FAuTargetDataHandle                    TargetDataHandle;                                  // 0x0018(0x0002)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAbilitiesBPF_SetTargetHandleInContext;

// Function AuAbilities.AuAbilityActor.NativeOnActorHit
// 0x0130 (0x0130 - 0x0000)
struct AuAbilityActor_NativeOnActorHit final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0030(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityActor_NativeOnActorHit;

// Function AuAbilities.AuAbilityActor.NativeOnActorOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct AuAbilityActor_NativeOnActorOverlapEnd final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAbilityActor_NativeOnActorOverlapEnd;

// Function AuAbilities.AuAbilityActor.NativeOnActorOverlapStart
// 0x0120 (0x0120 - 0x0000)
struct AuAbilityActor_NativeOnActorOverlapStart final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityActor_NativeOnActorOverlapStart;

// Function AuAbilities.AuAbilityActor.OnActorHit
// 0x0130 (0x0130 - 0x0000)
struct AuAbilityActor_OnActorHit final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0030(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityActor_OnActorHit;

// Function AuAbilities.AuAbilityActor.OnActorOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct AuAbilityActor_OnActorOverlapEnd final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAbilityActor_OnActorOverlapEnd;

// Function AuAbilities.AuAbilityActor.OnActorOverlapStart
// 0x0120 (0x0120 - 0x0000)
struct AuAbilityActor_OnActorOverlapStart final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityActor_OnActorOverlapStart;

// Function AuAbilities.AuAbilityActor.GetMass
// 0x0004 (0x0004 - 0x0000)
struct AuAbilityActor_GetMass final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityActor_GetMass;

// Function AuAbilities.AuAbilityPMC_SimpleHoming.SetHomingSpeed
// 0x0004 (0x0004 - 0x0000)
struct AuAbilityPMC_SimpleHoming_SetHomingSpeed final
{
public:
	float                                         InHomingSpeed;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityPMC_SimpleHoming_SetHomingSpeed;

// Function AuAbilities.AuAbilityPMC_SimpleHoming.SetHomingTarget
// 0x0008 (0x0008 - 0x0000)
struct AuAbilityPMC_SimpleHoming_SetHomingTarget final
{
public:
	class USceneComponent*                        InTarget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityPMC_SimpleHoming_SetHomingTarget;

// Function AuAbilities.AuAbilityProjectile.SetLocalVelocity
// 0x0038 (0x0038 - 0x0000)
struct AuAbilityProjectile_SetLocalVelocity final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                End;                                               // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAbilityProjectile_SetLocalVelocity;

// Function AuAbilities.AuAbilityProjectile.SetVelocity
// 0x0018 (0x0018 - 0x0000)
struct AuAbilityProjectile_SetVelocity final
{
public:
	struct FVector                                InVelocity;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityProjectile_SetVelocity;

// Function AuAbilities.AuAbilitySystemComponent.ClientNotifyTargetAttributeChanged
// 0x0040 (0x0040 - 0x0000)
struct AuAbilitySystemComponent_ClientNotifyTargetAttributeChanged final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuReplicatedAttribute                 Attribute;                                         // 0x0008(0x0020)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             AbilitySpec;                                       // 0x0028(0x0004)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuTargetDataHandle                    TargetDataHandle;                                  // 0x002C(0x0002)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InLevel;                                           // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewValue;                                          // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OldValue;                                          // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAbilitySystemComponent_ClientNotifyTargetAttributeChanged;

// Function AuAbilities.AuAbilitySystemComponent.ClientNotifyTargetEffectApplied
// 0x0078 (0x0078 - 0x0000)
struct AuAbilitySystemComponent_ClientNotifyTargetEffectApplied final
{
public:
	struct FGameplayEffectSpecForRPC              Spec;                                              // 0x0000(0x0078)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitySystemComponent_ClientNotifyTargetEffectApplied;

// Function AuAbilities.AuAbilitySystemComponent.DebugGetAttributeValueTag
// 0x00E0 (0x00E0 - 0x0000)
struct AuAbilitySystemComponent_DebugGetAttributeValueTag final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagRequirements               SourceTags;                                        // 0x0038(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TargetTags;                                        // 0x00C0(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitySystemComponent_DebugGetAttributeValueTag;

// Function AuAbilities.AuAbilitySystemComponent.GameplayEffectAppliedToSelf
// 0x02A8 (0x02A8 - 0x0000)
struct AuAbilitySystemComponent_GameplayEffectAppliedToSelf final
{
public:
	class UAbilitySystemComponent*                InstigatorASC;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectSpec                    Spec;                                              // 0x0008(0x0298)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            EffectHandle;                                      // 0x02A0(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitySystemComponent_GameplayEffectAppliedToSelf;

// Function AuAbilities.AuAbilitySystemComponent.GameplayEffectAppliedToTarget
// 0x02A8 (0x02A8 - 0x0000)
struct AuAbilitySystemComponent_GameplayEffectAppliedToTarget final
{
public:
	class UAbilitySystemComponent*                TargetASC;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectSpec                    Spec;                                              // 0x0008(0x0298)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            EffectHandle;                                      // 0x02A0(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitySystemComponent_GameplayEffectAppliedToTarget;

// Function AuAbilities.AuAbilitySystemComponent.FindAllAbilitiesWithExactTag
// 0x0030 (0x0030 - 0x0000)
struct AuAbilitySystemComponent_FindAllAbilitiesWithExactTag final
{
public:
	TArray<struct FGameplayAbilitySpecHandle>     OutAbilityHandles;                                 // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Tags;                                              // 0x0010(0x0020)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilitySystemComponent_FindAllAbilitiesWithExactTag;

// Function AuAbilities.AuAbilityTargetingComponent.ClientSendServerCustomTargets
// 0x0090 (0x0090 - 0x0000)
struct AuAbilityTargetingComponent_ClientSendServerCustomTargets final
{
public:
	struct FAuTargetData                          ClientResult;                                      // 0x0000(0x0078)(ConstParm, Parm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuTargetRequest                       RequestHandle;                                     // 0x0078(0x0014)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValid;                                            // 0x008C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAbilityTargetingComponent_ClientSendServerCustomTargets;

// Function AuAbilities.AuAbilityTargetingComponent.ClientSendServerTargets
// 0x0090 (0x0090 - 0x0000)
struct AuAbilityTargetingComponent_ClientSendServerTargets final
{
public:
	struct FAuTargetData                          ClientResult;                                      // 0x0000(0x0078)(ConstParm, Parm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuTargetRequest                       RequestHandle;                                     // 0x0078(0x0014)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAbilityTargetingComponent_ClientSendServerTargets;

// Function AuAbilities.AuAbilityTargetingComponent.IsTargetingActive
// 0x0008 (0x0008 - 0x0000)
struct AuAbilityTargetingComponent_IsTargetingActive final
{
public:
	struct FAuTickTargetingHandle                 TargetingType;                                     // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAbilityTargetingComponent_IsTargetingActive;

// Function AuAbilities.AuAbilityTargetingComponent.RequestActivateTrace
// 0x0004 (0x0004 - 0x0000)
struct AuAbilityTargetingComponent_RequestActivateTrace final
{
public:
	struct FAuTickTargetingHandle                 TargetingType;                                     // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityTargetingComponent_RequestActivateTrace;

// Function AuAbilities.AuAbilityTargetingComponent.RequestDeactivateTrace
// 0x0004 (0x0004 - 0x0000)
struct AuAbilityTargetingComponent_RequestDeactivateTrace final
{
public:
	struct FAuTickTargetingHandle                 TargetingType;                                     // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityTargetingComponent_RequestDeactivateTrace;

// Function AuAbilities.AuAbilityTargetingComponent.ServerRequestCustomTargets
// 0x00A8 (0x00A8 - 0x0000)
struct AuAbilityTargetingComponent_ServerRequestCustomTargets final
{
public:
	struct FAuTargetData                          ClientResult;                                      // 0x0000(0x0078)(ConstParm, Parm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuCustomTargetHandle                  InHandle;                                          // 0x0078(0x0001)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuTargetRequest                       RequestHandle;                                     // 0x007C(0x0014)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuCustomTraceDataHandle               CustomData;                                        // 0x0090(0x0018)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityTargetingComponent_ServerRequestCustomTargets;

// Function AuAbilities.AuAbilityTargetingComponent.ServerRequestCustomTargetsBatchSend
// 0x00A8 (0x00A8 - 0x0000)
struct AuAbilityTargetingComponent_ServerRequestCustomTargetsBatchSend final
{
public:
	struct FAuRequestCustomTargetsRPCBatch        InBatch;                                           // 0x0000(0x00A8)(ConstParm, Parm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityTargetingComponent_ServerRequestCustomTargetsBatchSend;

// Function AuAbilities.AuAbilityTargetingComponent.ServerRequestServerTargets
// 0x0090 (0x0090 - 0x0000)
struct AuAbilityTargetingComponent_ServerRequestServerTargets final
{
public:
	struct FAuTargetData                          ClientResult;                                      // 0x0000(0x0078)(ConstParm, Parm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuTargetRequest                       RequestHandle;                                     // 0x0078(0x0014)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuAbilityTargetingComponent_ServerRequestServerTargets;

// Function AuAbilities.AuAbilityTargetingComponent.ServerUpdateCamera
// 0x0030 (0x0030 - 0x0000)
struct AuAbilityTargetingComponent_ServerUpdateCamera final
{
public:
	struct FVector                                Locatiom;                                          // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityTargetingComponent_ServerUpdateCamera;

// Function AuAbilities.AuAbilityTargetingComponent.FilterHitResult
// 0x0030 (0x0030 - 0x0000)
struct AuAbilityTargetingComponent_FilterHitResult final
{
public:
	struct FAuGameplayTargetDataFilterHandle      Filter;                                            // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	struct FAuTickTargetingHandle                 TargetingType;                                     // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityTargetingComponent_FilterHitResult;

// Function AuAbilities.AuAbilityTargetingComponent.FilterTargetData
// 0x0048 (0x0048 - 0x0000)
struct AuAbilityTargetingComponent_FilterTargetData final
{
public:
	struct FAuGameplayTargetDataFilterHandle      Filter;                                            // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	struct FAuTickTargetingHandle                 TargetingType;                                     // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       ReturnValue;                                       // 0x0020(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityTargetingComponent_FilterTargetData;

// Function AuAbilities.AuAbilityTargetingComponent.GetTargetData
// 0x0080 (0x0080 - 0x0000)
struct AuAbilityTargetingComponent_GetTargetData final
{
public:
	struct FAuTickTargetingHandle                 TargetingType;                                     // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuTargetData                          ReturnValue;                                       // 0x0008(0x0078)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityTargetingComponent_GetTargetData;

// Function AuAbilities.AuAbilityTargetingComponent.GetTargetDataHandles
// 0x0030 (0x0030 - 0x0000)
struct AuAbilityTargetingComponent_GetTargetDataHandles final
{
public:
	struct FAuTickTargetingHandle                 TargetingType;                                     // 0x0000(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAbilityTargetingComponent_GetTargetDataHandles;

// Function AuAbilities.AuGameplayAbility.AddItemOnSlot
// 0x0038 (0x0038 - 0x0000)
struct AuGameplayAbility_AddItemOnSlot final
{
public:
	struct FAuItemSlot                            InSlot;                                            // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAuItemData>                InItem;                                            // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_AddItemOnSlot;

// Function AuAbilities.AuGameplayAbility.ApplyAllEffectsFromItem
// 0x0090 (0x0090 - 0x0000)
struct AuGameplayAbility_ApplyAllEffectsFromItem final
{
public:
	struct FAuTargetData                          InHitResults;                                      // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOwnerItem;                                     // 0x0078(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    ReturnValue;                                       // 0x0080(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_ApplyAllEffectsFromItem;

// Function AuAbilities.AuGameplayAbility.ApplyEffectsFromItem
// 0x0098 (0x0098 - 0x0000)
struct AuGameplayAbility_ApplyEffectsFromItem final
{
public:
	struct FGameplayTag                           EffectTag;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuTargetData                          InHitResults;                                      // 0x0008(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOwnerItem;                                     // 0x0080(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    ReturnValue;                                       // 0x0088(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_ApplyEffectsFromItem;

// Function AuAbilities.AuGameplayAbility.BP_OnAvatarSet
// 0x0138 (0x0138 - 0x0000)
struct AuGameplayAbility_BP_OnAvatarSet final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpec                   Spec;                                              // 0x0048(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_BP_OnAvatarSet;

// Function AuAbilities.AuGameplayAbility.BP_OnGiveAbility
// 0x0138 (0x0138 - 0x0000)
struct AuGameplayAbility_BP_OnGiveAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpec                   Spec;                                              // 0x0048(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_BP_OnGiveAbility;

// Function AuAbilities.AuGameplayAbility.BP_OnRemoveAbility
// 0x00F0 (0x00F0 - 0x0000)
struct AuGameplayAbility_BP_OnRemoveAbility final
{
public:
	struct FGameplayAbilitySpec                   AbilitySpec;                                       // 0x0000(0x00F0)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_BP_OnRemoveAbility;

// Function AuAbilities.AuGameplayAbility.DestroyTargetActor
// 0x0010 (0x0010 - 0x0000)
struct AuGameplayAbility_DestroyTargetActor final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNetForce;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuGameplayAbility_DestroyTargetActor;

// Function AuAbilities.AuGameplayAbility.GetAuActorInfo
// 0x0058 (0x0058 - 0x0000)
struct AuGameplayAbility_GetAuActorInfo final
{
public:
	struct FAuGameplayAbilityActorInfo            ReturnValue;                                       // 0x0000(0x0058)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_GetAuActorInfo;

// Function AuAbilities.AuGameplayAbility.GetGrantedEffectHandle
// 0x0008 (0x0008 - 0x0000)
struct AuGameplayAbility_GetGrantedEffectHandle final
{
public:
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_GetGrantedEffectHandle;

// Function AuAbilities.AuGameplayAbility.OnClientTraceResult
// 0x0090 (0x0090 - 0x0000)
struct AuGameplayAbility_OnClientTraceResult final
{
public:
	struct FAuTargetData                          OutHits;                                           // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FHitResult>                     RawHits;                                           // 0x0078(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bServerConfirmed;                                  // 0x0088(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuGameplayAbility_OnClientTraceResult;

// Function AuAbilities.AuGameplayAbility.OnServerTraceResult
// 0x0090 (0x0090 - 0x0000)
struct AuGameplayAbility_OnServerTraceResult final
{
public:
	struct FAuTargetData                          OutHits;                                           // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FHitResult>                     RawHits;                                           // 0x0078(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bServerConfirmed;                                  // 0x0088(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuGameplayAbility_OnServerTraceResult;

// Function AuAbilities.AuGameplayAbility.RemoveSingleOwnedItem
// 0x0001 (0x0001 - 0x0000)
struct AuGameplayAbility_RemoveSingleOwnedItem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_RemoveSingleOwnedItem;

// Function AuAbilities.AuGameplayAbility.SetAttributeValueOnItem
// 0x0048 (0x0048 - 0x0000)
struct AuGameplayAbility_SetAttributeValueOnItem final
{
public:
	struct FAuGameplayAttribute                   Attribute;                                         // 0x0000(0x0040)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewValue;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuGameplayAbility_SetAttributeValueOnItem;

// Function AuAbilities.AuGameplayAbility.SetByCallerMagnitude
// 0x0014 (0x0014 - 0x0000)
struct AuGameplayAbility_SetByCallerMagnitude final
{
public:
	struct FGameplayTag                           DataTag;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EffectTag;                                         // 0x000C(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_SetByCallerMagnitude;

// Function AuAbilities.AuGameplayAbility.SetEffectDuration
// 0x0014 (0x0014 - 0x0000)
struct AuGameplayAbility_SetEffectDuration final
{
public:
	struct FGameplayTag                           DataTag;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EffectTag;                                         // 0x000C(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_SetEffectDuration;

// Function AuAbilities.AuGameplayAbility.SetEffectPeriod
// 0x0014 (0x0014 - 0x0000)
struct AuGameplayAbility_SetEffectPeriod final
{
public:
	struct FGameplayTag                           DataTag;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Period;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EffectTag;                                         // 0x000C(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_SetEffectPeriod;

// Function AuAbilities.AuGameplayAbility.StartCustomTargetTrace
// 0x0040 (0x0040 - 0x0000)
struct AuGameplayAbility_StartCustomTargetTrace final
{
public:
	struct FAuCustomTraceDataHandle               InCustomData;                                      // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	struct FAuGameplayTargetDataFilterHandle      InFilter;                                          // 0x0018(0x0018)(Parm, NativeAccessSpecifierPublic)
	struct FAuCustomTargetHandle                  InHandle;                                          // 0x0030(0x0001)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InbDrawDebug;                                      // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuTraceDebugParams                    InDebugParams;                                     // 0x0034(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          InbDrawServerDebug;                                // 0x003C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuGameplayAbility_StartCustomTargetTrace;

// Function AuAbilities.AuGameplayAbility.GetAbilityAttribute
// 0x0068 (0x0068 - 0x0000)
struct AuGameplayAbility_GetAbilityAttribute final
{
public:
	struct FAuGameplayAttribute                   Attribute;                                         // 0x0000(0x0040)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  InReqTags;                                         // 0x0040(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0060(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuGameplayAbility_GetAbilityAttribute;

// Function AuAbilities.AuGameplayAbility.GetAbilityItemAttribute
// 0x0048 (0x0048 - 0x0000)
struct AuGameplayAbility_GetAbilityItemAttribute final
{
public:
	struct FAuGameplayAttribute                   Attribute;                                         // 0x0000(0x0040)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuGameplayAbility_GetAbilityItemAttribute;

// Function AuAbilities.AuGameplayAbility.GetAnimationPlayRate
// 0x0004 (0x0004 - 0x0000)
struct AuGameplayAbility_GetAnimationPlayRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_GetAnimationPlayRate;

// Function AuAbilities.AuGameplayAbility.GetAttributeValueFromItem
// 0x0048 (0x0048 - 0x0000)
struct AuGameplayAbility_GetAttributeValueFromItem final
{
public:
	struct FAuGameplayAttribute                   Attribute;                                         // 0x0000(0x0040)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuGameplayAbility_GetAttributeValueFromItem;

// Function AuAbilities.AuGameplayAbility.GetEffectSpecFromItem
// 0x0018 (0x0018 - 0x0000)
struct AuGameplayAbility_GetEffectSpecFromItem final
{
public:
	struct FGameplayTag                           EffectTag;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayEffectSpecHandle>      ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_GetEffectSpecFromItem;

// Function AuAbilities.AuGameplayAbility.GetItemsComponent
// 0x0010 (0x0010 - 0x0000)
struct AuGameplayAbility_GetItemsComponent final
{
public:
	TSubclassOf<class UAuItemsComponent>          IC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemsComponent*                      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayAbility_GetItemsComponent;

// Function AuAbilities.AuGameplayAbility.GetItemStat
// 0x0048 (0x0048 - 0x0000)
struct AuGameplayAbility_GetItemStat final
{
public:
