#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuActorPlacement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ChimeraMassCommon_structs.hpp"
#include "MassSpawner_structs.hpp"


namespace SDK
{

// Enum AuActorPlacement.EPlacementSoundType
// NumValues: 0x000A
enum class EPlacementSoundType : uint8
{
	Universal                                = 0,
	PlaceSuccess                             = 1,
	PlaceFail                                = 2,
	Snap                                     = 3,
	TilesMultiply                            = 4,
	RailConnect1                             = 5,
	RailConnect2                             = 6,
	Deconstruct                              = 7,
	None                                     = 8,
	EPlacementSoundType_MAX                  = 9,
};

// Enum AuActorPlacement.ECrBuildingID
// NumValues: 0x00CF
enum class ECrBuildingID : uint8
{
	NONE                                     = 0,
	AcidExtractor                            = 1,
	Airlock                                  = 2,
	Analyzer                                 = 3,
	AnchoredPlatform                         = 4,
	Antena                                   = 5,
	Armory                                   = 6,
	Assembler                                = 7,
	BaseCore                                 = 8,
	BasePlatform                             = 9,
	BasicExporter                            = 10,
	CloningBed                               = 11,
	CombustionPowerGenerator                 = 12,
	ConnectingPlatform                       = 13,
	Connector                                = 14,
	CoolerActive                             = 15,
	CoolerPassive                            = 16,
	CorporationsTerminal                     = 17,
	Crafter                                  = 18,
	Decoy                                    = 19,
	DroneJunction                            = 20,
	DroneRail                                = 21,
	DroneStation                             = 22,
	Factory                                  = 23,
	FoodProcessor                            = 24,
	Forge                                    = 25,
	Furnace                                  = 26,
	GasExtractor                             = 27,
	HabitatSmall                             = 28,
	HabitatBig                               = 29,
	Hammer                                   = 30,
	HorizontalBridge                         = 31,
	HorizontalBridgeConnector                = 32,
	HorizontalBridgeSegment                  = 33,
	Hub                                      = 34,
	InteriorPowerGenerator                   = 35,
	ItemPrinter                              = 36,
	Ladder                                   = 37,
	LaserDrill                               = 38,
	LiquidExtractor                          = 39,
	MechanicalDrill                          = 40,
	MilitaryAssembler                        = 41,
	PackageReceiver                          = 42,
	PackageSender                            = 43,
	PersonalStorage                          = 44,
	PersonalStorageBig                       = 45,
	PillarSupport                            = 46,
	Railing                                  = 47,
	Recycler                                 = 48,
	Refinery                                 = 49,
	ResearchTerminal                         = 50,
	Smelter                                  = 51,
	SolarPowerGenerator                      = 52,
	Stairs                                   = 53,
	StairsFlat                               = 54,
	StorageDepot                             = 55,
	SuitWorkshop                             = 56,
	SulfurExtractor                          = 57,
	Synthetizer                              = 58,
	Teleporter                               = 59,
	TurretTier1                              = 60,
	TurretTier2                              = 61,
	VerticalBridge                           = 62,
	Viewport                                 = 63,
	Walkway                                  = 64,
	WaterExtractor                           = 65,
	WindPowerGenerator                       = 66,
	Zipline                                  = 67,
	DronePole                                = 68,
	DroneRailSupport                         = 69,
	CoolerActiveFoundation                   = 70,
	CoolerActiveTiles                        = 71,
	DroneAssembler                           = 72,
	DroneJunction3Way                        = 73,
	DroneRoundabout                          = 74,
	DroneRail1                               = 75,
	DroneRail2                               = 76,
	DroneRail3                               = 77,
	DroneRailDirectional1                    = 78,
	DroneRailDirectional2                    = 79,
	DroneRailDirectional3                    = 80,
	AmmoCrafter                              = 81,
	EntryTerminal                            = 82,
	EngineControlStation                     = 83,
	StartingFoodProcessor                    = 84,
	StartingItemPrinter                      = 85,
	AlgaeTank                                = 86,
	CloningBedNonDeconstructible             = 87,
	Chair                                    = 88,
	Pedestal                                 = 89,
	Table                                    = 90,
	Decorator                                = 91,
	ForgottenMachineFoodProcessor            = 92,
	EngineControlStationItemPrinter          = 93,
	MapTerminal                              = 94,
	PlantGrower                              = 95,
	ProteinPrinter                           = 96,
	StorageChestBig                          = 97,
	WallStorage                              = 98,
	WallStorageBig                           = 99,
	LiquidExtractorFoundation                = 100,
	MassCollector                            = 101,
	MechanicalDrillFoundation                = 102,
	Foundation10x6                           = 103,
	Tiles10x6                                = 104,
	Foundation1x1                            = 105,
	Tiles1x1                                 = 106,
	Foundation2x2                            = 107,
	Tiles2x2                                 = 108,
	Foundation3x3                            = 109,
	Tiles3x3                                 = 110,
	Foundation4x3                            = 111,
	Tiles4x3                                 = 112,
	Foundation4x4                            = 113,
	Tiles4x4                                 = 114,
	Foundation5x6                            = 115,
	Tiles5x6                                 = 116,
	Foundation6x3                            = 117,
	Tiles6x3                                 = 118,
	Foundation6x6                            = 119,
	Tiles6x6                                 = 120,
	Foundation7x7                            = 121,
	Tiles7x7                                 = 122,
	Foundation8x7                            = 123,
	Tiles8x7                                 = 124,
	Foundation9x12                           = 125,
	Tiles9x12                                = 126,
	Foundation9x6                            = 127,
	Tiles9x5                                 = 128,
	Foundation9x7                            = 129,
	Tiles9x7                                 = 130,
	Foundation9x9                            = 131,
	Tiles9x9                                 = 132,
	SealingDoor                              = 133,
	SideLadder                               = 134,
	ViewportLeft                             = 135,
	ViewportMiddle                           = 136,
	ViewportRight                            = 137,
	ViewportSingle                           = 138,
	MagneticLift                             = 139,
	PillarSupportTriangular                  = 140,
	Pole                                     = 141,
	StairsBarrierL                           = 142,
	StairsBarrierR                           = 143,
	RailingTriangular                        = 144,
	SafetyBarrierDiagonal                    = 145,
	ConnectingPlatformTriangular             = 146,
	RailingWalkway                           = 147,
	PressurePowerGenerator                   = 148,
	ChemicalProcessor                        = 149,
	ChimeranPowerGenerator                   = 150,
	CultivationCenter                        = 151,
	DeuteriumExtractor                       = 152,
	GreenHouse                               = 153,
	MiniExporter                             = 154,
	ParticleCatcher                          = 155,
	Radar                                    = 156,
	WaveFreezer                              = 157,
	WaveSmelter                              = 158,
	ResearchLab                              = 159,
	WaterExtractorFoundation                 = 160,
	DroneFastJunction                        = 161,
	DroneFastJunction3Way                    = 162,
	DroneFastJunction3Way_2x2                = 163,
	DroneFastJunction_2x2                    = 164,
	DroneFastRoundabout                      = 165,
	DroneFastRoundabout_2x2                  = 166,
	DroneJunction3Way_2x2                    = 167,
	DroneJunction4Way                        = 168,
	DroneJunction4Way_2x2                    = 169,
	DroneJunction_2x2                        = 170,
	DroneJunction_3Lanes                     = 171,
	DroneJunction_5Lanes                     = 172,
	DroneJunctionBox                         = 173,
	DroneJunctionBox_2x2                     = 174,
	DroneJunctionBoxLayer                    = 175,
	DroneMerger_3To1                         = 176,
	DroneMerger_5To1                         = 177,
	DroneRoundabout_2x2                      = 178,
	DroneSuperFastJunction                   = 179,
	DroneSuperFastJunction3Way               = 180,
	DroneSuperFastJunction3Way_2x2           = 181,
	DroneSuperFastJunction_2x2               = 182,
	DroneSuperFastRoundabout                 = 183,
	DroneSuperFastRoundabout_2x2             = 184,
	CrafterTwoWay                            = 185,
	FurnaceTwoWay                            = 186,
	HammerTwoWay                             = 187,
	MilitaryAssemblerTwoWay                  = 188,
	RefineryTwoWay                           = 189,
	ResearchLabTwoWay                        = 190,
	SmelterTwoWay                            = 191,
	SynthetizerTwoWay                        = 192,
	Furnace_SixWay                           = 193,
	CoolerPassiveFound                       = 194,
	Exporter                                 = 195,
	CoolerPassiveTiles                       = 196,
	ResourceRedistributor                    = 197,
	SolarPowerGen2                           = 198,
	UniversalStorage                         = 199,
	Storage                                  = 200,
	WindPowerG2                              = 201,
	CloningBedLander                         = 202,
	BasePlatformStability                    = 203,
	ConnectingPlatformStability              = 204,
	_COUNT                                   = 205,
	ECrBuildingID_MAX                        = 206,
};

// Enum AuActorPlacement.ECrDirection
// NumValues: 0x0005
enum class ECrDirection : uint8
{
	Forward                                  = 0,
	Backward                                 = 1,
	Left                                     = 2,
	Right                                    = 3,
	ECrDirection_MAX                         = 4,
};

// Enum AuActorPlacement.EAuAPPlacementResult
// NumValues: 0x0009
enum class EAuAPPlacementResult : uint8
{
	Success                                  = 0,
	Cancel                                   = 1,
	MultiConfirm                             = 2,
	Custom                                   = 3,
	CollisionReject                          = 4,
	NotInPlacementMode                       = 5,
	InvalidPlacementData                     = 6,
	CustomConditionReject                    = 7,
	EAuAPPlacementResult_MAX                 = 8,
};

// Enum AuActorPlacement.EAuAPlacementConditionResult
// NumValues: 0x002D
enum class EAuAPlacementConditionResult : uint8
{
	NONE                                     = 0,
	InValid                                  = 1,
	Valid                                    = 2,
	NotInSocket                              = 3,
	SocketUsed                               = 4,
	Unstable                                 = 5,
	NotTouchingTerrain                       = 6,
	WrongSurface                             = 7,
	WrongFoundation                          = 8,
	TooLongDynamic                           = 9,
	SplineTooLong                            = 10,
	SplineTooSteep                           = 11,
	ExpectedInteriorWall                     = 12,
	NoAllSocketsAreAttached                  = 13,
	LogisticsAlreadyConnected                = 14,
	LogisticsWrongTypes                      = 15,
	LogisticsConnectionLimit                 = 16,
	LogisticsInvalidConnectionBetweenGraphs  = 17,
	StarlightObstructed                      = 18,
	ZiplineTooClose                          = 19,
	BaseCoreOverheatAndOverload              = 20,
	OutsideBaseCoreArea                      = 21,
	InsideInfectedBaseCoreArea               = 22,
	InsideBaseCoreArea                       = 23,
	InsideExcludedArea                       = 24,
	RequireHabitat                           = 25,
	RequirePlatformConnecting                = 26,
	Dirty                                    = 27,
	TooFar                                   = 28,
	NoResources                              = 29,
	UnderWater                               = 30,
	UnderTerrain                             = 31,
	FoundationsUnderTerrain                  = 32,
	CantBuildOnFoundations                   = 33,
	PlayerColliding                          = 34,
	DroneColliding                           = 35,
	IsTemporaryColliding                     = 36,
	IsColliding                              = 37,
	FoundationColliding                      = 38,
	BuildingColliding                        = 39,
	SulphurColliding                         = 40,
	AggressivePlantColliding                 = 41,
	DecoPlantColliding                       = 42,
	OnOil                                    = 43,
	EAuAPlacementConditionResult_MAX         = 44,
};

// Enum AuActorPlacement.EAuAPlacementPointsRespectingSurface
// NumValues: 0x0008
enum class EAuAPlacementPointsRespectingSurface : uint8
{
	None                                     = 0,
	First                                    = 1,
	Last                                     = 2,
	FirstAndLast                             = 3,
	WithoutFirstAndLast                      = 4,
	Range                                    = 5,
	RangeWithoutFirst                        = 6,
	EAuAPlacementPointsRespectingSurface_MAX = 7,
};

// ScriptStruct AuActorPlacement.AuActorPlacementComponentTickFunction
// 0x0008 (0x0030 - 0x0028)
struct FAuActorPlacementComponentTickFunction final : public FTickFunction
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuActorPlacementComponentTickFunction;

// ScriptStruct AuActorPlacement.ActorPlacementSounds
// 0x0010 (0x0010 - 0x0000)
struct FActorPlacementSounds final
{
public:
	class USoundBase*                             FppSound;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class USoundBase*                             TppSound;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FActorPlacementSounds;

// ScriptStruct AuActorPlacement.AuPlacementLocationResultData
// 0x0030 (0x0030 - 0x0000)
struct FAuPlacementLocationResultData final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          VerticalSnap;                                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshSocket*                      Socket;                                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FAuPlacementLocationResultData;

// ScriptStruct AuActorPlacement.PlacementSnapSocketsData
// 0x0040 (0x0040 - 0x0000)
struct FPlacementSnapSocketsData final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UStaticMeshComponent*                   HitActorSMC;                                       // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UStaticMeshSocket*                      HitActorSocket;                                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UStaticMeshSocket*                      HelperSocket;                                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FStaticMeshConnnection                 SMConnection;                                      // 0x0020(0x0018)(NativeAccessSpecifierPublic)
	int32                                         HelperSocketIndex;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPlacementSnapSocketsData;

// ScriptStruct AuActorPlacement.AuAPMassSpawnedEntityType
// 0x0038 (0x0038 - 0x0000)
struct FAuAPMassSpawnedEntityType final
{
public:
	TSoftObjectPtr<class UMassEntityConfigAsset>  EntityConfig;                                      // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Proportion;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassEntityConfigAsset*                 EntityConfigPtr;                                   // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
};
DUMPER7_ASSERTS_FAuAPMassSpawnedEntityType;

// ScriptStruct AuActorPlacement.AuAPConfirmPointData
// 0x0148 (0x0148 - 0x0000)
struct FAuAPConfirmPointData final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FinalLocation;                                     // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               FinalRotation;                                     // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FHitResult                             RawHit;                                            // 0x0038(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   SocketMesh;                                        // 0x0138(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UStaticMeshSocket*                      Socket;                                            // 0x0140(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FAuAPConfirmPointData;

// ScriptStruct AuActorPlacement.AuActorPlacementSingleSocketData
// 0x0070 (0x0070 - 0x0000)
struct FAuActorPlacementSingleSocketData final
{
public:
	uint8                                         Index;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PlaneAxis;                                         // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuActorPlacementSocketData*            Type;                                              // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         AcceptableAngle;                                   // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsActive;                                         // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockActivate;                                    // 0x005D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxUseCount;                                       // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UseCount;                                          // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SocketOwner;                                       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FAuActorPlacementSingleSocketData;

// ScriptStruct AuActorPlacement.AuAPGridSettings
// 0x0080 (0x0080 - 0x0000)
struct alignas(0x10) FAuAPGridSettings final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          IsSnappingActive;                                  // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          GridXAxis;                                         // 0x0061(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          GridYAxis;                                         // 0x0062(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          GridZAxis;                                         // 0x0063(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GridUnit;                                          // 0x0068(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuAPGridSettings;

// ScriptStruct AuActorPlacement.AuAPRotationSnappingSettings
// 0x0020 (0x0020 - 0x0000)
struct FAuAPRotationSnappingSettings final
{
public:
	bool                                          IsSnappingActive;                                  // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Roll;                                              // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Pitch;                                             // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Yaw;                                               // 0x0003(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RotUnit;                                           // 0x0008(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuAPRotationSnappingSettings;

// ScriptStruct AuActorPlacement.AuAPSurfaceAngleConditions
// 0x0020 (0x0020 - 0x0000)
struct FAuAPSurfaceAngleConditions final
{
public:
	struct FVector                                MainAxis;                                          // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AcceptableAngleDelta;                              // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuAPSurfaceAngleConditions;

// ScriptStruct AuActorPlacement.AuAPOffsetSettings
// 0x0020 (0x0020 - 0x0000)
struct FAuAPOffsetSettings final
{
public:
	struct FVector                                AvaiableOffset;                                    // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInWorldSpace;                                     // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuAPOffsetSettings;

// ScriptStruct AuActorPlacement.AuAPSocketParams
// 0x0040 (0x0040 - 0x0000)
struct FAuAPSocketParams final
{
public:
	TArray<class UAuActorPlacementSocketData*>    CompatibleSockets;                                 // 0x0000(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bSnapToSocketWholeObject;                          // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSnapToSocketNormalPlane;                          // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SnapOffset;                                        // 0x0018(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotateToSocketForward;                            // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyInSocketPlane;                                // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberOfPointUsingSockets;                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AcceptableAngle;                                   // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuAPSocketParams;

// ScriptStruct AuActorPlacement.AuAPHelperParams
// 0x0020 (0x0020 - 0x0000)
struct FAuAPHelperParams final
{
public:
	TSubclassOf<class AAuAPHelperActor>           CustomHelperClass;                                 // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            CustomHelperMesh;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UMaterialInstance*                      CustomHelperAcceptMaterial;                        // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UMaterialInstance*                      CustomHelperDenyMaterial;                          // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FAuAPHelperParams;

// ScriptStruct AuActorPlacement.AuAPPayloadData
// 0x0060 (0x0060 - 0x0000)
struct FAuAPPayloadData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAuActorPlacementData>   PlacementData;                                     // 0x0008(0x0028)(SaveGame, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCrReplicatedSoftObjectPtr             ReplPlacementData;                                 // 0x0030(0x0030)(Transient, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FAuAPPayloadData;

// ScriptStruct AuActorPlacement.AuAPSplinePointData
// 0x0040 (0x0040 - 0x0000)
struct FAuAPSplinePointData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         Index;                                             // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector_NetQuantize                    Position;                                          // 0x0010(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize10                  Tangent;                                           // 0x0028(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuAPSplinePointData;

// ScriptStruct AuActorPlacement.AuAPSplineData
// 0x0050 (0x0050 - 0x0000)
struct FAuAPSplineData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAuAPSplinePointData>           SplineData;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize                    SplineLocationWS;                                  // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               SplineRotationWS;                                  // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SplineRealLength;                                  // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuAPSplineData;

// ScriptStruct AuActorPlacement.AuAPSplineActorPayloadData
// 0x0080 (0x00E0 - 0x0060)
struct FAuAPSplineActorPayloadData final : public FAuAPPayloadData
{
public:
	struct FAuAPSplineData                        Data;                                              // 0x0060(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FCrMassEntityReplicationHelper         Start;                                             // 0x00B0(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCrMassEntityReplicationHelper         End;                                               // 0x00C8(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuAPSplineActorPayloadData;

// ScriptStruct AuActorPlacement.AuAPPayloadDataHandle
// 0x0020 (0x0020 - 0x0000)
struct FAuAPPayloadDataHandle final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          Type;                                              // 0x0010(0x0008)(ZeroConstructor, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Revision;                                          // 0x0018(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuAPPayloadDataHandle;

// ScriptStruct AuActorPlacement.AuHelperStabilityConnection
// 0x0018 (0x0018 - 0x0000)
struct FAuHelperStabilityConnection final
{
public:
	TArray<struct FVector>                        Neighbours;                                        // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Stability;                                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuHelperStabilityConnection;

// ScriptStruct AuActorPlacement.MassFragmentCustomData
// 0x0004 (0x0004 - 0x0000)
struct FMassFragmentCustomData final
{
public:
	float                                         SpawnServerDeltaTime;                              // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMassFragmentCustomData;

// ScriptStruct AuActorPlacement.AuAPMassFragment
// 0x0050 (0x0050 - 0x0000)
struct FAuAPMassFragment final : public FCrMassSavableFragment
{
public:
	struct FAuAPPayloadDataHandle                 Payload;                                           // 0x0000(0x0020)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FMassFragmentCustomData                CustomData;                                        // 0x0020(0x0004)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEntityTemplateID                  TemplateID;                                        // 0x0028(0x0020)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MainMeshZOffset;                                   // 0x0048(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpawnServerTimeSeconds;                            // 0x004C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FAuAPMassFragment;

// ScriptStruct AuActorPlacement.AuSplineConnectionFragment
// 0x00E0 (0x00E0 - 0x0000)
struct FAuSplineConnectionFragment final : public FCrMassSavableFragment
{
public:
	struct FAuAPSplineData                        Data;                                              // 0x0000(0x0050)(SaveGame, NativeAccessSpecifierPublic)
	struct FCrMassPersistentEntityID              StartEntity;                                       // 0x0050(0x0010)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCrMassPersistentEntityID              EndEntity;                                         // 0x0060(0x0010)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSplineCurves                          SplineCurves;                                      // 0x0070(0x0068)(NativeAccessSpecifierPublic)
	bool                                          bSplineCurvesInitialized;                          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuSplineConnectionFragment;

// ScriptStruct AuActorPlacement.AuMassPlacementSpawnData
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x08) FAuMassPlacementSpawnData final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuMassPlacementSpawnData;

}

