#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuCore

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct AuCore.AuDataProvider
// 0x0001 (0x0001 - 0x0000)
struct FAuDataProvider
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuDataProvider;

// ScriptStruct AuCore.AuFloatDataProvider
// 0x0007 (0x0008 - 0x0001)
struct FAuFloatDataProvider final : public FAuDataProvider
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FAuFloatDataProvider;

// ScriptStruct AuCore.AuFloatDataTableProvider
// 0x001F (0x0020 - 0x0001)
struct FAuFloatDataTableProvider final : public FAuDataProvider
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ColumnName;                                        // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             DataSource;                                        // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
};
DUMPER7_ASSERTS_FAuFloatDataTableProvider;

// ScriptStruct AuCore.AuDataProperty
// 0x0028 (0x0028 - 0x0000)
struct FAuDataProperty final
{
public:
	TFieldPath<class FStructProperty>             DataStruct;                                        // 0x0000(0x0020)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStruct*                                DataStructOwner;                                   // 0x0020(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
};
DUMPER7_ASSERTS_FAuDataProperty;

// ScriptStruct AuCore.AuNiagaraSystemFloatParam
// 0x000C (0x000C - 0x0000)
struct FAuNiagaraSystemFloatParam final
{
public:
	class FName                                   ParamName;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuNiagaraSystemFloatParam;

// ScriptStruct AuCore.AuNiagaraSystemProperty
// 0x0018 (0x0018 - 0x0000)
struct FAuNiagaraSystemProperty final
{
public:
	class UNiagaraSystem*                         System;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<struct FAuNiagaraSystemFloatParam>     FloatParams;                                       // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuNiagaraSystemProperty;

// ScriptStruct AuCore.AuSocketName
// 0x0008 (0x0008 - 0x0000)
struct FAuSocketName final
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuSocketName;

}

