#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuItems

#include "Basic.hpp"

#include "AuItems_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AuItems.AuEquipmentItemBarComponent.BP_SelectBar
// 0x0004 (0x0004 - 0x0000)
struct AuEquipmentItemBarComponent_BP_SelectBar final
{
public:
	struct FAuBarID                               BarID;                                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuEquipmentItemBarComponent_BP_SelectBar;

// Function AuItems.AuEquipmentItemBarComponent.OnRep_CurrentBarID
// 0x0004 (0x0004 - 0x0000)
struct AuEquipmentItemBarComponent_OnRep_CurrentBarID final
{
public:
	struct FAuBarID                               OldBar;                                            // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuEquipmentItemBarComponent_OnRep_CurrentBarID;

// Function AuItems.AuEquipmentItemBarComponent.ServerAddItemOnBar
// 0x0020 (0x0020 - 0x0000)
struct AuEquipmentItemBarComponent_ServerAddItemOnBar final
{
public:
	struct FAuBarID                               BarID;                                             // 0x0000(0x0004)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuBarSlotID                           SlotID;                                            // 0x0004(0x0004)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemId                              Item;                                              // 0x0008(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemsComponent*                      FromInventory;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuEquipmentItemBarComponent_ServerAddItemOnBar;

// Function AuItems.AuEquipmentItemBarComponent.ServerSelectBar
// 0x0004 (0x0004 - 0x0000)
struct AuEquipmentItemBarComponent_ServerSelectBar final
{
public:
	struct FAuBarID                               BarID;                                             // 0x0000(0x0004)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuEquipmentItemBarComponent_ServerSelectBar;

// Function AuItems.AuEquipmentItemBarComponent.GetBarsItemSlots
// 0x0010 (0x0010 - 0x0000)
struct AuEquipmentItemBarComponent_GetBarsItemSlots final
{
public:
	TArray<struct FAuItemSlot>                    ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuEquipmentItemBarComponent_GetBarsItemSlots;

// Function AuItems.AuItemDataBase.GetOnUseSound_FPP
// 0x0010 (0x0010 - 0x0000)
struct AuItemDataBase_GetOnUseSound_FPP final
{
public:
	uint8                                         InProfession;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemDataBase_GetOnUseSound_FPP;

// Function AuItems.AuItemDataBase.GetOnUseSound_TPP
// 0x0010 (0x0010 - 0x0000)
struct AuItemDataBase_GetOnUseSound_TPP final
{
public:
	uint8                                         InProfession;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemDataBase_GetOnUseSound_TPP;

// Function AuItems.AuItemPickupBase.AddItem
// 0x0008 (0x0008 - 0x0000)
struct AuItemPickupBase_AddItem final
{
public:
	class UAuItemsComponent*                      Inventory;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemPickupBase_AddItem;

// Function AuItems.AuItemPickupBase.MulticastPlayOnItemPickedEffects
// 0x0008 (0x0008 - 0x0000)
struct AuItemPickupBase_MulticastPlayOnItemPickedEffects final
{
public:
	class AActor*                                 PickingActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemPickupBase_MulticastPlayOnItemPickedEffects;

// Function AuItems.AuItemPickupBase.OnFound
// 0x0008 (0x0008 - 0x0000)
struct AuItemPickupBase_OnFound final
{
public:
	class APlayerController*                      FoundBy;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemPickupBase_OnFound;

// Function AuItems.AuItemPickupBase.OnItemPicked
// 0x0008 (0x0008 - 0x0000)
struct AuItemPickupBase_OnItemPicked final
{
public:
	class AActor*                                 PickingActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemPickupBase_OnItemPicked;

// Function AuItems.AuItemPickupBase.GetGuid
// 0x0010 (0x0010 - 0x0000)
struct AuItemPickupBase_GetGuid final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemPickupBase_GetGuid;

// Function AuItems.AuItemPickupBase.GetItemNames
// 0x0010 (0x0010 - 0x0000)
struct AuItemPickupBase_GetItemNames final
{
public:
	TArray<class FText>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemPickupBase_GetItemNames;

// Function AuItems.AuItemsBPF.EqualId
// 0x0024 (0x0024 - 0x0000)
struct AuItemsBPF_EqualId final
{
public:
	struct FAuItemId                              A;                                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemId                              B;                                                 // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuItemsBPF_EqualId;

// Function AuItems.AuItemsBPF.GetIcon
// 0x0290 (0x0290 - 0x0000)
struct AuItemsBPF_GetIcon final
{
public:
	struct FAuItemEntry                           Item;                                              // 0x0000(0x01D8)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D8[0x8];                                      // 0x01D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ReturnValue;                                       // 0x01E0(0x00B0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsBPF_GetIcon;

// Function AuItems.AuItemsBPF.GetItemName
// 0x01E8 (0x01E8 - 0x0000)
struct AuItemsBPF_GetItemName final
{
public:
	struct FAuItemEntry                           Item;                                              // 0x0000(0x01D8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x01D8(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsBPF_GetItemName;

// Function AuItems.AuItemsBPF.GetTags
// 0x01F8 (0x01F8 - 0x0000)
struct AuItemsBPF_GetTags final
{
public:
	struct FAuItemEntry                           Item;                                              // 0x0000(0x01D8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x01D8(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsBPF_GetTags;

// Function AuItems.AuItemsComponent.GetItemId
// 0x00C0 (0x00C0 - 0x0000)
struct AuItemsComponent_GetItemId final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAuItemId                              ReturnValue;                                       // 0x00B0(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_GetItemId;

// Function AuItems.AuItemsComponent.GetItemOwner
// 0x00B8 (0x00B8 - 0x0000)
struct AuItemsComponent_GetItemOwner final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_GetItemOwner;

// Function AuItems.AuItemsComponent.GetItemType
// 0x00B8 (0x00B8 - 0x0000)
struct AuItemsComponent_GetItemType final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UAuItemDataBase*                  ReturnValue;                                       // 0x00B0(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_GetItemType;

// Function AuItems.AuItemsComponent.BP_AddComponentToItemHandle
// 0x0058 (0x0058 - 0x0000)
struct AuItemsComponent_BP_AddComponentToItemHandle final
{
public:
	struct FAuItemId                              InItem;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            InComponentSlot;                                   // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemComponentData*                   InComponentData;                                   // 0x0040(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemId                              ReturnValue;                                       // 0x0048(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_BP_AddComponentToItemHandle;

// Function AuItems.AuItemsComponent.BP_MoveComponentToItemHandle
// 0x0060 (0x0060 - 0x0000)
struct AuItemsComponent_BP_MoveComponentToItemHandle final
{
public:
	struct FAuItemId                              ModdedItem;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            AuComponentSlot;                                   // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemId                              AuComponentId;                                     // 0x0040(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemsComponent*                      From;                                              // 0x0050(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemove;                                           // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuItemsComponent_BP_MoveComponentToItemHandle;

// Function AuItems.AuItemsComponent.BP_MoveComponentToItems
// 0x0028 (0x0028 - 0x0000)
struct AuItemsComponent_BP_MoveComponentToItems final
{
public:
	struct FAuItemId                              ComponentId;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemId                              FromId;                                            // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemsComponent*                      To;                                                // 0x0020(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_BP_MoveComponentToItems;

// Function AuItems.AuItemsComponent.BP_MoveComponentToItemsFromItem
// 0x0048 (0x0048 - 0x0000)
struct AuItemsComponent_BP_MoveComponentToItemsFromItem final
{
public:
	struct FAuItemId                              InItemId;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            InSlot;                                            // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemsComponent*                      To;                                                // 0x0040(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_BP_MoveComponentToItemsFromItem;

// Function AuItems.AuItemsComponent.BP_MoveItem
// 0x0020 (0x0020 - 0x0000)
struct AuItemsComponent_BP_MoveItem final
{
public:
	struct FAuItemId                              Item;                                              // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemsComponent*                      From;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveFrom;                                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuItemsComponent_BP_MoveItem;

// Function AuItems.AuItemsComponent.BP_MoveItemToSlot
// 0x0050 (0x0050 - 0x0000)
struct AuItemsComponent_BP_MoveItemToSlot final
{
public:
	struct FAuItemSlot                            Slot;                                              // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemId                              Item;                                              // 0x0030(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemsComponent*                      From;                                              // 0x0040(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveFrom;                                       // 0x0048(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuItemsComponent_BP_MoveItemToSlot;

// Function AuItems.AuItemsComponent.BP_RemoveComponentFromItemHandle
// 0x0040 (0x0040 - 0x0000)
struct AuItemsComponent_BP_RemoveComponentFromItemHandle final
{
public:
	struct FAuItemId                              InItem;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            InComponentSlot;                                   // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_BP_RemoveComponentFromItemHandle;

// Function AuItems.AuItemsComponent.BP_SetItemOnSlot
// 0x0040 (0x0040 - 0x0000)
struct AuItemsComponent_BP_SetItemOnSlot final
{
public:
	struct FAuItemId                              Handle;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            TargetSlot;                                        // 0x0010(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_BP_SetItemOnSlot;

// Function AuItems.AuItemsComponent.K2_ServerAddNewItemToSlot
// 0x0040 (0x0040 - 0x0000)
struct AuItemsComponent_K2_ServerAddNewItemToSlot final
{
public:
	const class UAuItemData*                      NewItem;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            Slot;                                              // 0x0008(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveIfExists;                                   // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuItemsComponent_K2_ServerAddNewItemToSlot;

// Function AuItems.AuItemsComponent.MulticastResetSlot
// 0x0030 (0x0030 - 0x0000)
struct AuItemsComponent_MulticastResetSlot final
{
public:
	struct FAuItemSlot                            SlotToReset;                                       // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_MulticastResetSlot;

// Function AuItems.AuItemsComponent.ServerAddComponentToItemHandle
// 0x0048 (0x0048 - 0x0000)
struct AuItemsComponent_ServerAddComponentToItemHandle final
{
public:
	struct FAuItemId                              InItem;                                            // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            InComponentSlot;                                   // 0x0010(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemComponentData*                   InComponentData;                                   // 0x0040(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_ServerAddComponentToItemHandle;

// Function AuItems.AuItemsComponent.ServerAddNewItemBatch
// 0x0010 (0x0010 - 0x0000)
struct AuItemsComponent_ServerAddNewItemBatch final
{
public:
	TArray<struct FAuSimpleItem>                  ItemBatch;                                         // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_ServerAddNewItemBatch;

// Function AuItems.AuItemsComponent.ServerDestroyItem
// 0x0010 (0x0010 - 0x0000)
struct AuItemsComponent_ServerDestroyItem final
{
public:
	struct FAuItemId                              Item;                                              // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_ServerDestroyItem;

// Function AuItems.AuItemsComponent.ServerDropItem
// 0x0018 (0x0018 - 0x0000)
struct AuItemsComponent_ServerDropItem final
{
public:
	struct FAuItemId                              InItemId;                                          // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemove;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_ServerDropItem;

// Function AuItems.AuItemsComponent.ServerMergeStack
// 0x0024 (0x0024 - 0x0000)
struct AuItemsComponent_ServerMergeStack final
{
public:
	struct FAuItemId                              FromItemId;                                        // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemId                              ToItemId;                                          // 0x0010(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Amount;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_ServerMergeStack;

// Function AuItems.AuItemsComponent.ServerMoveBetweenSlots
// 0x0060 (0x0060 - 0x0000)
struct AuItemsComponent_ServerMoveBetweenSlots final
{
public:
	struct FAuItemSlot                            Slot;                                              // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            FromSlot;                                          // 0x0030(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_ServerMoveBetweenSlots;

// Function AuItems.AuItemsComponent.ServerMoveComponentToItemHandle
// 0x0060 (0x0060 - 0x0000)
struct AuItemsComponent_ServerMoveComponentToItemHandle final
{
public:
	struct FAuItemId                              ModdedItem;                                        // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            AuComponentSlot;                                   // 0x0010(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemId                              AuComponentId;                                     // 0x0040(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemsComponent*                      From;                                              // 0x0050(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemove;                                           // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuItemsComponent_ServerMoveComponentToItemHandle;

// Function AuItems.AuItemsComponent.ServerMoveComponentToItems
// 0x0028 (0x0028 - 0x0000)
struct AuItemsComponent_ServerMoveComponentToItems final
{
public:
	struct FAuItemId                              ComponentId;                                       // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemId                              FromId;                                            // 0x0010(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemsComponent*                      To;                                                // 0x0020(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_ServerMoveComponentToItems;

// Function AuItems.AuItemsComponent.ServerMoveComponentToItemsFromItem
// 0x0048 (0x0048 - 0x0000)
struct AuItemsComponent_ServerMoveComponentToItemsFromItem final
{
public:
	struct FAuItemId                              InItemId;                                          // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            InSlot;                                            // 0x0010(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemsComponent*                      To;                                                // 0x0040(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_ServerMoveComponentToItemsFromItem;

// Function AuItems.AuItemsComponent.ServerMoveItem
// 0x0020 (0x0020 - 0x0000)
struct AuItemsComponent_ServerMoveItem final
{
public:
	struct FAuItemId                              Handle;                                            // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemsComponent*                      From;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveFrom;                                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuItemsComponent_ServerMoveItem;

// Function AuItems.AuItemsComponent.ServerMoveItemToSlot
// 0x0050 (0x0050 - 0x0000)
struct AuItemsComponent_ServerMoveItemToSlot final
{
public:
	struct FAuItemSlot                            Slot;                                              // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemId                              Handle;                                            // 0x0030(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemsComponent*                      From;                                              // 0x0040(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveFrom;                                       // 0x0048(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuItemsComponent_ServerMoveItemToSlot;

// Function AuItems.AuItemsComponent.ServerRemoveComponentFromItemHandle
// 0x0040 (0x0040 - 0x0000)
struct AuItemsComponent_ServerRemoveComponentFromItemHandle final
{
public:
	struct FAuItemId                              InItem;                                            // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            InComponentSlot;                                   // 0x0010(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_ServerRemoveComponentFromItemHandle;

// Function AuItems.AuItemsComponent.ServerRemoveItem
// 0x0018 (0x0018 - 0x0000)
struct AuItemsComponent_ServerRemoveItem final
{
public:
	struct FAuItemId                              Item;                                              // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveFromStore;                                  // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuItemsComponent_ServerRemoveItem;

// Function AuItems.AuItemsComponent.ServerRemoveItemByType
// 0x0010 (0x0010 - 0x0000)
struct AuItemsComponent_ServerRemoveItemByType final
{
public:
	const class UAuItemDataBase*                  InItem;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveFromStore;                                  // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuItemsComponent_ServerRemoveItemByType;

// Function AuItems.AuItemsComponent.ServerSetItemOnSlot
// 0x0040 (0x0040 - 0x0000)
struct AuItemsComponent_ServerSetItemOnSlot final
{
public:
	struct FAuItemId                              Handle;                                            // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            TargetSlot;                                        // 0x0010(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_ServerSetItemOnSlot;

// Function AuItems.AuItemsComponent.ServerSplitStack
// 0x0014 (0x0014 - 0x0000)
struct AuItemsComponent_ServerSplitStack final
{
public:
	struct FAuItemId                              ItemId;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_ServerSplitStack;

// Function AuItems.AuItemsComponent.ServerUseSystemAbilitOnOwnery
// 0x0028 (0x0028 - 0x0000)
struct AuItemsComponent_ServerUseSystemAbilitOnOwnery final
{
public:
	class UObject*                                InOwner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemId                              InItemId;                                          // 0x0008(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAuItemDataBase*                  ItemType;                                          // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InAbilityTag;                                      // 0x0020(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_ServerUseSystemAbilitOnOwnery;

// Function AuItems.AuItemsComponent.ServerUseSystemAbility
// 0x0018 (0x0018 - 0x0000)
struct AuItemsComponent_ServerUseSystemAbility final
{
public:
	struct FAuItemId                              InItemId;                                          // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InAbilityTag;                                      // 0x0010(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsComponent_ServerUseSystemAbility;

// Function AuItems.AuItemsStoreComponent.ClientOnItemAdded
// 0x0010 (0x0010 - 0x0000)
struct AuItemsStoreComponent_ClientOnItemAdded final
{
public:
	const class UAuItemDataBase*                  NewItem;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuItemsStoreComponent_ClientOnItemAdded;

// Function AuItems.AuItemsStoreComponent.GetItemCopy
// 0x01E8 (0x01E8 - 0x0000)
struct AuItemsStoreComponent_GetItemCopy final
{
public:
	struct FAuItemId                              Handle;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemEntry                           ReturnValue;                                       // 0x0010(0x01D8)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuItemsStoreComponent_GetItemCopy;

// Function AuItems.AuUseableItemOwnerInterface.AddItem
// 0x0010 (0x0010 - 0x0000)
struct AuUseableItemOwnerInterface_AddItem final
{
public:
	const class UAuItemDataBase*                  InItem;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuUseableItemOwnerInterface_AddItem;

// Function AuItems.AuUseableItemOwnerInterface.RemoveItem
// 0x0014 (0x0014 - 0x0000)
struct AuUseableItemOwnerInterface_RemoveItem final
{
public:
	struct FAuItemId                              InItemId;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuUseableItemOwnerInterface_RemoveItem;

// Function AuItems.AuUseableItemOwnerInterface.RemoveItemType
// 0x0010 (0x0010 - 0x0000)
struct AuUseableItemOwnerInterface_RemoveItemType final
{
public:
	const class UAuItemDataBase*                  InItem;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuUseableItemOwnerInterface_RemoveItemType;

// Function AuItems.AuUseableItemOwnerInterface.GetItemCount
// 0x0010 (0x0010 - 0x0000)
struct AuUseableItemOwnerInterface_GetItemCount final
{
public:
	const class UAuItemDataBase*                  InItemType;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuUseableItemOwnerInterface_GetItemCount;

// Function AuItems.AuUseableItemOwnerInterface.HaveSpace
// 0x0010 (0x0010 - 0x0000)
struct AuUseableItemOwnerInterface_HaveSpace final
{
public:
	const class UAuItemDataBase*                  InItem;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuUseableItemOwnerInterface_HaveSpace;

}

