#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuResourceGrid

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class AuResourceGrid.AuResourceNodeBaseComponent
// 0x0028 (0x00E0 - 0x00B8)
class UAuResourceNodeBaseComponent : public UActorComponent
{
public:
	class UAuResourceGridManagerComponent*        GridManager;                                       // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_C0[0x20];                                      // 0x00C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuResourceNodeBaseComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuResourceNodeBaseComponent")
	}
	static class UAuResourceNodeBaseComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuResourceNodeBaseComponent>();
	}
};
DUMPER7_ASSERTS_UAuResourceNodeBaseComponent;

// Class AuResourceGrid.AuResourceConsumerComponent
// 0x0020 (0x0100 - 0x00E0)
class UAuResourceConsumerComponent final : public UAuResourceNodeBaseComponent
{
public:
	TSubclassOf<class UGameplayEffect>            ConsumedResourceGE;                                // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x18];                                      // 0x00E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuResourceConsumerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuResourceConsumerComponent")
	}
	static class UAuResourceConsumerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuResourceConsumerComponent>();
	}
};
DUMPER7_ASSERTS_UAuResourceConsumerComponent;

// Class AuResourceGrid.AuResourceGeneratorComponent
// 0x0020 (0x0100 - 0x00E0)
class UAuResourceGeneratorComponent final : public UAuResourceNodeBaseComponent
{
public:
	TSubclassOf<class UGameplayEffect>            GrantedResourceGE;                                 // 0x00E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x18];                                      // 0x00E8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuResourceGeneratorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuResourceGeneratorComponent")
	}
	static class UAuResourceGeneratorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuResourceGeneratorComponent>();
	}
};
DUMPER7_ASSERTS_UAuResourceGeneratorComponent;

// Class AuResourceGrid.AuResourceGeneratorInterface
// 0x0000 (0x0000 - 0x0000)
class IAuResourceGeneratorInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuResourceGeneratorInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuResourceGeneratorInterface")
	}
	static class IAuResourceGeneratorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAuResourceGeneratorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAuResourceGeneratorInterface;

// Class AuResourceGrid.AuResourceGridManagerComponent
// 0x0108 (0x01E8 - 0x00E0)
class UAuResourceGridManagerComponent final : public UAuResourceNodeBaseComponent
{
public:
	uint8                                         Pad_E0[0xA0];                                      // 0x00E0(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                ASC;                                               // 0x0180(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_188[0x60];                                     // 0x0188(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuResourceGridManagerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuResourceGridManagerComponent")
	}
	static class UAuResourceGridManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuResourceGridManagerComponent>();
	}
};
DUMPER7_ASSERTS_UAuResourceGridManagerComponent;

// Class AuResourceGrid.AuResourceGridActor
// 0x0020 (0x02C8 - 0x02A8)
class AAuResourceGridActor final : public AInfo
{
public:
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuResourceGridManagerComponent*        ResourceGridManager;                               // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TSubclassOf<class UAuResourceGridManagerComponent> ResourceGridManagerClass;                     // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                AbilitySystem;                                     // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuResourceGridActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuResourceGridActor")
	}
	static class AAuResourceGridActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAuResourceGridActor>();
	}
};
DUMPER7_ASSERTS_AAuResourceGridActor;

// Class AuResourceGrid.AuResourceGridSubsystem
// 0x00F0 (0x0120 - 0x0030)
class UAuResourceGridSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0xF0];                                      // 0x0030(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuResourceGridSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuResourceGridSubsystem")
	}
	static class UAuResourceGridSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuResourceGridSubsystem>();
	}
};
DUMPER7_ASSERTS_UAuResourceGridSubsystem;

}

