#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuWeapon

#include "Basic.hpp"

#include "AuWeapon_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AuAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "AuItems_structs.hpp"


namespace SDK::Params
{

// Function AuWeapon.AuAT_WaitObserveReloadWeapon.WaitObserveReloadWeapon
// 0x0018 (0x0018 - 0x0000)
struct AuAT_WaitObserveReloadWeapon_WaitObserveReloadWeapon final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskInstanceName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuAT_WaitObserveReloadWeapon*          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAT_WaitObserveReloadWeapon_WaitObserveReloadWeapon;

// Function AuWeapon.AuAT_WaitObserveWeaponShoot.WaitObserveWeaponShoot
// 0x0018 (0x0018 - 0x0000)
struct AuAT_WaitObserveWeaponShoot_WaitObserveWeaponShoot final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskInstanceName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuAT_WaitObserveWeaponShoot*           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAT_WaitObserveWeaponShoot_WaitObserveWeaponShoot;

// Function AuWeapon.AuAT_WaitOnWeaponShot.WaitOnWeaponShot
// 0x0018 (0x0018 - 0x0000)
struct AuAT_WaitOnWeaponShot_WaitOnWeaponShot final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskInstanceName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuAT_WaitOnWeaponShot*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAT_WaitOnWeaponShot_WaitOnWeaponShot;

// Function AuWeapon.AuAT_WaitOnWeaponShot.HandleOnWeaponShoot
// 0x0198 (0x0198 - 0x0000)
struct AuAT_WaitOnWeaponShot_HandleOnWeaponShoot final
{
public:
	struct FAuEquippedWeapon                      EquippedWeapon;                                    // 0x0000(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAuTargetData                          Hits;                                              // 0x0100(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuCustomTargetHandle                  TargetingHandle;                                   // 0x0178(0x0001)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuCustomTraceDataHandle               CustomData;                                        // 0x0180(0x0018)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAT_WaitOnWeaponShot_HandleOnWeaponShoot;

// Function AuWeapon.AuAT_WaitReloadWeapon.WaitReloadWeapon
// 0x0020 (0x0020 - 0x0000)
struct AuAT_WaitReloadWeapon_WaitReloadWeapon final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskInstanceName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InEffectTag;                                       // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuAT_WaitReloadWeapon*                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAT_WaitReloadWeapon_WaitReloadWeapon;

// Function AuWeapon.AuAT_WaitSingleShot.WaitWeaponSingleShot
// 0x0010 (0x0010 - 0x0000)
struct AuAT_WaitSingleShot_WaitWeaponSingleShot final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuAT_WaitSingleShot*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAT_WaitSingleShot_WaitWeaponSingleShot;

// Function AuWeapon.AuAT_WaitSwapWeapon.WaitSwapWeapon
// 0x0020 (0x0020 - 0x0000)
struct AuAT_WaitSwapWeapon_WaitSwapWeapon final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskInstanceName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInHolsterWeapon;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuAT_WaitSwapWeapon*                   ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAT_WaitSwapWeapon_WaitSwapWeapon;

// Function AuWeapon.AuAT_WaitWeaponAutoFire.WaitWeaponAutoFire
// 0x0010 (0x0010 - 0x0000)
struct AuAT_WaitWeaponAutoFire_WaitWeaponAutoFire final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuAT_WaitWeaponAutoFire*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuAT_WaitWeaponAutoFire_WaitWeaponAutoFire;

// Function AuWeapon.AuRecoilComponent.OnWeaponEquipped
// 0x0200 (0x0200 - 0x0000)
struct AuRecoilComponent_OnWeaponEquipped final
{
public:
	struct FAuEquippedWeapon                      EquippedWeapon;                                    // 0x0000(0x0100)(Parm, NativeAccessSpecifierPublic)
	struct FAuEquippedWeapon                      OldEquippedWeapon;                                 // 0x0100(0x0100)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuRecoilComponent_OnWeaponEquipped;

// Function AuWeapon.AuWA_NextWeapon.GetUnholsterTime
// 0x0004 (0x0004 - 0x0000)
struct AuWA_NextWeapon_GetUnholsterTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWA_NextWeapon_GetUnholsterTime;

// Function AuWeapon.AuWeaponActor.OnSpawnCosmeticEffectsWhileFire
// 0x0010 (0x0010 - 0x0000)
struct AuWeaponActor_OnSpawnCosmeticEffectsWhileFire final
{
public:
	TArray<struct FHitResult>                     Hits;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponActor_OnSpawnCosmeticEffectsWhileFire;

// Function AuWeapon.AuWeaponAttributeSet.OnRep_Accuracy
// 0x0010 (0x0010 - 0x0000)
struct AuWeaponAttributeSet_OnRep_Accuracy final
{
public:
	struct FGameplayAttributeData                 Old;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponAttributeSet_OnRep_Accuracy;

// Function AuWeapon.AuWeaponAttributeSet.OnRep_Ammo
// 0x0010 (0x0010 - 0x0000)
struct AuWeaponAttributeSet_OnRep_Ammo final
{
public:
	struct FGameplayAttributeData                 Old;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponAttributeSet_OnRep_Ammo;

// Function AuWeapon.AuWeaponAttributeSet.OnRep_Handling
// 0x0010 (0x0010 - 0x0000)
struct AuWeaponAttributeSet_OnRep_Handling final
{
public:
	struct FGameplayAttributeData                 Old;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponAttributeSet_OnRep_Handling;

// Function AuWeapon.AuWeaponAttributeSet.OnRep_Stability
// 0x0010 (0x0010 - 0x0000)
struct AuWeaponAttributeSet_OnRep_Stability final
{
public:
	struct FGameplayAttributeData                 Old;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponAttributeSet_OnRep_Stability;

// Function AuWeapon.AuWeaponAttributeSet.OnRep_WeaponDamage
// 0x0010 (0x0010 - 0x0000)
struct AuWeaponAttributeSet_OnRep_WeaponDamage final
{
public:
	struct FGameplayAttributeData                 Old;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponAttributeSet_OnRep_WeaponDamage;

// Function AuWeapon.AuWeaponComponent.ApplyWeaponApplyDamageEffectSpec
// 0x00A8 (0x00A8 - 0x0000)
struct AuWeaponComponent_ApplyWeaponApplyDamageEffectSpec final
{
public:
	class UGameplayAbility*                       Ability;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EffectTag;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuTargetData                          InHitResults;                                      // 0x0010(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuCustomTargetHandle                  TargetingHandle;                                   // 0x0088(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuCustomTraceDataHandle               CustomData;                                        // 0x0090(0x0018)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_ApplyWeaponApplyDamageEffectSpec;

// Function AuWeapon.AuWeaponComponent.PostFireApplyDamageEffectSpec
// 0x00A8 (0x00A8 - 0x0000)
struct AuWeaponComponent_PostFireApplyDamageEffectSpec final
{
public:
	class UGameplayAbility*                       Ability;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           EffectTag;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuTargetData                          InHitResults;                                      // 0x0010(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuCustomTargetHandle                  TargetingHandle;                                   // 0x0088(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuCustomTraceDataHandle               CustomData;                                        // 0x0090(0x0018)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_PostFireApplyDamageEffectSpec;

// Function AuWeapon.AuWeaponComponent.CanStartFire
// 0x0001 (0x0001 - 0x0000)
struct AuWeaponComponent_CanStartFire final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_CanStartFire;

// Function AuWeapon.AuWeaponComponent.GetEquippedWeaponCurrentMagAmmo
// 0x0004 (0x0004 - 0x0000)
struct AuWeaponComponent_GetEquippedWeaponCurrentMagAmmo final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_GetEquippedWeaponCurrentMagAmmo;

// Function AuWeapon.AuWeaponComponent.GetHolsterAndUnholsterTime
// 0x0008 (0x0008 - 0x0000)
struct AuWeaponComponent_GetHolsterAndUnholsterTime final
{
public:
	float                                         Holster;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Unholster;                                         // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_GetHolsterAndUnholsterTime;

// Function AuWeapon.AuWeaponComponent.GetIsSwappingWeapon
// 0x0001 (0x0001 - 0x0000)
struct AuWeaponComponent_GetIsSwappingWeapon final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_GetIsSwappingWeapon;

// Function AuWeapon.AuWeaponComponent.GetWeaponActor
// 0x0040 (0x0040 - 0x0000)
struct AuWeaponComponent_GetWeaponActor final
{
public:
	struct FAuItemSlot                            Slot;                                              // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Idx;                                               // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAuWeaponActor*                         ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_GetWeaponActor;

// Function AuWeapon.AuWeaponComponent.K2_MulticastEquipWeapon
// 0x0030 (0x0030 - 0x0000)
struct AuWeaponComponent_K2_MulticastEquipWeapon final
{
public:
	struct FAuItemSlot                            Slot;                                              // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_K2_MulticastEquipWeapon;

// Function AuWeapon.AuWeaponComponent.K2_ServerEquipWeapon
// 0x0030 (0x0030 - 0x0000)
struct AuWeaponComponent_K2_ServerEquipWeapon final
{
public:
	struct FAuItemSlot                            Slot;                                              // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_K2_ServerEquipWeapon;

// Function AuWeapon.AuWeaponComponent.MulticastFireShot
// 0x0020 (0x0020 - 0x0000)
struct AuWeaponComponent_MulticastFireShot final
{
public:
	struct FAuCustomTargetHandle                  TargetingHandle;                                   // 0x0000(0x0001)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuCustomTraceDataHandle               CustomData;                                        // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_MulticastFireShot;

// Function AuWeapon.AuWeaponComponent.OnRep_EquippedWeapon
// 0x0100 (0x0100 - 0x0000)
struct AuWeaponComponent_OnRep_EquippedWeapon final
{
public:
	struct FAuEquippedWeapon                      OldWeapon;                                         // 0x0000(0x0100)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_OnRep_EquippedWeapon;

// Function AuWeapon.AuWeaponComponent.ServerCheckRateOfFire
// 0x0004 (0x0004 - 0x0000)
struct AuWeaponComponent_ServerCheckRateOfFire final
{
public:
	float                                         ElapsedTime;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_ServerCheckRateOfFire;

// Function AuWeapon.AuWeaponComponent.ServerEquipWeapon
// 0x0030 (0x0030 - 0x0000)
struct AuWeaponComponent_ServerEquipWeapon final
{
public:
	struct FAuItemSlot                            Slot;                                              // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_ServerEquipWeapon;

// Function AuWeapon.AuWeaponComponent.ServerStartComponentFire
// 0x0068 (0x0068 - 0x0000)
struct AuWeaponComponent_ServerStartComponentFire final
{
public:
	struct FAuItemSlot                            Slot;                                              // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            ComponentSlot;                                     // 0x0030(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InputTag;                                          // 0x0060(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_ServerStartComponentFire;

// Function AuWeapon.AuWeaponComponent.ServerStartFire
// 0x0038 (0x0038 - 0x0000)
struct AuWeaponComponent_ServerStartFire final
{
public:
	struct FAuItemSlot                            Slot;                                              // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InputTag;                                          // 0x0030(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_ServerStartFire;

// Function AuWeapon.AuWeaponComponent.ServerStopComponentFire
// 0x0068 (0x0068 - 0x0000)
struct AuWeaponComponent_ServerStopComponentFire final
{
public:
	struct FAuItemSlot                            Slot;                                              // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            ComponentSlot;                                     // 0x0030(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InputTag;                                          // 0x0060(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_ServerStopComponentFire;

// Function AuWeapon.AuWeaponComponent.ServerStopFire
// 0x0038 (0x0038 - 0x0000)
struct AuWeaponComponent_ServerStopFire final
{
public:
	struct FAuItemSlot                            Slot;                                              // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InputTag;                                          // 0x0030(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_ServerStopFire;

// Function AuWeapon.AuWeaponComponent.SetIsSwappingWeapon
// 0x0001 (0x0001 - 0x0000)
struct AuWeaponComponent_SetIsSwappingWeapon final
{
public:
	bool                                          bIsSetting;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_SetIsSwappingWeapon;

// Function AuWeapon.AuWeaponComponent.WeaponFailedToActivate
// 0x0028 (0x0028 - 0x0000)
struct AuWeaponComponent_WeaponFailedToActivate final
{
public:
	const class UGameplayAbility*                 FailedAbility;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ReasonTags;                                        // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_WeaponFailedToActivate;

// Function AuWeapon.AuWeaponComponent.GetEquippedWeaponAbility
// 0x0010 (0x0010 - 0x0000)
struct AuWeaponComponent_GetEquippedWeaponAbility final
{
public:
	struct FGameplayTag                           InputTag;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayAbility*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_GetEquippedWeaponAbility;

// Function AuWeapon.AuWeaponComponent.GetEquippedWeaponBaseFireRate
// 0x0004 (0x0004 - 0x0000)
struct AuWeaponComponent_GetEquippedWeaponBaseFireRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_GetEquippedWeaponBaseFireRate;

// Function AuWeapon.AuWeaponComponent.GetEquippedWeaponFireRate
// 0x0004 (0x0004 - 0x0000)
struct AuWeaponComponent_GetEquippedWeaponFireRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_GetEquippedWeaponFireRate;

// Function AuWeapon.AuWeaponComponent.GetMaxMagazine
// 0x0004 (0x0004 - 0x0000)
struct AuWeaponComponent_GetMaxMagazine final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_GetMaxMagazine;

// Function AuWeapon.AuWeaponComponent.GetReloadTime
// 0x0004 (0x0004 - 0x0000)
struct AuWeaponComponent_GetReloadTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_GetReloadTime;

// Function AuWeapon.AuWeaponComponent.GetTimeToAim
// 0x0004 (0x0004 - 0x0000)
struct AuWeaponComponent_GetTimeToAim final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_GetTimeToAim;

// Function AuWeapon.AuWeaponComponent.GetWeaponRange
// 0x0004 (0x0004 - 0x0000)
struct AuWeaponComponent_GetWeaponRange final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponComponent_GetWeaponRange;

// Function AuWeapon.AuWeaponItemDataBase.K2_IsTool
// 0x0001 (0x0001 - 0x0000)
struct AuWeaponItemDataBase_K2_IsTool final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWeaponItemDataBase_K2_IsTool;

}

