#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_RunCrAiAction_DealLongAoeDamage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AnimNotify_RunCrAiAction_DealLongAoeDamage.BP_AnimNotify_RunCrAiAction_DealLongAoeDamage_C.CreateAiAction
// 0x0060 (0x0060 - 0x0000)
struct BP_AnimNotify_RunCrAiAction_DealLongAoeDamage_C_CreateAiAction final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCrAiAction*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 LInstigator;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CalculatedEndLocation;                             // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICrAiMeleeT3>          K2Node_DynamicCast_AsCr_Ai_Melee_T3;               // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_GetCachedLongAoePoints_ReturnValue;       // 0x0048(0x0010)(ReferenceParm)
	class UCrAiActionDealLongAoeDamage*           CallFunc_Create_CrAiDealLongAoeDamage_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AnimNotify_RunCrAiAction_DealLongAoeDamage_C_CreateAiAction;

}

