#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_RunCrAiAction_DealAoeDamage

#include "Basic.hpp"

#include "MassAIPrototypeEnemyRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotify_RunCrAiAction_DealAoeDamage.BP_AnimNotify_RunCrAiAction_DealAoeDamage_C
// 0x0038 (0x0070 - 0x0038)
class UBP_AnimNotify_RunCrAiAction_DealAoeDamage_C final : public UCrAnimNotify_RunAiAction
{
public:
	double                                        StartLocationActorForwardOffset;                   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackRadius;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            Damage_Gameplay_Effect;                            // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Building_Infection_Damage;                         // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            Damage_To_Ai_Gameplay_Effect;                      // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         PlayerMaxPushDistance;                             // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayerPushDuration;                                // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnemyActorPushVelocity;                            // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnemyEntityPushVelocity;                           // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class UCrAiAction* CreateAiAction(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotify_RunCrAiAction_DealAoeDamage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotify_RunCrAiAction_DealAoeDamage_C")
	}
	static class UBP_AnimNotify_RunCrAiAction_DealAoeDamage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotify_RunCrAiAction_DealAoeDamage_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotify_RunCrAiAction_DealAoeDamage_C;

}

