#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CombustionPowerGenerator

#include "Basic.hpp"

#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CombustionPowerGenerator.BP_CombustionPowerGenerator_C
// 0x0040 (0x0678 - 0x0638)
class ABP_CombustionPowerGenerator_C final : public ACrSolarPanel
{
public:
	class UStaticMeshComponent*                   planefog1;                                         // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   planefog;                                          // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CombustionPowerGenerator_main_body_addon;       // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CombustionPowerGenerator_Glass;                 // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_BasicEnergyGenerator_circle;                    // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_BasicEnergyGenerator_vents;                     // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MainMesh;                                          // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CombustionPowerGenerator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CombustionPowerGenerator_C")
	}
	static class ABP_CombustionPowerGenerator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CombustionPowerGenerator_C>();
	}
};
DUMPER7_ASSERTS_ABP_CombustionPowerGenerator_C;

}

