#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CoolerActive_Tiles

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CoolerActive_Tiles.BP_CoolerActive_Tiles_C.ExecuteUbergraph_BP_CoolerActive_Tiles
// 0x0018 (0x0018 - 0x0000)
struct BP_CoolerActive_Tiles_C_ExecuteUbergraph_BP_CoolerActive_Tiles final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CoolerActive_Tiles_C_ExecuteUbergraph_BP_CoolerActive_Tiles;

// Function BP_CoolerActive_Tiles.BP_CoolerActive_Tiles_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_CoolerActive_Tiles_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CoolerActive_Tiles_C_ReceiveActorBeginOverlap;

// Function BP_CoolerActive_Tiles.BP_CoolerActive_Tiles_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CoolerActive_Tiles_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CoolerActive_Tiles_C_ReceiveTick;

}

