#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Exploder_Tier2_LOD0_AnimNotify_RunCrAiAction_DealDamageAndSpawnEntity

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AuActorPlacement_structs.hpp"
#include "MassAIPrototypeEnemyRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Exploder_Tier2_LOD0_AnimNotify_RunCrAiAction_DealDamageAndSpawnEntity.BP_Exploder_Tier2_LOD0_AnimNotify_RunCrAiAction_DealDamageAndSpawnEntity_C
// 0x0098 (0x00D0 - 0x0038)
class UBP_Exploder_Tier2_LOD0_AnimNotify_RunCrAiAction_DealDamageAndSpawnEntity_C final : public UCrAnimNotify_RunAiAction
{
public:
	TSubclassOf<class UGameplayEffect>            Damage_Gameplay_Effect;                            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Building_Infection_Damage;                         // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SpawnedEntityScale;                                // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAuAPMassSpawnedEntityType             Success_Entity_Type;                               // 0x0060(0x0038)(Edit, BlueprintVisible)
	struct FAuAPMassSpawnedEntityType             Failure_Entity_Type;                               // 0x0098(0x0038)(Edit, BlueprintVisible)

public:
	class UCrAiAction* CreateAiAction(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Exploder_Tier2_LOD0_AnimNotify_RunCrAiAction_DealDamageAndSpawnEntity_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Exploder_Tier2_LOD0_AnimNotify_RunCrAiAction_DealDamageAndSpawnEntity_C")
	}
	static class UBP_Exploder_Tier2_LOD0_AnimNotify_RunCrAiAction_DealDamageAndSpawnEntity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Exploder_Tier2_LOD0_AnimNotify_RunCrAiAction_DealDamageAndSpawnEntity_C>();
	}
};
DUMPER7_ASSERTS_UBP_Exploder_Tier2_LOD0_AnimNotify_RunCrAiAction_DealDamageAndSpawnEntity_C;

}

