#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Foundable_Enemy_Loot_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Foundable_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Foundable_Enemy_Loot_Base.BP_Foundable_Enemy_Loot_Base_C
// 0x0038 (0x0340 - 0x0308)
class ABP_Foundable_Enemy_Loot_Base_C : public ABP_Foundable_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Foundable_Enemy_Loot_Base_C;     // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTrajectorySimulationActive;                      // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TrajectorySimulationStartTime;                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TrajectorySimulationSpeed;                         // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Foundable_Enemy_Loot_Base(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SimulateDrop(const struct FVector& StartLocation);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Foundable_Enemy_Loot_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Foundable_Enemy_Loot_Base_C")
	}
	static class ABP_Foundable_Enemy_Loot_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Foundable_Enemy_Loot_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_Foundable_Enemy_Loot_Base_C;

}

