#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FPP_CameraAnimsComp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FPP_CameraAnimsComp.BP_FPP_CameraAnimsComp_C
// 0x0078 (0x0130 - 0x00B8)
class UBP_FPP_CameraAnimsComp_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   CameraAttachmentSocketName;                        // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                LastTickLocation;                                  // 0x00C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LastTickRotation;                                  // 0x00E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCameraAnimFromBoneEnabled;                        // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AnimationStrength;                                 // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          LastTickWasReadFromCurve;                          // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InitialCameraLocation;                             // 0x0110(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  OwningBPPlayerCharacter;                           // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FPP_CameraAnimsComp(int32 EntryPoint);
	void GetOwningCameraSpringArm(class USpringArmComponent** Camera);
	void GetOwningPlayerController(class APlayerController** Player_Controller);
	void GetOwningSkeletalMeshComponent(class USkeletalMeshComponent** Skeletal_Mesh_Comp);
	void ReceiveTick(float DeltaSeconds);
	void SetCameraAnimEnabled(bool New_Enabled);
	void UpdateCameraLocation(double Delta_Seconds);
	void UpdateCameraRotation(double Delta_Seconds);
	void ZeroBlendPitch();
	void ZeroBlendPitchTimer();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FPP_CameraAnimsComp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FPP_CameraAnimsComp_C")
	}
	static class UBP_FPP_CameraAnimsComp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FPP_CameraAnimsComp_C>();
	}
};
DUMPER7_ASSERTS_UBP_FPP_CameraAnimsComp_C;

}

