#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Foundable_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Foundable_Base.BP_Foundable_Base_C
// 0x0028 (0x0308 - 0x02E0)
class ABP_Foundable_Base_C : public ACrStorageAsBuilding
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        AlwaysVisible;                                     // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        OnlyWhen_Empty;                                    // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        OnlyWhenNotEmpty;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Foundable_Base(int32 EntryPoint);
	bool OnStorageEmptied();
	void PlayEmptiedSound();
	void ReceiveBeginPlay();
	void UpdateFoundableVisibilityForStorageState(bool BeginPlay);
	void UpdateMaterialsForStorageState();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Foundable_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Foundable_Base_C")
	}
	static class ABP_Foundable_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Foundable_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_Foundable_Base_C;

}

