#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Modular_StairsBarrierL

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Modular_StairsBarrierL.BP_Modular_StairsBarrierL_C.GetBuildingMeshes
// 0x0018 (0x0018 - 0x0000)
struct BP_Modular_StairsBarrierL_C_GetBuildingMeshes final
{
public:
	class UMeshComponent*                         MainBody;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 AdditionalMeshes;                                  // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_Modular_StairsBarrierL_C_GetBuildingMeshes;

// Function BP_Modular_StairsBarrierL.BP_Modular_StairsBarrierL_C.GetBuildingProgressMeshes
// 0x0050 (0x0050 - 0x0000)
struct BP_Modular_StairsBarrierL_C_GetBuildingProgressMeshes final
{
public:
	float                                         BuildingProgressPercentage;                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 OutMeshesToHide;                                   // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UMeshComponent*>                 OutMeshesToShow;                                   // 0x0018(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UMeshComponent*>                 MeshesToShow;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class UMeshComponent*>                 MeshesToHide;                                      // 0x0038(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	double                                        ProgressPercentage;                                // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Modular_StairsBarrierL_C_GetBuildingProgressMeshes;

}

