#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MediumMeteOre

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_MeteOreBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MediumMeteOre.BP_MediumMeteOre_C
// 0x0050 (0x0950 - 0x0900)
class ABP_MediumMeteOre_C final : public ABP_MeteOreBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_MediumMeteOre_C;                 // 0x08F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_FlatSphere;                                     // 0x0900(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RVTDecal_M;                                        // 0x0908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   RVTDecal_DNR;                                      // 0x0910(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGeometryCollectionComponent*           GC_Meteorite_Medium;                               // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   DecalChildActor;                                   // 0x0920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_DissolveAmount_B9AE7FD04C3E48B6FF4CFBAAE2B0074C; // 0x0928(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_B9AE7FD04C3E48B6FF4CFBAAE2B0074C; // 0x092C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92D[0x3];                                      // 0x092D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGeometryCollectionComponent*           GeometryCollectionComponent;                       // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AFS_Explosion_C*                        FSExplosion;                                       // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MediumMeteOre(int32 EntryPoint);
	void OnBeginPlayDepletedStateStarted();
	void OnResourceDepletedCosmeticsStart();
	void ReceiveBeginPlay();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MediumMeteOre_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MediumMeteOre_C")
	}
	static class ABP_MediumMeteOre_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MediumMeteOre_C>();
	}
};
DUMPER7_ASSERTS_ABP_MediumMeteOre_C;

}

