#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MechanicalDrillTier2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MechanicalDrillTier2.BP_MechanicalDrillTier2_C
// 0x0060 (0x0728 - 0x06C8)
class ABP_MechanicalDrillTier2_C final : public ACrExtractor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInstancedStaticMeshComponent*          SM_MechanicalDrill_Ores;                           // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MechanicalDrill_02_addon;                       // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MechanicalDrill_02_wheel;                       // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_MechanicalDrill_02_main_body;                   // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FakeFog_01;                                        // 0x06F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_DroneRailCap_01;                                // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_DroneEntry_Outlet_01;                           // 0x0700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Static;                                            // 0x0708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Sound;                                             // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         OreTypes;                                          // 0x0718(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CustomEvent();
	void ExecuteUbergraph_BP_MechanicalDrillTier2(int32 EntryPoint);
	void OnBuildingStateChanged(ECrBuildingState InState);
	void OnResourceDetected(TSubclassOf<class UCrItemDataBase> OreItemClass);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MechanicalDrillTier2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MechanicalDrillTier2_C")
	}
	static class ABP_MechanicalDrillTier2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MechanicalDrillTier2_C>();
	}
};
DUMPER7_ASSERTS_ABP_MechanicalDrillTier2_C;

}

