#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Modular_StairsFlat

#include "Basic.hpp"

#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Modular_StairsFlat.BP_Modular_StairsFlat_C
// 0x0028 (0x0858 - 0x0830)
class ABP_Modular_StairsFlat_C final : public ACrCustomBuilding
{
public:
	class UBoxComponent*                          SnapCollider6;                                     // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SnapCollider5;                                     // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SnappingColliders;                                 // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCrInteriorsMapperBoxComponent*         CrInteriorsMapperBox;                              // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAuActorPlacementSocketsComponent*      AuActorPlacementSockets;                           // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void GetBuildingMeshes(class UMeshComponent** MainBody, TArray<class UMeshComponent*>* AdditionalMeshes) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Modular_StairsFlat_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Modular_StairsFlat_C")
	}
	static class ABP_Modular_StairsFlat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Modular_StairsFlat_C>();
	}
};
DUMPER7_ASSERTS_ABP_Modular_StairsFlat_C;

}

