#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Melee_Tier3_Ragdoll_ReplicatedCollision

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Melee_Tier3_Ragdoll_ReplicatedCollision.BP_Melee_Tier3_Ragdoll_ReplicatedCollision_C.AttachToRagdoll
// 0x0008 (0x0008 - 0x0000)
struct BP_Melee_Tier3_Ragdoll_ReplicatedCollision_C_AttachToRagdoll final
{
public:
	class ABP_DeathSequenceActor_C*               Ragdoll;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Melee_Tier3_Ragdoll_ReplicatedCollision_C_AttachToRagdoll;

// Function BP_Melee_Tier3_Ragdoll_ReplicatedCollision.BP_Melee_Tier3_Ragdoll_ReplicatedCollision_C.ExecuteUbergraph_BP_Melee_Tier3_Ragdoll_ReplicatedCollision
// 0x01D0 (0x01D0 - 0x0000)
struct BP_Melee_Tier3_Ragdoll_ReplicatedCollision_C_ExecuteUbergraph_BP_Melee_Tier3_Ragdoll_ReplicatedCollision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DeathSequenceActor_C*               K2Node_CustomEvent_Ragdoll;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0xB];                                       // 0x0015(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00C8(0x0100)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Melee_Tier3_Ragdoll_ReplicatedCollision_C_ExecuteUbergraph_BP_Melee_Tier3_Ragdoll_ReplicatedCollision;

// Function BP_Melee_Tier3_Ragdoll_ReplicatedCollision.BP_Melee_Tier3_Ragdoll_ReplicatedCollision_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Melee_Tier3_Ragdoll_ReplicatedCollision_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Melee_Tier3_Ragdoll_ReplicatedCollision_C_ReceiveTick;

}

