#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Melee_Tier1_Actor_Character

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BP_Melee_Tier1_Actor_Character.BP_Melee_Tier1_Actor_Character_C.CanChangeEyeColor
// 0x0020 (0x0020 - 0x0000)
struct BP_Melee_Tier1_Actor_Character_C_CanChangeEyeColor final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMassEnemyAnimationInstance*            K2Node_DynamicCast_AsMass_Enemy_Animation_Instance; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Melee_Tier1_Actor_Character_C_CanChangeEyeColor;

// Function BP_Melee_Tier1_Actor_Character.BP_Melee_Tier1_Actor_Character_C.ExecuteUbergraph_BP_Melee_Tier1_Actor_Character
// 0x0180 (0x0180 - 0x0000)
struct BP_Melee_Tier1_Actor_Character_C_ExecuteUbergraph_BP_Melee_Tier1_Actor_Character final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0008(0x0100)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayTag                           K2Node_Event_KillingDamageTag;                     // 0x0108(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanChangeEyeColor_Result;                 // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanChangeEyeColor_Result_1;               // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_NewVisualVariationSeed;               // 0x0118(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewIsBoosted;                         // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewIsAggro;                           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_NewIsJumpEyeBehaviour;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast; // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast_1; // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCustomPrimitiveDataFloat_Value_ImplicitCast_2; // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Melee_Tier1_Actor_Character_C_ExecuteUbergraph_BP_Melee_Tier1_Actor_Character;

// Function BP_Melee_Tier1_Actor_Character.BP_Melee_Tier1_Actor_Character_C.OnAiDied
// 0x0108 (0x0108 - 0x0000)
struct BP_Melee_Tier1_Actor_Character_C_OnAiDied final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0100)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayTag                           KillingDamageTag;                                  // 0x0100(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Melee_Tier1_Actor_Character_C_OnAiDied;

// Function BP_Melee_Tier1_Actor_Character.BP_Melee_Tier1_Actor_Character_C.OnVisualVariationChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_Melee_Tier1_Actor_Character_C_OnVisualVariationChanged final
{
public:
	struct FVector                                NewVisualVariationSeed;                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Melee_Tier1_Actor_Character_C_OnVisualVariationChanged;

// Function BP_Melee_Tier1_Actor_Character.BP_Melee_Tier1_Actor_Character_C.SetIsAggroEyeColor
// 0x0001 (0x0001 - 0x0000)
struct BP_Melee_Tier1_Actor_Character_C_SetIsAggroEyeColor final
{
public:
	bool                                          NewIsAggro;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Melee_Tier1_Actor_Character_C_SetIsAggroEyeColor;

// Function BP_Melee_Tier1_Actor_Character.BP_Melee_Tier1_Actor_Character_C.SetIsBoostedEyeColor
// 0x0001 (0x0001 - 0x0000)
struct BP_Melee_Tier1_Actor_Character_C_SetIsBoostedEyeColor final
{
public:
	bool                                          NewIsBoosted;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Melee_Tier1_Actor_Character_C_SetIsBoostedEyeColor;

// Function BP_Melee_Tier1_Actor_Character.BP_Melee_Tier1_Actor_Character_C.SetIsJumpEyeBehaviour
// 0x0001 (0x0001 - 0x0000)
struct BP_Melee_Tier1_Actor_Character_C_SetIsJumpEyeBehaviour final
{
public:
	bool                                          NewIsJumpEyeBehaviour;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Melee_Tier1_Actor_Character_C_SetIsJumpEyeBehaviour;

// Function BP_Melee_Tier1_Actor_Character.BP_Melee_Tier1_Actor_Character_C.UserConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_Melee_Tier1_Actor_Character_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Melee_Tier1_Actor_Character_C_UserConstructionScript;

}

