#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RangedTier2_PooledProjectile_Snot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RangedTier2_PooledProjectile_Snot.BP_RangedTier2_PooledProjectile_Snot_C
// 0x0050 (0x0380 - 0x0330)
class ABP_RangedTier2_PooledProjectile_Snot_C : public ACrAiProjectileActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  HeatBackgroundGameplayTags;                        // 0x0348(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         BuildingsTemperatureToAdd;                         // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SnotSpawnedTimestamp;                              // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SnotLifetime;                                      // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_RangedTier2_PooledProjectile_Snot_SphereComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_RangedTier2_PooledProjectile_Snot_SphereComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_BP_RangedTier2_PooledProjectile_Snot(int32 EntryPoint);
	void OnProjectileShot(const struct FCrAiProjectileParameters& InProjectileParameters);

	bool CanReturnToPool() const;
	bool CanReturnToPoolAfterHit() const;
	bool ShouldForceReturnToPool() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RangedTier2_PooledProjectile_Snot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RangedTier2_PooledProjectile_Snot_C")
	}
	static class ABP_RangedTier2_PooledProjectile_Snot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RangedTier2_PooledProjectile_Snot_C>();
	}
};
DUMPER7_ASSERTS_ABP_RangedTier2_PooledProjectile_Snot_C;

}

