#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ranged_Tier2_LOD0_Character

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BaseAI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ranged_Tier2_LOD0_Character.BP_Ranged_Tier2_LOD0_Character_C
// 0x0020 (0x0C20 - 0x0C00)
class ABP_Ranged_Tier2_LOD0_Character_C final : public ABP_BaseAI_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Ranged_Tier2_LOD0_Character_C;   // 0x0BF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NiagaraEyes;                                       // 0x0C00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SpitDrip;                                          // 0x0C08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Key_Name;                                          // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InjuryPoseAlpha;                                   // 0x0C18(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Ranged_Tier2_LOD0_Character(int32 EntryPoint);
	void OnAiDied(const struct FHitResult& HitResult, const struct FGameplayTag& KillingDamageTag);
	void OnDamage(class AActor* Actor, const struct FHitResult& HitResult, float InDamage);
	void OnRep_InjuryPoseAlpha();
	void ReceiveBeginPlay();
	void SetIsAggroEyeColor(bool NewIsAggro);
	void SetIsBoostedEyeColor(bool NewIsBoosted);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Ranged_Tier2_LOD0_Character_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Ranged_Tier2_LOD0_Character_C")
	}
	static class ABP_Ranged_Tier2_LOD0_Character_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ranged_Tier2_LOD0_Character_C>();
	}
};
DUMPER7_ASSERTS_ABP_Ranged_Tier2_LOD0_Character_C;

}

