#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_MoveAwayFromActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_MoveAwayFromActor.BTTask_MoveAwayFromActor_C
// 0x0088 (0x0130 - 0x00A8)
class UBTTask_MoveAwayFromActor_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 ActorToMoveAwayFrom;                               // 0x00B0(0x0028)(Edit, BlueprintVisible)
	double                                        WalkAwayDistance;                                  // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 OutCalcualtedPosition;                             // 0x00E0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 SelfActorKey;                                      // 0x0108(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTTask_MoveAwayFromActor(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_MoveAwayFromActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_MoveAwayFromActor_C")
	}
	static class UBTTask_MoveAwayFromActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_MoveAwayFromActor_C>();
	}
};
DUMPER7_ASSERTS_UBTTask_MoveAwayFromActor_C;

}

