#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChimeraRiflePrototypeRuntime

#include "Basic.hpp"

#include "GameplayAbilities_classes.hpp"
#include "Chimera_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ChimeraRiflePrototypeRuntime.CrProtoReloadExecutionCalc
// 0x0000 (0x0040 - 0x0040)
class UCrProtoReloadExecutionCalc final : public UGameplayEffectExecutionCalculation
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrProtoReloadExecutionCalc")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrProtoReloadExecutionCalc")
	}
	static class UCrProtoReloadExecutionCalc* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrProtoReloadExecutionCalc>();
	}
};
DUMPER7_ASSERTS_UCrProtoReloadExecutionCalc;

// Class ChimeraRiflePrototypeRuntime.CrReloadCooldownApplicationReq
// 0x0000 (0x0028 - 0x0028)
class UCrReloadCooldownApplicationReq final : public UGameplayEffectCustomApplicationRequirement
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrReloadCooldownApplicationReq")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrReloadCooldownApplicationReq")
	}
	static class UCrReloadCooldownApplicationReq* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrReloadCooldownApplicationReq>();
	}
};
DUMPER7_ASSERTS_UCrReloadCooldownApplicationReq;

// Class ChimeraRiflePrototypeRuntime.CrRifleAmmoItem
// 0x0000 (0x0400 - 0x0400)
class UCrRifleAmmoItem final : public UCrResourceItemBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrRifleAmmoItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrRifleAmmoItem")
	}
	static class UCrRifleAmmoItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrRifleAmmoItem>();
	}
};
DUMPER7_ASSERTS_UCrRifleAmmoItem;

// Class ChimeraRiflePrototypeRuntime.CrRifleAmmoWidgetComponent
// 0x0010 (0x00C8 - 0x00B8)
class UCrRifleAmmoWidgetComponent final : public UActorComponent
{
public:
	class ACrPlayerControllerBase*                OwnerPlayerController;                             // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TSubclassOf<class UAuItemData>                RifleItem;                                         // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	float GetAllAvailableAmmo() const;
	float GetCurrentAmmo() const;
	bool IsWeaponEquipped() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrRifleAmmoWidgetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrRifleAmmoWidgetComponent")
	}
	static class UCrRifleAmmoWidgetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrRifleAmmoWidgetComponent>();
	}
};
DUMPER7_ASSERTS_UCrRifleAmmoWidgetComponent;

// Class ChimeraRiflePrototypeRuntime.CrRifleCrosshairWidgetComponent
// 0x0008 (0x00C0 - 0x00B8)
class UCrRifleCrosshairWidgetComponent final : public UActorComponent
{
public:
	class ACrCharacterPlayerBase*                 OwnerCharacter;                                    // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	float GetCurrentSpread() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrRifleCrosshairWidgetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrRifleCrosshairWidgetComponent")
	}
	static class UCrRifleCrosshairWidgetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrRifleCrosshairWidgetComponent>();
	}
};
DUMPER7_ASSERTS_UCrRifleCrosshairWidgetComponent;

// Class ChimeraRiflePrototypeRuntime.CrRiflePrototypeAdderComponent
// 0x0060 (0x0118 - 0x00B8)
class UCrRiflePrototypeAdderComponent final : public UActorComponent
{
public:
	TSoftObjectPtr<class UCrSlotDefaultItemsData> WeaponsToGive;                                     // 0x00B8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCrRifleAmmoItem>           AmmoItem;                                          // 0x00E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UCrItemRecipeData>       AmmoRecipe;                                        // 0x00E8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         StartingAmmoCount;                                 // 0x0110(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsAnyAmmoLeft() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrRiflePrototypeAdderComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrRiflePrototypeAdderComponent")
	}
	static class UCrRiflePrototypeAdderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrRiflePrototypeAdderComponent>();
	}
};
DUMPER7_ASSERTS_UCrRiflePrototypeAdderComponent;

}

