#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChimeraRichText

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class ChimeraRichText.CrRichTextBlock
// 0x0010 (0x07F0 - 0x07E0)
class UCrRichTextBlock final : public URichTextBlock
{
public:
	uint8                                         Pad_7E0[0x10];                                     // 0x07E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrRichTextBlock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrRichTextBlock")
	}
	static class UCrRichTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrRichTextBlock>();
	}
};
DUMPER7_ASSERTS_UCrRichTextBlock;

// Class ChimeraRichText.CrRichTextBlockDecorator
// 0x0008 (0x0030 - 0x0028)
class UCrRichTextBlockDecorator final : public URichTextBlockDecorator
{
public:
	class UDataTable*                             InputImageSet;                                     // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrRichTextBlockDecorator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrRichTextBlockDecorator")
	}
	static class UCrRichTextBlockDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrRichTextBlockDecorator>();
	}
};
DUMPER7_ASSERTS_UCrRichTextBlockDecorator;

// Class ChimeraRichText.CrRichTextBlockHyperlinkDecorator
// 0x06A8 (0x06D0 - 0x0028)
class UCrRichTextBlockHyperlinkDecorator : public URichTextBlockDecorator
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHyperlinkStyle                        HyperlinkStyle;                                    // 0x0030(0x0690)(Edit, NativeAccessSpecifierPublic)
	bool                                          AlwaysBlockHyperlinks;                             // 0x06C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C1[0xF];                                      // 0x06C1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RichTextBlockClickHyperlinkBP(const class FString& ID);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrRichTextBlockHyperlinkDecorator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrRichTextBlockHyperlinkDecorator")
	}
	static class UCrRichTextBlockHyperlinkDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrRichTextBlockHyperlinkDecorator>();
	}
};
DUMPER7_ASSERTS_UCrRichTextBlockHyperlinkDecorator;

}

