#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrAiAnimalCrabRuntime

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"
#include "Chimera_structs.hpp"


namespace SDK
{

// Class CrAiAnimalCrabRuntime.BTService_CrAiAnimalCrabUpdateState
// 0x0030 (0x00A0 - 0x0070)
class UBTService_CrAiAnimalCrabUpdateState final : public UBTService
{
public:
	float                                         UpdateInterval;                                    // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 SelfActorKey;                                      // 0x0078(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTService_CrAiAnimalCrabUpdateState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTService_CrAiAnimalCrabUpdateState")
	}
	static class UBTService_CrAiAnimalCrabUpdateState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_CrAiAnimalCrabUpdateState>();
	}
};
DUMPER7_ASSERTS_UBTService_CrAiAnimalCrabUpdateState;

// Class CrAiAnimalCrabRuntime.CrAiAnimalCrabInterface
// 0x0000 (0x0000 - 0x0000)
class ICrAiAnimalCrabInterface final
{
public:
	bool AreTentaclesHidden();
	class UCrAiAnimalCrabUpdateStateComponent* GetCrabUpdateStateComponent();
	void SetTentaclesHidden(bool bHidden);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiAnimalCrabInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiAnimalCrabInterface")
	}
	static class ICrAiAnimalCrabInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICrAiAnimalCrabInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICrAiAnimalCrabInterface;

// Class CrAiAnimalCrabRuntime.CrAiAnimalCrabUpdateStateComponent
// 0x00E8 (0x01A0 - 0x00B8)
class UCrAiAnimalCrabUpdateStateComponent final : public UActorComponent
{
public:
	struct FGameplayTag                           InWaterTag;                                        // 0x00B8(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ConsiderableRadius;                                // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AwarenessRadius;                                   // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DangerRadius;                                      // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WaterDangerRadius;                                 // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsAnyDamageRegistered_BBKeyName;                   // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsAnyoneInDangerZoneDetected_BBKeyName;            // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsShotInAwarenessZoneDetected_BBKeyName;           // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsShotToDangerZoneDetected_BBKeyName;              // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsPlayerInAwarenessZoneDetected_BBKeyName;         // 0x00F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsInWater_BBKeyName;                               // 0x00F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsWaveStarted_BBKeyName;                           // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsWaveFinished_BBKeyName;                          // 0x0108(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AMassEnemyCharacterBase*                Crab;                                              // 0x0110(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UBlackboardComponent*                   CrabBlackboardComponent;                           // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UAbilitySystemComponent*                CrabAbilitySystemComponent;                        // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class ACrCharacterPlayerBase*>         PlayersInConsiderableZone;                         // 0x0128(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class ACrCharacterPlayerBase*>         PlayersInAwarenessZone;                            // 0x0138(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_148[0x58];                                     // 0x0148(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnShotInAwarenessZone(const struct FAuEquippedWeapon& EquippedWeapon);
	void OnShotToDangerZone(const struct FAuEquippedWeapon& EquippedWeapon, const struct FAuTargetData& Hits, const struct FAuCustomTargetHandle& TargetingHandle, const struct FAuCustomTraceDataHandle& CustomData);
	void OnWaveStateChanged(EEnviroWave Wave, EEnviroWaveStage Stage, const struct FCrEnviroWaveSettings& Settings, float Progress);
	void ResetDamageTimestamp();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiAnimalCrabUpdateStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiAnimalCrabUpdateStateComponent")
	}
	static class UCrAiAnimalCrabUpdateStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrAiAnimalCrabUpdateStateComponent>();
	}
};
DUMPER7_ASSERTS_UCrAiAnimalCrabUpdateStateComponent;

}

