#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrAiMeleeRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CrAiMeleeRuntime.CrAiActionModifyMeleeT3AnimData.Create_CrAiActionModifyMeleeT3AnimData
// 0x0018 (0x0018 - 0x0000)
struct CrAiActionModifyMeleeT3AnimData_Create_CrAiActionModifyMeleeT3AnimData final
{
public:
	TSubclassOf<class UCrAiActionModifyMeleeT3AnimData> ActionType;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewMaxLifetimeS;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NewHasAggroTarget;                                 // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NewIsCoverActive;                                  // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NewIsUpCover;                                      // 0x000E(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrAiActionModifyMeleeT3AnimData*       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrAiActionModifyMeleeT3AnimData_Create_CrAiActionModifyMeleeT3AnimData;

// Function CrAiMeleeRuntime.CrAiMeleeT3.CacheLongAoePoints
// 0x0010 (0x0010 - 0x0000)
struct CrAiMeleeT3_CacheLongAoePoints final
{
public:
	TArray<struct FVector>                        Points;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrAiMeleeT3_CacheLongAoePoints;

// Function CrAiMeleeRuntime.CrAiMeleeT3.GetCachedLongAoePoints
// 0x0010 (0x0010 - 0x0000)
struct CrAiMeleeT3_GetCachedLongAoePoints final
{
public:
	TArray<struct FVector>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrAiMeleeT3_GetCachedLongAoePoints;

// Function CrAiMeleeRuntime.CrAiMeleeT3.SetHasAggroTarget
// 0x0001 (0x0001 - 0x0000)
struct CrAiMeleeT3_SetHasAggroTarget final
{
public:
	bool                                          bNewHasAggroTarget;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrAiMeleeT3_SetHasAggroTarget;

// Function CrAiMeleeRuntime.CrAiMeleeT3.SetIsCoverActive
// 0x0001 (0x0001 - 0x0000)
struct CrAiMeleeT3_SetIsCoverActive final
{
public:
	bool                                          bNewIsCoverActive;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrAiMeleeT3_SetIsCoverActive;

// Function CrAiMeleeRuntime.CrAiMeleeT3.SetIsUpCover
// 0x0001 (0x0001 - 0x0000)
struct CrAiMeleeT3_SetIsUpCover final
{
public:
	bool                                          bNewIsUpCover;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrAiMeleeT3_SetIsUpCover;

// Function CrAiMeleeRuntime.CrMeleeT3MoveTargetActor.LockOnTargetForDuration
// 0x0004 (0x0004 - 0x0000)
struct CrMeleeT3MoveTargetActor_LockOnTargetForDuration final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CrMeleeT3MoveTargetActor_LockOnTargetForDuration;

}

