#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrantBiomesPCG

#include "Basic.hpp"

#include "ErrantBiomesPCG_structs.hpp"
#include "PCG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ErrantBiomesPCG.BiomesPCGComponentData
// 0x0100 (0x0128 - 0x0028)
class UBiomesPCGComponentData final : public UObject
{
public:
	uint32                                        BiomesSettingsHash;                                // 0x0028(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentX;                                        // 0x002C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentY;                                        // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FBiomesPCGMaskSource, struct FBiomesPCGMaskData> MaskDataMap;                        // 0x0038(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<struct FSoftObjectPath, struct FBiomesPCGSpeciesPointsData> SpeciesPointsDataMap;           // 0x0088(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TMap<struct FSoftObjectPath, struct FBiomesPCGSpeciesPointsLowerPrecisionData> SpeciesPointsLowerPrecisionDataMap; // 0x00D8(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesPCGComponentData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesPCGComponentData")
	}
	static class UBiomesPCGComponentData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesPCGComponentData>();
	}
};
DUMPER7_ASSERTS_UBiomesPCGComponentData;

// Class ErrantBiomesPCG.BiomesPCGMaskSettings
// 0x0058 (0x0118 - 0x00C0)
class UBiomesPCGMaskSettings final : public UPCGSettings
{
public:
	EBiomesPCGMaskType                            MaskType;                                          // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBiomesPCGMaskDataSource                      Mask;                                              // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        BiomesAsset;                                       // 0x00C8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UBiomesMaskAsset>        BiomesMaskAsset;                                   // 0x00E8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallbackValue;                                     // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesPCGMaskSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesPCGMaskSettings")
	}
	static class UBiomesPCGMaskSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesPCGMaskSettings>();
	}
};
DUMPER7_ASSERTS_UBiomesPCGMaskSettings;

// Class ErrantBiomesPCG.BiomesPCGSpeciesPointsSettings
// 0x0020 (0x00E0 - 0x00C0)
class UBiomesPCGSpeciesPointsSettings final : public UPCGSettings
{
public:
	struct FSoftObjectPath                        SpeciesAsset;                                      // 0x00C0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesPCGSpeciesPointsSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesPCGSpeciesPointsSettings")
	}
	static class UBiomesPCGSpeciesPointsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesPCGSpeciesPointsSettings>();
	}
};
DUMPER7_ASSERTS_UBiomesPCGSpeciesPointsSettings;

// Class ErrantBiomesPCG.BiomesPCGWorldSettings
// 0x0198 (0x0440 - 0x02A8)
class ABiomesPCGWorldSettings final : public AActor
{
public:
	bool                                          bIsInitialized;                                    // 0x02A8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatrix                                WorldToComponentTransforms;                        // 0x02B0(0x0080)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	EBiomesPCGLimit                               BiomesDataLimit;                                   // 0x0330(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<struct FSoftObjectPath>                  AllowedSubBiomeMasks;                              // 0x0338(0x0050)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FBiomesPCGSpeciesInput>         AllowedSpecies;                                    // 0x0388(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<struct FSoftObjectPath>                  AllowedBiomesAssets;                               // 0x0398(0x0050)(Edit, NativeAccessSpecifierPublic)
	TSet<struct FSoftObjectPath>                  BlockedBiomesAssets;                               // 0x03E8(0x0050)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesPCGWorldSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesPCGWorldSettings")
	}
	static class ABiomesPCGWorldSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABiomesPCGWorldSettings>();
	}
};
DUMPER7_ASSERTS_ABiomesPCGWorldSettings;

// Class ErrantBiomesPCG.BiomesPCGWorldSubsystem
// 0x00B0 (0x00E0 - 0x0030)
class UBiomesPCGWorldSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x58];                                      // 0x0030(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class ABiomesPCGWorldSettings*                BiomesPCGWorldSettings;                            // 0x0088(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_90[0x50];                                      // 0x0090(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesPCGWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesPCGWorldSubsystem")
	}
	static class UBiomesPCGWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesPCGWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_UBiomesPCGWorldSubsystem;

}

