#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FS_Explosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FieldSystemEngine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FS_Explosion.FS_Explosion_C
// 0x0028 (0x02D8 - 0x02B0)
class AFS_Explosion_C final : public AFieldSystemActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialFalloff*                         RadialFalloff;                                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialVector*                          RadialVector;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CullingField;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FS_Explosion(int32 EntryPoint);
	void Explode();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("FS_Explosion_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FS_Explosion_C")
	}
	static class AFS_Explosion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFS_Explosion_C>();
	}
};
DUMPER7_ASSERTS_AFS_Explosion_C;

}

