#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_RemovingTemperatureFromBuilding

#include "Basic.hpp"

#include "Chimera_structs.hpp"


namespace SDK::Params
{

// Function GA_RemovingTemperatureFromBuilding.GA_RemovingTemperatureFromBuilding_C.ExecuteUbergraph_GA_RemovingTemperatureFromBuilding
// 0x0138 (0x0138 - 0x0000)
struct GA_RemovingTemperatureFromBuilding_C_ExecuteUbergraph_GA_RemovingTemperatureFromBuilding final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class UCrPlayerCharacterSpecificPossessionSettings* CallFunc_GetProfessionBasedCharacterData_Profession_Data; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetProfessionBasedCharacterData_Return;   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCrMontagePair                         K2Node_MakeStruct_CrMontagePair;                   // 0x0050(0x0010)(NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class UCrAbilityTask_PlayMontage*             CallFunc_CreatePlayMontagePairAndWaitProxy_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x00D0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00F8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x0110(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_RemovingTemperatureFromBuilding_C_ExecuteUbergraph_GA_RemovingTemperatureFromBuilding;

// Function GA_RemovingTemperatureFromBuilding.GA_RemovingTemperatureFromBuilding_C.OnCancelled_DE1FC1395847D031455AF3B86AE5B04D
// 0x0008 (0x0008 - 0x0000)
struct GA_RemovingTemperatureFromBuilding_C_OnCancelled_DE1FC1395847D031455AF3B86AE5B04D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_RemovingTemperatureFromBuilding_C_OnCancelled_DE1FC1395847D031455AF3B86AE5B04D;

// Function GA_RemovingTemperatureFromBuilding.GA_RemovingTemperatureFromBuilding_C.OnFppMontageBlendOut_DE1FC1395847D031455AF3B86AE5B04D
// 0x0008 (0x0008 - 0x0000)
struct GA_RemovingTemperatureFromBuilding_C_OnFppMontageBlendOut_DE1FC1395847D031455AF3B86AE5B04D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_RemovingTemperatureFromBuilding_C_OnFppMontageBlendOut_DE1FC1395847D031455AF3B86AE5B04D;

// Function GA_RemovingTemperatureFromBuilding.GA_RemovingTemperatureFromBuilding_C.OnFppMontageEnded_DE1FC1395847D031455AF3B86AE5B04D
// 0x0008 (0x0008 - 0x0000)
struct GA_RemovingTemperatureFromBuilding_C_OnFppMontageEnded_DE1FC1395847D031455AF3B86AE5B04D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_RemovingTemperatureFromBuilding_C_OnFppMontageEnded_DE1FC1395847D031455AF3B86AE5B04D;

// Function GA_RemovingTemperatureFromBuilding.GA_RemovingTemperatureFromBuilding_C.OnFppMontageNotifyBegin_DE1FC1395847D031455AF3B86AE5B04D
// 0x0008 (0x0008 - 0x0000)
struct GA_RemovingTemperatureFromBuilding_C_OnFppMontageNotifyBegin_DE1FC1395847D031455AF3B86AE5B04D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_RemovingTemperatureFromBuilding_C_OnFppMontageNotifyBegin_DE1FC1395847D031455AF3B86AE5B04D;

// Function GA_RemovingTemperatureFromBuilding.GA_RemovingTemperatureFromBuilding_C.OnFppMontageNotifyEnd_DE1FC1395847D031455AF3B86AE5B04D
// 0x0008 (0x0008 - 0x0000)
struct GA_RemovingTemperatureFromBuilding_C_OnFppMontageNotifyEnd_DE1FC1395847D031455AF3B86AE5B04D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_RemovingTemperatureFromBuilding_C_OnFppMontageNotifyEnd_DE1FC1395847D031455AF3B86AE5B04D;

// Function GA_RemovingTemperatureFromBuilding.GA_RemovingTemperatureFromBuilding_C.OnInterrupted_DE1FC1395847D031455AF3B86AE5B04D
// 0x0008 (0x0008 - 0x0000)
struct GA_RemovingTemperatureFromBuilding_C_OnInterrupted_DE1FC1395847D031455AF3B86AE5B04D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_RemovingTemperatureFromBuilding_C_OnInterrupted_DE1FC1395847D031455AF3B86AE5B04D;

// Function GA_RemovingTemperatureFromBuilding.GA_RemovingTemperatureFromBuilding_C.OnNotLocallyControlledTppMontageBlendOut_DE1FC1395847D031455AF3B86AE5B04D
// 0x0008 (0x0008 - 0x0000)
struct GA_RemovingTemperatureFromBuilding_C_OnNotLocallyControlledTppMontageBlendOut_DE1FC1395847D031455AF3B86AE5B04D final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_RemovingTemperatureFromBuilding_C_OnNotLocallyControlledTppMontageBlendOut_DE1FC1395847D031455AF3B86AE5B04D;

}

