#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FoodEffectProgress

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_FoodEffectProgress.WBP_FoodEffectProgress_C.ExecuteUbergraph_WBP_FoodEffectProgress
// 0x0010 (0x0010 - 0x0000)
struct WBP_FoodEffectProgress_C_ExecuteUbergraph_WBP_FoodEffectProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Value;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetProgressPercent_ProgressPercentage_ImplicitCast; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_FoodEffectProgress_C_ExecuteUbergraph_WBP_FoodEffectProgress;

// Function WBP_FoodEffectProgress.WBP_FoodEffectProgress_C.SetBlackTint
// 0x0014 (0x0014 - 0x0000)
struct WBP_FoodEffectProgress_C_SetBlackTint final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
DUMPER7_ASSERTS_WBP_FoodEffectProgress_C_SetBlackTint;

// Function WBP_FoodEffectProgress.WBP_FoodEffectProgress_C.SetGreyTint
// 0x0014 (0x0014 - 0x0000)
struct WBP_FoodEffectProgress_C_SetGreyTint final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
DUMPER7_ASSERTS_WBP_FoodEffectProgress_C_SetGreyTint;

// Function WBP_FoodEffectProgress.WBP_FoodEffectProgress_C.SetProgress
// 0x0004 (0x0004 - 0x0000)
struct WBP_FoodEffectProgress_C_SetProgress final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_FoodEffectProgress_C_SetProgress;

// Function WBP_FoodEffectProgress.WBP_FoodEffectProgress_C.SetProgressPercent
// 0x0020 (0x0020 - 0x0000)
struct WBP_FoodEffectProgress_C_SetProgressPercent final
{
public:
	double                                        ProgressPercentage;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_FoodEffectProgress_C_SetProgressPercent;

// Function WBP_FoodEffectProgress.WBP_FoodEffectProgress_C.SetWhiteTint
// 0x0014 (0x0014 - 0x0000)
struct WBP_FoodEffectProgress_C_SetWhiteTint final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
DUMPER7_ASSERTS_WBP_FoodEffectProgress_C_SetWhiteTint;

}

