#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ChimeraUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryScreen.WBP_InventoryScreen_C
// 0x0030 (0x0780 - 0x0750)
class UWBP_InventoryScreen_C final : public UCrUW_InventoryScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0750(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         WidgetBox;                                         // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               PlayerInfoSlot;                                    // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               AdditionalWidgetsSlot;                             // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               AdditionalWidgetsRightSlot;                        // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0778(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void AddAdditionalWidget(class UCrUW_ActivatableWidget* Widget);
	void AddWidgetToHBox(class UCrUW_ActivatableWidget* Widget);
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_WBP_InventoryScreen(int32 EntryPoint);
	void HideInventoryAndReplaceRightWidgets(class UCrUW_ActivatableWidget* Widget, EVerticalAlignment Align);
	void RemoveLastAddedAdditionalWidget();
	void ReplaceInventory(class UCrUW_ActivatableWidget* Widget, EVerticalAlignment Align);
	void ShowInventory();
	void ShowInventoryAndRemoveRightWidgets();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InventoryScreen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InventoryScreen_C")
	}
	static class UWBP_InventoryScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryScreen_C>();
	}
};
DUMPER7_ASSERTS_UWBP_InventoryScreen_C;

}

