#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FoodEffectProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ChimeraUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FoodEffectProgress.WBP_FoodEffectProgress_C
// 0x0028 (0x03D0 - 0x03A8)
class UWBP_FoodEffectProgress_C final : public UCrUW_HudRoundTimer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 LevelProgressBarImage;                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               LevelProgressBar;                                  // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        LevelPercent;                                      // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InnerSize;                                         // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OuterSize;                                         // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_FoodEffectProgress(int32 EntryPoint);
	void SetBlackTint();
	void SetGreyTint();
	void SetProgress(float Value);
	void SetProgressPercent(double ProgressPercentage);
	void SetWhiteTint();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_FoodEffectProgress_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_FoodEffectProgress_C")
	}
	static class UWBP_FoodEffectProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FoodEffectProgress_C>();
	}
};
DUMPER7_ASSERTS_UWBP_FoodEffectProgress_C;

}

