#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RecipesBoxWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ChimeraUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RecipesBoxWidget.WBP_RecipesBoxWidget_C
// 0x0058 (0x0470 - 0x0418)
class UWBP_RecipesBoxWidget_C final : public UCrUW_CorporationRecipes
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LevelButton;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HeaderLineCorporationLevel_C*      HeaderLine;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DropDownButton;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 A;                                                 // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   NewVar;                                            // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IgnoreFocusColor;                                  // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_CorporationRecipes_DropDownButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_CorporationRecipes_LevelButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_CorporationRecipes_LevelButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_CorporationRecipes_LevelButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void EnableLine(bool bEnabled);
	void ExecuteUbergraph_WBP_RecipesBoxWidget(int32 EntryPoint);
	void ExpandRecipes(bool bExpand);
	void SetColors(const class UCrCommonUIColorsDevSettings* Settings);
	void SetExpanded(bool bExpand);
	void SetIgnoreFocusColor(bool Value);
	void SetLevel(int32 Level);
	void SetLevelButtonFocus(bool bFocused);
	void SetLineFinished();
	void SetLowerWidth();
	void SetTitle(const class FText& InText);
	void SetWidgetTitle(const class FText& Text);
	void SetWidth(double InSize);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_RecipesBoxWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_RecipesBoxWidget_C")
	}
	static class UWBP_RecipesBoxWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RecipesBoxWidget_C>();
	}
};
DUMPER7_ASSERTS_UWBP_RecipesBoxWidget_C;

}

