#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActionBoundButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ActionBoundButton.WBP_ActionBoundButton_C.ExecuteUbergraph_WBP_ActionBoundButton
// 0x0120 (0x0120 - 0x0000)
struct WBP_ActionBoundButton_C_ExecuteUbergraph_WBP_ActionBoundButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bLong;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0060)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0068(0x0060)(HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InText;                               // 0x00D0(0x0010)(ConstParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00E0(0x0014)()
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ActionBoundButton_C_ExecuteUbergraph_WBP_ActionBoundButton;

// Function WBP_ActionBoundButton.WBP_ActionBoundButton_C.GetHeightSize
// 0x0010 (0x0010 - 0x0000)
struct WBP_ActionBoundButton_C_GetHeightSize final
{
public:
	double                                        Height;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_Height_ImplicitCast;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ActionBoundButton_C_GetHeightSize;

// Function WBP_ActionBoundButton.WBP_ActionBoundButton_C.SetLongIconText
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActionBoundButton_C_SetLongIconText final
{
public:
	bool                                          bLong;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ActionBoundButton_C_SetLongIconText;

// Function WBP_ActionBoundButton.WBP_ActionBoundButton_C.SetTemporaryIconKey
// 0x0010 (0x0010 - 0x0000)
struct WBP_ActionBoundButton_C_SetTemporaryIconKey final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_ActionBoundButton_C_SetTemporaryIconKey;

// Function WBP_ActionBoundButton.WBP_ActionBoundButton_C.SetTemporaryIconVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActionBoundButton_C_SetTemporaryIconVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ActionBoundButton_C_SetTemporaryIconVisibility;

}

