#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EncyclopediaMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_EncyclopediaMenu.WBP_EncyclopediaMenu_C.ExecuteUbergraph_WBP_EncyclopediaMenu
// 0x0018 (0x0018 - 0x0000)
struct WBP_EncyclopediaMenu_C_ExecuteUbergraph_WBP_EncyclopediaMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Category;                             // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_EncyclopediaMenu_C_ExecuteUbergraph_WBP_EncyclopediaMenu;

// Function WBP_EncyclopediaMenu.WBP_EncyclopediaMenu_C.OnCategorySelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_EncyclopediaMenu_C_OnCategorySelected final
{
public:
	class FName                                   Category;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_EncyclopediaMenu_C_OnCategorySelected;

}

