#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EncyclopediaEntryButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_EncyclopediaEntryButton.WBP_EncyclopediaEntryButton_C.ExecuteUbergraph_WBP_EncyclopediaEntryButton
// 0x0188 (0x0188 - 0x0000)
struct WBP_EncyclopediaEntryButton_C_ExecuteUbergraph_WBP_EncyclopediaEntryButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0080)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0080)(ConstParm)
	bool                                          CallFunc_GetIsSelected_ReturnValue;                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0144(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0158(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x016C(0x0014)()
	bool                                          CallFunc_GetIsEntryLocked_ReturnValue;             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_EncyclopediaEntryButton_C_ExecuteUbergraph_WBP_EncyclopediaEntryButton;

// Function WBP_EncyclopediaEntryButton.WBP_EncyclopediaEntryButton_C.OnMouseEnter
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_EncyclopediaEntryButton_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_EncyclopediaEntryButton_C_OnMouseEnter;

// Function WBP_EncyclopediaEntryButton.WBP_EncyclopediaEntryButton_C.OnMouseLeave
// 0x0080 (0x0080 - 0x0000)
struct WBP_EncyclopediaEntryButton_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_EncyclopediaEntryButton_C_OnMouseLeave;

}

