#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeaderLineEncyclopedia

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_HeaderLineEncyclopedia.WBP_HeaderLineEncyclopedia_C.ExecuteUbergraph_WBP_HeaderLineEncyclopedia
// 0x000C (0x000C - 0x0000)
struct WBP_HeaderLineEncyclopedia_C_ExecuteUbergraph_WBP_HeaderLineEncyclopedia final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HeaderLineEncyclopedia_C_ExecuteUbergraph_WBP_HeaderLineEncyclopedia;

// Function WBP_HeaderLineEncyclopedia.WBP_HeaderLineEncyclopedia_C.Set Text Size
// 0x0008 (0x0008 - 0x0000)
struct WBP_HeaderLineEncyclopedia_C_Set_Text_Size final
{
public:
	class UClass*                                 InStyle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HeaderLineEncyclopedia_C_Set_Text_Size;

// Function WBP_HeaderLineEncyclopedia.WBP_HeaderLineEncyclopedia_C.SetShowUnreadIconBP
// 0x0001 (0x0001 - 0x0000)
struct WBP_HeaderLineEncyclopedia_C_SetShowUnreadIconBP final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HeaderLineEncyclopedia_C_SetShowUnreadIconBP;

// Function WBP_HeaderLineEncyclopedia.WBP_HeaderLineEncyclopedia_C.SetTextStyle
// 0x0001 (0x0001 - 0x0000)
struct WBP_HeaderLineEncyclopedia_C_SetTextStyle final
{
public:
	bool                                          isHighlight;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HeaderLineEncyclopedia_C_SetTextStyle;

// Function WBP_HeaderLineEncyclopedia.WBP_HeaderLineEncyclopedia_C.SetTitle
// 0x0010 (0x0010 - 0x0000)
struct WBP_HeaderLineEncyclopedia_C_SetTitle final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_HeaderLineEncyclopedia_C_SetTitle;

}

