#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EncyclopediaMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ChimeraUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EncyclopediaMenu.WBP_EncyclopediaMenu_C
// 0x0038 (0x06E0 - 0x06A8)
class UWBP_EncyclopediaMenu_C final : public UCrUW_EncyclopediaMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CrInputActionWidget_C*             ScrollUpWidget;                                    // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CrInputActionWidget_C*             ScrollDownWidget;                                  // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CrInputActionWidget_C*             NavigateWidget;                                    // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CrInputActionWidget_C*             ChangeTabWidget;                                   // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BckgFrame;                                         // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bckg;                                              // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_EncyclopediaMenu(int32 EntryPoint);
	void OnCategorySelected(class FName Category);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_EncyclopediaMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_EncyclopediaMenu_C")
	}
	static class UWBP_EncyclopediaMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EncyclopediaMenu_C>();
	}
};
DUMPER7_ASSERTS_UWBP_EncyclopediaMenu_C;

}

