#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EncyclopediaInfoMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ChimeraUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EncyclopediaInfoMenu.WBP_EncyclopediaInfoMenu_C
// 0x0028 (0x0410 - 0x03E8)
class UWBP_EncyclopediaInfoMenu_C final : public UCrUW_EncyclopediaInfoMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_EncyclopediaEntryAuthor_C*         WBP_EncyclopediaEntryAuthor;                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HeaderLineBuildingInfo_C*          EntryName;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BuildingIconFrame;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BckgFrame;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ClearEntryAuthorBP();
	void Construct();
	void ExecuteUbergraph_WBP_EncyclopediaInfoMenu(int32 EntryPoint);
	void SetEntryAuthorBP(const struct FEncyclopediaEntryAuthor& AuthorData);
	void SetEntryTitleBP(const class FText& Title);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_EncyclopediaInfoMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_EncyclopediaInfoMenu_C")
	}
	static class UWBP_EncyclopediaInfoMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EncyclopediaInfoMenu_C>();
	}
};
DUMPER7_ASSERTS_UWBP_EncyclopediaInfoMenu_C;

}

