#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Inventory

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ChimeraUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_Inventory.WBP_Inventory_C.MakeButtonBrush
// 0x02E0 (0x02E0 - 0x0000)
struct WBP_Inventory_C_MakeButtonBrush final
{
public:
	ETabIcon                                      Icon;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Brush;                                             // 0x0010(0x00B0)(Parm, OutParm)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x00C0(0x00B0)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0xF];                                      // 0x0171(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue_1;       // 0x0180(0x00B0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue_2;       // 0x0230(0x00B0)()
};
DUMPER7_ASSERTS_WBP_Inventory_C_MakeButtonBrush;

}

