#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UserLoginButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "CommonUser_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UserLoginButton.WBP_UserLoginButton_C
// 0x0030 (0x03D0 - 0x03A0)
class UWBP_UserLoginButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_MenuButtonBase_C*                  LoginButton;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PlayerNumber;                                      // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PlayerStatusText;                                  // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          WaitingForLoginInput;                              // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowIfLoggedIn;                                    // 0x03C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetListenForLoginInput(bool ShouldListen);
	void RefreshLoginState();
	void IsPlayerLoggedIn(bool* Return_Value);
	void HandleUserInitialize(const class UCommonUserInfo* UserInfo, bool bSuccess, const class FText& Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext);
	void ExecuteUbergraph_WBP_UserLoginButton(int32 EntryPoint);
	void Destruct();
	void Construct();
	void BndEvt__W_UserLoginButton_W_LyraMenuButton_Modal_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_UserLoginButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_UserLoginButton_C")
	}
	static class UWBP_UserLoginButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UserLoginButton_C>();
	}
};
DUMPER7_ASSERTS_UWBP_UserLoginButton_C;

}

