#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EncyclopediaSubcategoryGrid

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ChimeraUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EncyclopediaSubcategoryGrid.WBP_EncyclopediaSubcategoryGrid_C
// 0x0030 (0x0410 - 0x03E0)
class UWBP_EncyclopediaSubcategoryGrid_C final : public UCrUW_EncyclopediaSubcategoryGrid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                LevelButton;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HeaderLineEncyclopedia_C*          HeaderLineEncyclopedia;                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DropDownButton;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Expanded;                                          // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_EncyclopediaSubcategoryGrid_DropDownButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_EncyclopediaSubcategoryGrid_LevelButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_EncyclopediaSubcategoryGrid(int32 EntryPoint);
	void SetGridExpanded(bool Expanded_0);
	void SetSubCategoryTitleBP(const class FText& Title);
	void SetSubcategoryTitleStyleBP(const bool isHighlight);
	void SetUnreadStatusIcons(bool Unread);
	void SwitchExpand();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_EncyclopediaSubcategoryGrid_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_EncyclopediaSubcategoryGrid_C")
	}
	static class UWBP_EncyclopediaSubcategoryGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EncyclopediaSubcategoryGrid_C>();
	}
};
DUMPER7_ASSERTS_UWBP_EncyclopediaSubcategoryGrid_C;

}

