#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeaderLineCorporationLevel

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_HeaderLineCorporationLevel.WBP_HeaderLineCorporationLevel_C.ExecuteUbergraph_WBP_HeaderLineCorporationLevel
// 0x0004 (0x0004 - 0x0000)
struct WBP_HeaderLineCorporationLevel_C_ExecuteUbergraph_WBP_HeaderLineCorporationLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HeaderLineCorporationLevel_C_ExecuteUbergraph_WBP_HeaderLineCorporationLevel;

// Function WBP_HeaderLineCorporationLevel.WBP_HeaderLineCorporationLevel_C.SetColors
// 0x0048 (0x0048 - 0x0000)
struct WBP_HeaderLineCorporationLevel_C_SetColors final
{
public:
	struct FLinearColor                           Orange;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Blue;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0034(0x0014)()
};
DUMPER7_ASSERTS_WBP_HeaderLineCorporationLevel_C_SetColors;

// Function WBP_HeaderLineCorporationLevel.WBP_HeaderLineCorporationLevel_C.SetLinesEnabled
// 0x0024 (0x0024 - 0x0000)
struct WBP_HeaderLineCorporationLevel_C_SetLinesEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HeaderLineCorporationLevel_C_SetLinesEnabled;

// Function WBP_HeaderLineCorporationLevel.WBP_HeaderLineCorporationLevel_C.SetTextStyle
// 0x0001 (0x0001 - 0x0000)
struct WBP_HeaderLineCorporationLevel_C_SetTextStyle final
{
public:
	bool                                          isHighlight;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_HeaderLineCorporationLevel_C_SetTextStyle;

// Function WBP_HeaderLineCorporationLevel.WBP_HeaderLineCorporationLevel_C.SetTitle
// 0x0010 (0x0010 - 0x0000)
struct WBP_HeaderLineCorporationLevel_C_SetTitle final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_HeaderLineCorporationLevel_C_SetTitle;

}

