#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CraftingRoundProgressBar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CraftingRoundProgressBar.WBP_CraftingRoundProgressBar_C.ExecuteUbergraph_WBP_CraftingRoundProgressBar
// 0x0044 (0x0044 - 0x0000)
struct WBP_CraftingRoundProgressBar_C_ExecuteUbergraph_WBP_CraftingRoundProgressBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CraftingRoundProgressBar_C_ExecuteUbergraph_WBP_CraftingRoundProgressBar;

// Function WBP_CraftingRoundProgressBar.WBP_CraftingRoundProgressBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CraftingRoundProgressBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CraftingRoundProgressBar_C_PreConstruct;

// Function WBP_CraftingRoundProgressBar.WBP_CraftingRoundProgressBar_C.SetBlackTint
// 0x0014 (0x0014 - 0x0000)
struct WBP_CraftingRoundProgressBar_C_SetBlackTint final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
DUMPER7_ASSERTS_WBP_CraftingRoundProgressBar_C_SetBlackTint;

// Function WBP_CraftingRoundProgressBar.WBP_CraftingRoundProgressBar_C.SetGreyTint
// 0x0014 (0x0014 - 0x0000)
struct WBP_CraftingRoundProgressBar_C_SetGreyTint final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
DUMPER7_ASSERTS_WBP_CraftingRoundProgressBar_C_SetGreyTint;

// Function WBP_CraftingRoundProgressBar.WBP_CraftingRoundProgressBar_C.SetProgressBrush
// 0x0024 (0x0024 - 0x0000)
struct WBP_CraftingRoundProgressBar_C_SetProgressBrush final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0014)()
};
DUMPER7_ASSERTS_WBP_CraftingRoundProgressBar_C_SetProgressBrush;

// Function WBP_CraftingRoundProgressBar.WBP_CraftingRoundProgressBar_C.SetProgressPercent
// 0x0020 (0x0020 - 0x0000)
struct WBP_CraftingRoundProgressBar_C_SetProgressPercent final
{
public:
	double                                        ProgressPercentage;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CraftingRoundProgressBar_C_SetProgressPercent;

// Function WBP_CraftingRoundProgressBar.WBP_CraftingRoundProgressBar_C.SetWhiteTint
// 0x0014 (0x0014 - 0x0000)
struct WBP_CraftingRoundProgressBar_C_SetWhiteTint final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
};
DUMPER7_ASSERTS_WBP_CraftingRoundProgressBar_C_SetWhiteTint;

// Function WBP_CraftingRoundProgressBar.WBP_CraftingRoundProgressBar_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_CraftingRoundProgressBar_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CraftingRoundProgressBar_C_Tick;

}

