#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QuickActionsContextMenu

#include "Basic.hpp"

#include "ChimeraUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_QuickActionsContextMenu.WBP_QuickActionsContextMenu_C.AddAction
// 0x0028 (0x0028 - 0x0000)
struct WBP_QuickActionsContextMenu_C_AddAction final
{
public:
	ECrUIInputActionType                          InAction;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrUW_ActionButton*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ActionButton_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_QuickActionsContextMenu_C_AddAction;

// Function WBP_QuickActionsContextMenu.WBP_QuickActionsContextMenu_C.ExecuteUbergraph_WBP_QuickActionsContextMenu
// 0x0028 (0x0028 - 0x0000)
struct WBP_QuickActionsContextMenu_C_ExecuteUbergraph_WBP_QuickActionsContextMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ActionButton_C*                    K2Node_DynamicCast_AsWBP_Action_Button;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InUsable;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ActionButton_C*                    K2Node_DynamicCast_AsWBP_Action_Button_1;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_QuickActionsContextMenu_C_ExecuteUbergraph_WBP_QuickActionsContextMenu;

// Function WBP_QuickActionsContextMenu.WBP_QuickActionsContextMenu_C.SetUsableWidget
// 0x0001 (0x0001 - 0x0000)
struct WBP_QuickActionsContextMenu_C_SetUsableWidget final
{
public:
	bool                                          InUsable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_QuickActionsContextMenu_C_SetUsableWidget;

}

