#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UserLoginButton

#include "Basic.hpp"

#include "CommonUser_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UserLoginButton.WBP_UserLoginButton_C.SetListenForLoginInput
// 0x0088 (0x0088 - 0x0000)
struct WBP_UserLoginButton_C_SetListenForLoginInput final
{
public:
	bool                                          ShouldListen;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           EmptyKeys;                                         // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKey>                           SecondaryLoginKeys;                                // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<struct FKey>                           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	TDelegate<void(const class UCommonUserInfo* UserInfo, bool bSuccess, class FText Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext)> K2Node_CreateDelegate_OutputDelegate; // 0x0038(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	struct FCommonUserInitializeParams            K2Node_MakeStruct_CommonUserInitializeParams;      // 0x0050(0x0030)(ContainsInstancedReference)
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_UserLoginButton_C_SetListenForLoginInput;

// Function WBP_UserLoginButton.WBP_UserLoginButton_C.RefreshLoginState
// 0x0038 (0x0038 - 0x0000)
struct WBP_UserLoginButton_C_RefreshLoginState final
{
public:
	bool                                          CallFunc_IsPlayerLoggedIn_Return_Value;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0018(0x0010)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_UserLoginButton_C_RefreshLoginState;

// Function WBP_UserLoginButton.WBP_UserLoginButton_C.IsPlayerLoggedIn
// 0x0028 (0x0028 - 0x0000)
struct WBP_UserLoginButton_C_IsPlayerLoggedIn final
{
public:
	bool                                          Return_Value;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonUserInitializationState                CallFunc_GetLocalPlayerInitializationState_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_UserLoginButton_C_IsPlayerLoggedIn;

// Function WBP_UserLoginButton.WBP_UserLoginButton_C.HandleUserInitialize
// 0x0028 (0x0028 - 0x0000)
struct WBP_UserLoginButton_C_HandleUserInitialize final
{
public:
	const class UCommonUserInfo*                  UserInfo;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccess;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Error;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	ECommonUserPrivilege                          RequestedPrivilege;                                // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonUserOnlineContext                      OnlineContext;                                     // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_UserLoginButton_C_HandleUserInitialize;

// Function WBP_UserLoginButton.WBP_UserLoginButton_C.ExecuteUbergraph_WBP_UserLoginButton
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_UserLoginButton_C_ExecuteUbergraph_WBP_UserLoginButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class UCommonUserInfo* UserInfo, bool bSuccess, class FText Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerLoggedIn_Return_Value;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryToLogOutUser_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class UCommonUserInfo* UserInfo, bool bSuccess, class FText Error, ECommonUserPrivilege RequestedPrivilege, ECommonUserOnlineContext OnlineContext)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0050(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FCommonUserInitializeParams            K2Node_MakeStruct_CommonUserInitializeParams;      // 0x0070(0x0030)(ContainsInstancedReference)
	class UCommonUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryToInitializeUser_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_UserLoginButton_C_ExecuteUbergraph_WBP_UserLoginButton;

// Function WBP_UserLoginButton.WBP_UserLoginButton_C.BndEvt__W_UserLoginButton_W_LyraMenuButton_Modal_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UserLoginButton_C_BndEvt__W_UserLoginButton_W_LyraMenuButton_Modal_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_UserLoginButton_C_BndEvt__W_UserLoginButton_W_LyraMenuButton_Modal_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

}

