#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventorySlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ChimeraUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventorySlot.WBP_InventorySlot_C
// 0x0040 (0x0540 - 0x0500)
class UWBP_InventorySlot_C final : public UCrUW_InventorySlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 NewItemIcon;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               NameFieldSizeBox;                                  // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NameField;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                GrayedOutOverlay;                                  // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FColor                                 BackgroundColor;                                   // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 FullStackColor;                                    // 0x052C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HighlightColor;                                    // 0x0530(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	struct FLinearColor ConvertToGrayScale(const struct FColor& InColor);
	void ExecuteUbergraph_WBP_InventorySlot(int32 EntryPoint);
	void HideFullStackIcon();
	void SetBackgroundColor(const struct FColor& InColor);
	void SetDefaultBrush();
	void SetFullStackColor(const struct FColor& InColor);
	void SetFullStackHighlight();
	void SetGrayedNames(bool bGray);
	void SetGrayScaleTex(const struct FSlateBrush& InBrush);
	void SetHighlightColor(const struct FLinearColor& InColor);
	void SetNewHighlight(bool bIsHighlighted);
	void SetSlotSize(const struct FVector2D& InSize);
	void ShowItemNameInIcon(const class FText& InText, bool Show);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InventorySlot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InventorySlot_C")
	}
	static class UWBP_InventorySlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventorySlot_C>();
	}
};
DUMPER7_ASSERTS_UWBP_InventorySlot_C;

}

