#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HeaderLine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_HeaderLine.WBP_HeaderLine_C.Set Item Data
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_HeaderLine_C_Set_Item_Data final
{
public:
	class FText                                   InName;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         InNumber;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMax;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   UIType;                                            // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FLinearColor                           Color;                                             // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLocalVar;                                       // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ItemTypeColor;                                     // 0x003C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x004C(0x0014)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0010)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0090(0x0010)()
};
DUMPER7_ASSERTS_WBP_HeaderLine_C_Set_Item_Data;

// Function WBP_HeaderLine.WBP_HeaderLine_C.Setup Split Window Version
// 0x0010 (0x0010 - 0x0000)
struct WBP_HeaderLine_C_Setup_Split_Window_Version final
{
public:
	class FText                                   ItemName_0;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_HeaderLine_C_Setup_Split_Window_Version;

// Function WBP_HeaderLine.WBP_HeaderLine_C.SetupResizeStackVersion
// 0x0010 (0x0010 - 0x0000)
struct WBP_HeaderLine_C_SetupResizeStackVersion final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_HeaderLine_C_SetupResizeStackVersion;

}

