#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToolTipWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "AuItems_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_ToolTipWidget.WBP_ToolTipWidget_C.ExecuteUbergraph_WBP_ToolTipWidget
// 0x0080 (0x0080 - 0x0000)
struct WBP_ToolTipWidget_C_ExecuteUbergraph_WBP_ToolTipWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUICraftingType                               K2Node_Event_InType;                               // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSupport_1;                           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSupport;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHideItemType;                        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Points;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0010)()
	ESlateVisibility                              K2Node_Event_InVisibility;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Event_InVisibility_1;                       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Name;                                 // 0x0038(0x0010)(ConstParm)
	int32                                         K2Node_Event_Number;                               // 0x0048(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Max;                                  // 0x004C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIItemType                                   K2Node_Event_UIType;                               // 0x0050(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsUsable;                             // 0x0051(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTypeText_ReturnValue;                  // 0x0058(0x0010)()
	struct FColor                                 CallFunc_GetTypeColor_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ToolTipWidget_C_ExecuteUbergraph_WBP_ToolTipWidget;

// Function WBP_ToolTipWidget.WBP_ToolTipWidget_C.RefreshActionBox
// 0x0030 (0x0030 - 0x0000)
struct WBP_ToolTipWidget_C_RefreshActionBox final
{
public:
	int32                                         CallFunc_GetVisibleActionsCount_Count;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ToolTipWidget_C_RefreshActionBox;

// Function WBP_ToolTipWidget.WBP_ToolTipWidget_C.SetCraftedInVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_ToolTipWidget_C_SetCraftedInVisibility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ToolTipWidget_C_SetCraftedInVisibility;

// Function WBP_ToolTipWidget.WBP_ToolTipWidget_C.SetGatheredFromVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_ToolTipWidget_C_SetGatheredFromVisibility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ToolTipWidget_C_SetGatheredFromVisibility;

// Function WBP_ToolTipWidget.WBP_ToolTipWidget_C.SetSupportTransfer
// 0x0001 (0x0001 - 0x0000)
struct WBP_ToolTipWidget_C_SetSupportTransfer final
{
public:
	bool                                          bSupport;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ToolTipWidget_C_SetSupportTransfer;

// Function WBP_ToolTipWidget.WBP_ToolTipWidget_C.SetupCraftingType
// 0x0001 (0x0001 - 0x0000)
struct WBP_ToolTipWidget_C_SetupCraftingType final
{
public:
	EUICraftingType                               InType;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ToolTipWidget_C_SetupCraftingType;

// Function WBP_ToolTipWidget.WBP_ToolTipWidget_C.SetupDataPoints
// 0x0004 (0x0004 - 0x0000)
struct WBP_ToolTipWidget_C_SetupDataPoints final
{
public:
	int32                                         Points;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ToolTipWidget_C_SetupDataPoints;

// Function WBP_ToolTipWidget.WBP_ToolTipWidget_C.SetupExpand
// 0x0001 (0x0001 - 0x0000)
struct WBP_ToolTipWidget_C_SetupExpand final
{
public:
	bool                                          bSupport;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ToolTipWidget_C_SetupExpand;

// Function WBP_ToolTipWidget.WBP_ToolTipWidget_C.SetupInfoBox
// 0x0020 (0x0020 - 0x0000)
struct WBP_ToolTipWidget_C_SetupInfoBox final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Number;                                            // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0014(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIItemType                                   UIType;                                            // 0x0018(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsable;                                          // 0x0019(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ToolTipWidget_C_SetupInfoBox;

// Function WBP_ToolTipWidget.WBP_ToolTipWidget_C.SetupMinimalVersion
// 0x0001 (0x0001 - 0x0000)
struct WBP_ToolTipWidget_C_SetupMinimalVersion final
{
public:
	bool                                          bHideItemType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ToolTipWidget_C_SetupMinimalVersion;

}

