#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EncyclopediaSubcategoryGrid

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_EncyclopediaSubcategoryGrid.WBP_EncyclopediaSubcategoryGrid_C.ExecuteUbergraph_WBP_EncyclopediaSubcategoryGrid
// 0x0028 (0x0028 - 0x0000)
struct WBP_EncyclopediaSubcategoryGrid_C_ExecuteUbergraph_WBP_EncyclopediaSubcategoryGrid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Title;                                // 0x0008(0x0010)(ConstParm)
	class UUniformGridPanel*                      CallFunc_GetUniformGridPanel_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Expanded;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Unread;                               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isHighlight;                          // 0x0024(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_EncyclopediaSubcategoryGrid_C_ExecuteUbergraph_WBP_EncyclopediaSubcategoryGrid;

// Function WBP_EncyclopediaSubcategoryGrid.WBP_EncyclopediaSubcategoryGrid_C.SetGridExpanded
// 0x0001 (0x0001 - 0x0000)
struct WBP_EncyclopediaSubcategoryGrid_C_SetGridExpanded final
{
public:
	bool                                          Expanded_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_EncyclopediaSubcategoryGrid_C_SetGridExpanded;

// Function WBP_EncyclopediaSubcategoryGrid.WBP_EncyclopediaSubcategoryGrid_C.SetSubCategoryTitleBP
// 0x0010 (0x0010 - 0x0000)
struct WBP_EncyclopediaSubcategoryGrid_C_SetSubCategoryTitleBP final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_EncyclopediaSubcategoryGrid_C_SetSubCategoryTitleBP;

// Function WBP_EncyclopediaSubcategoryGrid.WBP_EncyclopediaSubcategoryGrid_C.SetSubcategoryTitleStyleBP
// 0x0001 (0x0001 - 0x0000)
struct WBP_EncyclopediaSubcategoryGrid_C_SetSubcategoryTitleStyleBP final
{
public:
	bool                                          isHighlight;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_EncyclopediaSubcategoryGrid_C_SetSubcategoryTitleStyleBP;

// Function WBP_EncyclopediaSubcategoryGrid.WBP_EncyclopediaSubcategoryGrid_C.SetUnreadStatusIcons
// 0x0001 (0x0001 - 0x0000)
struct WBP_EncyclopediaSubcategoryGrid_C_SetUnreadStatusIcons final
{
public:
	bool                                          Unread;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_EncyclopediaSubcategoryGrid_C_SetUnreadStatusIcons;

}

