#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TooltipPrompt

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_TooltipPrompt.WBP_TooltipPrompt_C.ExecuteUbergraph_WBP_TooltipPrompt
// 0x0008 (0x0008 - 0x0000)
struct WBP_TooltipPrompt_C_ExecuteUbergraph_WBP_TooltipPrompt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSupport;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSupport_1;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TooltipPrompt_C_ExecuteUbergraph_WBP_TooltipPrompt;

// Function WBP_TooltipPrompt.WBP_TooltipPrompt_C.GetVisibleActionsCount
// 0x0040 (0x0040 - 0x0000)
struct WBP_TooltipPrompt_C_GetVisibleActionsCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TooltipPrompt_C_GetVisibleActionsCount;

// Function WBP_TooltipPrompt.WBP_TooltipPrompt_C.SetShowTooltip
// 0x0001 (0x0001 - 0x0000)
struct WBP_TooltipPrompt_C_SetShowTooltip final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TooltipPrompt_C_SetShowTooltip;

// Function WBP_TooltipPrompt.WBP_TooltipPrompt_C.SetSupportTransfer
// 0x0001 (0x0001 - 0x0000)
struct WBP_TooltipPrompt_C_SetSupportTransfer final
{
public:
	bool                                          bSupport;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TooltipPrompt_C_SetSupportTransfer;

// Function WBP_TooltipPrompt.WBP_TooltipPrompt_C.SetupExpand
// 0x0001 (0x0001 - 0x0000)
struct WBP_TooltipPrompt_C_SetupExpand final
{
public:
	bool                                          bSupport;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TooltipPrompt_C_SetupExpand;

// Function WBP_TooltipPrompt.WBP_TooltipPrompt_C.ShowExpand
// 0x0001 (0x0001 - 0x0000)
struct WBP_TooltipPrompt_C_ShowExpand final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TooltipPrompt_C_ShowExpand;

// Function WBP_TooltipPrompt.WBP_TooltipPrompt_C.ShowTooltip
// 0x0001 (0x0001 - 0x0000)
struct WBP_TooltipPrompt_C_ShowTooltip final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TooltipPrompt_C_ShowTooltip;

// Function WBP_TooltipPrompt.WBP_TooltipPrompt_C.ShowTransfer
// 0x0001 (0x0001 - 0x0000)
struct WBP_TooltipPrompt_C_ShowTransfer final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TooltipPrompt_C_ShowTransfer;

}

