#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PersonalStorageNameBig

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PersonalStorageNameBig.WBP_PersonalStorageNameBig_C.GetText
// 0x0038 (0x0038 - 0x0000)
struct WBP_PersonalStorageNameBig_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class UCrBuildingCustomNameSubsystem*         CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBuildingCustomName_ReturnValue;        // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
};
DUMPER7_ASSERTS_WBP_PersonalStorageNameBig_C_GetText;

// Function WBP_PersonalStorageNameBig.WBP_PersonalStorageNameBig_C.SetHeight
// 0x0018 (0x0018 - 0x0000)
struct WBP_PersonalStorageNameBig_C_SetHeight final
{
public:
	int32                                         InHeight;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PersonalStorageNameBig_C_SetHeight;

// Function WBP_PersonalStorageNameBig.WBP_PersonalStorageNameBig_C.UpdateName
// 0x0040 (0x0040 - 0x0000)
struct WBP_PersonalStorageNameBig_C_UpdateName final
{
public:
	class ACrBuildingActorBase*                   Owning_Building;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	class UCrBuildingCustomNameSubsystem*         CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBuildingCustomName_ReturnValue;        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0010)()
};
DUMPER7_ASSERTS_WBP_PersonalStorageNameBig_C_UpdateName;

}

