#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Ranged_Tier2_LOD0

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "MassAIPrototypeEnemyRuntime_structs.hpp"
#include "MassAIPrototypeEnemyRuntime_classes.hpp"
#include "ABP_Ranged_Tier2_LOD0_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Ranged_Tier2_LOD0.ABP_Ranged_Tier2_LOD0_C
// 0x4C40 (0x51E0 - 0x05A0)
class UABP_Ranged_Tier2_LOD0_C final : public UMassEnemyAnimationInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Ranged_Tier2_LOD0::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x05A8(0x00D0)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0678(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0680(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0688(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_105;                // 0x06A8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_104;                // 0x06D8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_103;                // 0x0708(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_102;                // 0x0738(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_101;                // 0x0768(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_100;                // 0x0798(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_99;                 // 0x07C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98;                 // 0x07F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97;                 // 0x0828(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96;                 // 0x0858(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_95;                 // 0x0888(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94;                 // 0x08B8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93;                 // 0x08E8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92;                 // 0x0918(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91;                 // 0x0948(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_71;                   // 0x0978(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_36;                  // 0x09C0(0x0050)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x0A10(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_70;                   // 0x0A60(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_69;                   // 0x0AA8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_68;                   // 0x0AF0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67;                   // 0x0B38(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_66;                   // 0x0B80(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65;                   // 0x0BC8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_64;                   // 0x0C10(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x0C58(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_61;                      // 0x0CA8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_63;                   // 0x0CC8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x0D10(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_60;                      // 0x0D60(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_62;                   // 0x0D80(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_61;                   // 0x0DC8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60;                   // 0x0E10(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0x0E58(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x0EA0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x0EE8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x0F30(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x0F78(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x0FB8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x1000(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x1048(0x0050)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_35;                  // 0x1098(0x0050)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x10E8(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_59;                      // 0x1138(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x1158(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_58;                      // 0x11C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x11E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_57;                      // 0x1230(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x1250(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_90;                 // 0x12C0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89;                 // 0x12F0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88;                 // 0x1320(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87;                 // 0x1350(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86;                 // 0x1380(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85;                 // 0x13B0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84;                 // 0x13E0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_83;                 // 0x1410(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x1440(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_56;                      // 0x1488(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x14A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_55;                      // 0x14F0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x1510(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_54;                      // 0x1558(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x1578(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53;                      // 0x15C0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x15E0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x1628(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_34;                  // 0x1670(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_82;                 // 0x16C0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81;                 // 0x16F0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80;                 // 0x1720(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79;                 // 0x1750(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78;                 // 0x1780(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0x17B0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0x17E0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0x1810(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0x1840(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0x1870(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0x18A0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0x18D0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x1900(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_33;                  // 0x1948(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_52;                      // 0x1998(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x19B8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_32;                  // 0x1A00(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_51;                      // 0x1A50(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x1A70(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_31;                  // 0x1AB8(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_50;                      // 0x1B08(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x1B28(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_30;                  // 0x1B70(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_49;                      // 0x1BC0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x1BE0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_29;                  // 0x1C28(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48;                      // 0x1C78(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x1C98(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47;                      // 0x1CE0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x1D00(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_28;                  // 0x1D48(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0x1D98(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0x1DB8(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_27;                  // 0x1E80(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0x1ED0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0x1EF0(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_26;                  // 0x1FB8(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0x2008(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x2028(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0x2098(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0x20C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0x20F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0x2128(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x2158(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x2188(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x21B8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x21E8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x2218(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0x2260(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x2280(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0x22C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x22E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0x2330(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x2350(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0x2398(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x23B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x2400(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_25;                  // 0x2448(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x2498(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x24C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x24F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x2528(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x2558(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x2588(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x25B8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x25E8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x2618(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x2648(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x2678(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x26A8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x26D8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_24;                  // 0x2720(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0x2770(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x2790(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_23;                  // 0x27D8(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0x2828(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x2848(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_22;                  // 0x2890(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0x28E0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x2900(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_21;                  // 0x2948(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0x2998(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x29B8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_20;                  // 0x2A00(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x2A50(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x2A70(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x2AB8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27;                   // 0x2AD8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_19;                  // 0x2B20(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0x2B70(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x2B90(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_18;                  // 0x2C58(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0x2CA8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x2CC8(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_17;                  // 0x2D90(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x2DE0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x2E00(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x2E30(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x2E60(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x2E90(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x2EC0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x2EF0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x2F20(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x2F50(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26;                   // 0x2F80(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x2FC8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25;                   // 0x2FE8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x3030(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24;                   // 0x3050(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x3098(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23;                   // 0x30B8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0x3100(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22;                   // 0x3120(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21;                   // 0x3168(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_16;                  // 0x31B0(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x3200(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x3230(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x3260(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x3290(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x32C0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x32F0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x3320(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x3350(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x3380(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x33B0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x33E0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x3410(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20;                   // 0x3440(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_15;                  // 0x3488(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x34D8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19;                   // 0x34F8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_14;                  // 0x3540(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x3590(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18;                   // 0x35B0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_13;                  // 0x35F8(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x3648(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17;                   // 0x3668(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0x36B0(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0x3700(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16;                   // 0x3720(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0x3768(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x37B8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x37D8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x3820(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x3840(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x3888(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x38D8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x38F8(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x39C0(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0x3A10(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x3A30(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x3AF8(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x3B68(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x3BB8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x3BD8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x3C08(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x3C38(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x3C68(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x3C98(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x3CC8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x3CF8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x3D28(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x3D58(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x3DA0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x3DC0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x3E08(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x3E28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x3E70(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x3E90(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x3ED8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x3EF8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x3F40(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x3F88(0x0050)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x3FD8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x4008(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x4038(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x4068(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x4098(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x40C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x40F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x4128(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x4158(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x4188(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x41B8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x41E8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x4218(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x4260(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x42B0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x42D0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x4318(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x4368(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x4388(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x43D0(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x4420(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x4440(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x4488(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x44D8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x44F8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x4540(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x4590(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x45B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x45F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x4618(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x4660(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x46B0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x46D0(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x4798(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x47E8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x4808(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x48D0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x48F0(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x49B8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x4A00(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x4A30(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x4A60(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x4A90(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x4AC0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x4AF0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x4B20(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x4B50(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x4B80(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x4BB0(0x0030)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x4BE0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x4C20(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x4C40(0x0030)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x4C70(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x4CB0(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x4CD0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x4D10(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x4D30(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x4D70(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x4D90(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x4DD0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x4DF0(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x4EB8(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x4F80(0x0048)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x4FC8(0x00D0)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x5098(0x0118)()
	double                                        Random_Float_01;                                   // 0x51B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InjuriedPoseAlpha;                                 // 0x51B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JumpBackMidPlaybackRatio;                          // 0x51C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          JumpBackMidSequence;                               // 0x51C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsJumpingBack;                                    // 0x51D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51D1[0x7];                                     // 0x51D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AttackAnimStartPosition;                           // 0x51D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_DeathVO_Start();
	void AnimNotify_EndAnim();
	void AnimNotify_EndAttack();
	void AnimNotify_Jumped();
	void AnimNotify_Landed();
	void AnimNotify_SFX_TauntStart();
	void AttackConduitOnUpdate(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void BPOnDamageReceived();
	void BPOnLocomotionTypeChanged(ECrEnemyLocomotionType OldLocomotionType, ECrEnemyLocomotionType NewLocomotionType);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Ranged_Tier2_LOD0_AnimGraphNode_BlendListByBool_02F92B0348ED575CD1501D939C046726();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Ranged_Tier2_LOD0_AnimGraphNode_BlendListByBool_19EA5707487729EE43EF569B370BABBE();
