#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Melee_Tier2_Actor

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "ABP_Melee_Tier2_Actor_structs.hpp"
#include "MassAIPrototypeEnemyRuntime_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Melee_Tier2_Actor.ABP_Melee_Tier2_Actor_C
// 0x0FA0 (0x1540 - 0x05A0)
class UABP_Melee_Tier2_Actor_C final : public UMassEnemyAnimationInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Melee_Tier2_Actor::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x05A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x05B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x05C0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05C8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x05E8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x0618(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x0648(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x0678(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x06A8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x06D8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x0708(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x0738(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x0768(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x0798(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x07C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x07F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x0828(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x0858(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x0888(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x08B8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x08E8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x0918(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x0948(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0978(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x09C0(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x09E0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0A20(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0A68(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0AB0(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x0B00(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0B20(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x0B90(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0BB0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x0C20(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0C40(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x0C88(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0CA8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x0CF0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0D10(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x0D58(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0D78(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0DC0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x0DE0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x0E10(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0E40(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0E88(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0EA8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0F70(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0FB8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0FE8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x1018(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1048(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1078(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x10A8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x10D8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1108(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1138(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1168(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1198(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x11E0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1200(0x0030)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x1230(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1270(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x1290(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x12D0(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x12F0(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1330(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x1350(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1390(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x13B0(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x1478(0x00C8)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_AnimationFinishedEvent();
	void AnimNotify_DealDamage();
	void AnimNotify_DeathVO_Start();
	void AnimNotify_EndAnimAction();
	void AnimNotify_Jumped();
	void AttackConduitOnUpdate(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_00EF484F4941472FC33517894AFE0EE3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_14884461451703EB2A3FD392A90A3F42();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_274908FA4CF924D6BBD51F9821759F67();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_3231B353473F0A3A8A309AA3076DDAF9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_39AD80FB40283A27247468AD84D974BB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_500FB6344564E24292104A9ED33915AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_514F0DC24A3BAA84EE24C6AB5A2BE026();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_52E338C54744D8B7115DF9A8F9EEED3C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_53986D5C4ECDB16FFEED249B145731A7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_5AE40ED34758058493D705BAA61FC57E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_612F397A45E434381FBDF8AA8867DC56();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_6366B552465F8F71FA8EE4AE37BC73C5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_6B30E9A0498544B6295BC19A671648F0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_6B9E69934599E6DB4830548334931707();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_8B14CB6045D42DCF544A6283F25A3681();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_8BD3032A4F127DC0174C9BBFD3A8E634();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_8F38C5AA4F1975C41700B6A59DA262EB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_9900E41A498F9C963359EABE450FD4E8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_A3EA44E74767D290BF6C7BBD14111D20();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_A983B0184F179581352785914D3DD980();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_B9FCCE74497B0926D8720AA4877452D8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_CB8E78D74E4CA9F9F985CFACD5D87352();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_D0A1179D4A48BB930A419C925D645AC9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_D2E43B334C113B2C6BA8209F22FDF563();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_E04FC2C04C5A792DC1278083CDC4CB90();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_EE70BD82475E326A2684DA970E3F5591();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Melee_Tier2_Actor_AnimGraphNode_TransitionResult_EF1FCDD1441BE72D031E67A1D6F1A7DB();
	void ExecuteUbergraph_ABP_Melee_Tier2_Actor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Melee_Tier2_Actor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Melee_Tier2_Actor_C")
	}
	static class UABP_Melee_Tier2_Actor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Melee_Tier2_Actor_C>();
	}
};
DUMPER7_ASSERTS_UABP_Melee_Tier2_Actor_C;

}

