#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuCamera

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "AuCamera_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class AuCamera.AuCameraInterface
// 0x0000 (0x0000 - 0x0000)
class IAuCameraInterface final
{
public:
	void AddAdditiveModifier(const struct FAuCameraAdditiveHandle& InNewConfig);
	void RemoveAdditiveModifier(const struct FAuCameraAdditiveHandle& InNewConfig);
	void SetCameraConfig(const struct FAuCameraConfigSelect& InNewConfig);
	void SetCameraDefaults();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuCameraInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuCameraInterface")
	}
	static class IAuCameraInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAuCameraInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAuCameraInterface;

// Class AuCamera.AuCameraSettings
// 0x0110 (0x0148 - 0x0038)
class UAuCameraSettings final : public UDeveloperSettings
{
public:
	bool                                          bUseSocket;                                        // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketName;                                        // 0x003C(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SocketInterpolationSpeed;                          // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinPossibleFOV;                                    // 0x0048(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPossibleFOV;                                    // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGetDefaultsFromCharacter;                         // 0x0050(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuCameraConfig                        DefaultCameraOverride;                             // 0x0058(0x0050)(Edit, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FAuCameraConfig>     CameraOverrides;                                   // 0x00A8(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	TMap<class FName, struct FAuCameraConfig>     CameraAdditiveModifiers;                           // 0x00F8(0x0050)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuCameraSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuCameraSettings")
	}
	static class UAuCameraSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuCameraSettings>();
	}
};
DUMPER7_ASSERTS_UAuCameraSettings;

// Class AuCamera.AuPlayerCameraManager
// 0x0270 (0x2A60 - 0x27F0)
class AAuPlayerCameraManager : public APlayerCameraManager
{
public:
	uint8                                         Pad_27F0[0x8];                                     // 0x27F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x27F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	struct FAuCameraConfig                        OldConfig;                                         // 0x2800(0x0050)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAuCameraConfig                        StackedAdditiveModifiers;                          // 0x2850(0x0050)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LastModifierFovInterpolationSpeed;                 // 0x28A0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_28A4[0x4];                                     // 0x28A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuCameraConfig                        DefaultCameraSettings;                             // 0x28A8(0x0050)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_28F8[0x118];                                   // 0x28F8(0x0118)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuCameraConfig                        CurrentConfig;                                     // 0x2A10(0x0050)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuPlayerCameraManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuPlayerCameraManager")
	}
	static class AAuPlayerCameraManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAuPlayerCameraManager>();
	}
};
DUMPER7_ASSERTS_AAuPlayerCameraManager;

}

