#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuGameplay

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "AuGameplay_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class AuGameplay.AuAddEffectVolume
// 0x0018 (0x0308 - 0x02F0)
class AAuAddEffectVolume final : public APhysicsVolume
{
public:
	TArray<TSubclassOf<class UGameplayEffect>>    EffectsToApply;                                    // 0x02F0(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                          bRemoveOnLeave;                                    // 0x0300(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuAddEffectVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuAddEffectVolume")
	}
	static class AAuAddEffectVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAuAddEffectVolume>();
	}
};
DUMPER7_ASSERTS_AAuAddEffectVolume;

// Class AuGameplay.AuAddRemoveEffectVolume
// 0x0058 (0x0348 - 0x02F0)
class AAuAddRemoveEffectVolume final : public APhysicsVolume
{
public:
	TSubclassOf<class UGameplayEffect>            GameplayEffectClass;                               // 0x02F0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class AActor*, struct FActiveGameplayEffectHandle> AppliedEffectsMap;                       // 0x02F8(0x0050)(Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuAddRemoveEffectVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuAddRemoveEffectVolume")
	}
	static class AAuAddRemoveEffectVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAuAddRemoveEffectVolume>();
	}
};
DUMPER7_ASSERTS_AAuAddRemoveEffectVolume;

// Class AuGameplay.AuGameplayBPF
// 0x0000 (0x0028 - 0x0028)
class UAuGameplayBPF final : public UBlueprintFunctionLibrary
{
public:
	static void ActorMassLessThan(class AActor* InActor, float LessThan, ENxComparsionResult* Result);
	static float GetMass(class AActor* InActor);
	static class UStaticMesh* GetStaticMesh(class AActor* InActor);
	static class UStaticMeshComponent* GetStaticMeshComponent(class AActor* InActor);
	static void MoveStaticMesh(class UStaticMeshComponent* From, class UStaticMeshComponent* To);
	static void MoveStaticMeshActor(class AActor* From, class AActor* To);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuGameplayBPF")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuGameplayBPF")
	}
	static class UAuGameplayBPF* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuGameplayBPF>();
	}
};
DUMPER7_ASSERTS_UAuGameplayBPF;

}

