#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Exploder_Tier1_Actor_Character

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BaseAI_classes.hpp"
#include "AuActorPlacement_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Exploder_Tier1_Actor_Character.BP_Exploder_Tier1_Actor_Character_C
// 0x0070 (0x0C70 - 0x0C00)
class ABP_Exploder_Tier1_Actor_Character_C final : public ABP_BaseAI_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Exploder_Tier1_Actor_Character_C; // 0x0BF8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Enemy_tendrils_B;                               // 0x0C00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0C08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraEyes;                                       // 0x0C10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExploderStateSyncComponent*            ExploderStateSync;                                 // 0x0C18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Weakpoint;                                         // 0x0C20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Exploder_top;                                   // 0x0C28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SFX_Pulse;                                         // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FAuAPMassSpawnedEntityType             ExplosionSphereEntity;                             // 0x0C38(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CanChangeEyeColor(bool* Result);
	void ExecuteUbergraph_BP_Exploder_Tier1_Actor_Character(int32 EntryPoint);
	void OnAiDied(const struct FHitResult& HitResult, const struct FGameplayTag& KillingDamageTag);
	void OnDiedFromGas(const struct FHitResult& LastHit, const struct FGameplayTag& KillingDamageTag);
	void OnEnableActivationTimer();
	void OnEnableExplosionTimer();
	void ReceiveTick(float DeltaSeconds);
	void SetIsAggroEyeColor(bool NewIsAggro);
	void SetIsBoostedEyeColor(bool NewIsBoosted);
	void StartActivationTimer();
	void StartExplosionTimer();
	void TryApplySpeedup();
	void TryApplySpeedupRemoveActivator();
	void UserConstructionScript();

	bool IsExploderDead() const;
	bool ShouldSpawnHugeCollision() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Exploder_Tier1_Actor_Character_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Exploder_Tier1_Actor_Character_C")
	}
	static class ABP_Exploder_Tier1_Actor_Character_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Exploder_Tier1_Actor_Character_C>();
	}
};
DUMPER7_ASSERTS_ABP_Exploder_Tier1_Actor_Character_C;

}

