#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SkyboxWithStar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_structs.hpp"
#include "Chimera_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SkyboxWithStar.BP_SkyboxWithStar_C
// 0x08A8 (0x0B98 - 0x02F0)
class ABP_SkyboxWithStar_C final : public ACrEnviroSkyboxActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstanceConstant*              M_SkyInstanceConstant;                             // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SunOnSkyboxMI;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SkyboxSphereMI;                                    // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Follow_Player;                                     // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Capture_Flares;                                    // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarRaysLongBurnCurves;                     // 0x0318(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StarRaysLongBurnDefaultValue;                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarRaysLongEmmisiveCurves;                 // 0x0370(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StarRaysLongEmmisiveDefaultValue;                  // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarRaysLongRaysMaxDistanceCurves;          // 0x03C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StarRaysLongRaysMaxDistanceDefaultValue;           // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarRaysShortBurnCurves;                    // 0x0420(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StarRaysShortBurnDefaultValue;                     // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarRaysShortEmmisiveCurves;                // 0x0478(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StarRaysShortEmmisiveDefaultValue;                 // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarRaysAtmosphereBurnCurves;               // 0x04D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StarRaysAtmosphereBurnDefaultValue;                // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarRaysAtmosphereEmmisiveCurves;           // 0x0528(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StarRaysAtmosphereEmmisiveDefaultValue;            // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarRaysLongTemperatureSunCurves;           // 0x0580(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarMeshBurnCurves;                         // 0x05D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StarMeshBurnDefaultValue;                          // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarMeshFresnelExpCurves;                   // 0x0628(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        StarMeshFresnelExpDefaultValue;                    // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> AuroraSunPlaneReplaceOutsideCPowerCurves;   // 0x0680(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         AuroraSunPlaneOutsideCPowerDefaultValue;           // 0x06D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D4[0x4];                                      // 0x06D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> AuroraSunPlaneReplaceCoronaAmpCurves;       // 0x06D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        AuroraSunPlaneCoronaAmpDefaultValue;               // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> AuroraSunPlaneReplaceCorona_y_Curves;       // 0x0730(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        AuroraSunPlaneCorona_y_DefaultValue;               // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> HorizonStarFireReplaceOutsideCPowerCurves;  // 0x0788(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         HorizonStarFireOutsideCPowerDefaultValue;          // 0x07D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DC[0x4];                                      // 0x07DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> HorizonStarFireReplaceCoronaSpeedCurves;    // 0x07E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        HorizonStarFireCoronaSpeedDefaultValue;            // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> HorizonStarFireReplaceDischargePanSpeedCurves; // 0x0838(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        HorizonStarFireDischargePanSpeedDefaultValue;      // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> HorizonStarFireReplaceCoronaAmp;            // 0x0890(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         HorizonStarFireDefaultValue;                       // 0x08E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E4[0x4];                                      // 0x08E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               NewVar;                                            // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Pan_Speed;                                         // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SolarFlaresSpanwer;                                // 0x08F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_SolarFlaresForCapture_C*            Spawned_Solar_Flares;                              // 0x0900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SunRayRT_Texture_MI;                               // 0x0908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     SunRayRT_Texture_M;                                // 0x0910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 SunRayRT_Texture;                                  // 0x0918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Star_Texture_Tilling;                              // 0x0920(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Uv_Offset;                                         // 0x0930(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> SolarFlareVisibilityCurves;                 // 0x0940(0x0050)(Edit, BlueprintVisible)
	double                                        SolarFlareVisibilityDefaultValue;                  // 0x0990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      SunDisplaceMaterial;                               // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 SunDisplaceRT_Texture;                             // 0x09A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        StarRaysLongTemperatureSunDefaultValue;            // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarRaysDistanceCurves;                     // 0x09B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarRaysOpacity;                            // 0x0A00(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Progress;                                          // 0x0A50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWave                                   Wave_Type;                                         // 0x0A54(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnviroWaveStage                              Wave_Stage;                                        // 0x0A55(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A56[0x2];                                      // 0x0A56(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarRaysAtmosphereSmoothCeilRampCurves;     // 0x0A58(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> GradientCurves;                             // 0x0AA8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> HotEmmMultiplyCurves;                       // 0x0AF8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> StarRaysSteps;                              // 0x0B48(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UserConstructionScript();
	void UpdateStarMaterial();
	void UpdateRTMaterials();
	void ReceiveBeginPlay();
	void OnEnviroWaveTick(EEnviroWave WaveType, EEnviroWaveStage WaveStage, const struct FCrEnviroWaveSettings& WaveSettings, float WaveProgress);
	void OnEnviroWaveFinished(EEnviroWave WaveType, const struct FCrEnviroWaveSettings& WaveSettings);
	void OnEnviroWaveCanceled(EEnviroWave WaveType, EEnviroWaveStage WaveStage, const struct FCrEnviroWaveSettings& WaveSettings);
	void InitializeRTMaterials();
	void ExecuteUbergraph_BP_SkyboxWithStar(int32 EntryPoint);
	void EveryFrameEvent();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SkyboxWithStar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SkyboxWithStar_C")
	}
	static class ABP_SkyboxWithStar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SkyboxWithStar_C>();
	}
};
DUMPER7_ASSERTS_ABP_SkyboxWithStar_C;

}

