#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tutorial_intro_cutscene

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Tutorial_intro_cutscene.BP_Tutorial_intro_cutscene_C.ExecuteUbergraph_BP_Tutorial_intro_cutscene
// 0x0060 (0x0060 - 0x0000)
struct BP_Tutorial_intro_cutscene_C_ExecuteUbergraph_BP_Tutorial_intro_cutscene final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCrHeroComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0018)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Tutorial_intro_cutscene_C_ExecuteUbergraph_BP_Tutorial_intro_cutscene;

}

