#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPW_List.BPW_List_C
// 0x0060 (0x0400 - 0x03A0)
class UBPW_List_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             txt_label;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        l_items;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x03B8(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         OPTIONS;                                           // 0x03C8(0x0010)(Edit, BlueprintVisible)
	int32                                         selected_id;                                       // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        dropdown_padding;                                  // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              SelectionChanged;                                  // 0x03E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UpdateState(bool IsEnabled, int32 EnabledID, int32 DisabledID);
	void SetSelectedOption(const class FString& OptionName, int32 OptionID);
	void SetDisabled(bool Is_Disabled);
	void PreConstruct(bool IsDesignTime);
	void GetSelectedOption(int32* OptionID, class FString* OptionLabel);
	void ExecuteUbergraph_BPW_List(int32 EntryPoint);
	void BndEvt__BPW_List_l_items_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void AddOption(const class FString& Option);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPW_List_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPW_List_C")
	}
	static class UBPW_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPW_List_C>();
	}
};
DUMPER7_ASSERTS_UBPW_List_C;

}

