#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_RT_Toggle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPW_RT_Toggle.BPW_RT_Toggle_C
// 0x0040 (0x03E0 - 0x03A0)
class UBPW_RT_Toggle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             txt_rtx_stat;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_Button_C*                          btn_rtx;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       TransWipe;                                         // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              RTToggled;                                         // 0x03C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsRTXEnabled;                                      // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPW_RT_Toggle(int32 EntryPoint);
	void Construct();
	void BndEvt__BPW_RT_Toggle_btn_rtx_K2Node_ComponentBoundEvent_0_ButtonClicked__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPW_RT_Toggle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPW_RT_Toggle_C")
	}
	static class UBPW_RT_Toggle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPW_RT_Toggle_C>();
	}
};
DUMPER7_ASSERTS_UBPW_RT_Toggle_C;

}

