#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_GapAttackUpdate

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTService_GapAttackUpdate.BTService_GapAttackUpdate_C
// 0x0148 (0x01E0 - 0x0098)
class UBTService_GapAttackUpdate_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TimeBetweenGlowAndAttack;                          // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTimeForAttack;                                  // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxAngle;                                          // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinTimeSinceLastAttack;                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 TargetActor;                                       // 0x00B8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 CanDoJumpAttack;                                   // 0x00E0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 InJumpAttackMinDistance;                           // 0x0108(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 InJumpAttackMaxDistance;                           // 0x0130(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 ShouldWalkBack;                                    // 0x0158(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 ReadyForGapAttack;                                 // 0x0180(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 LastAttackTimestamp;                               // 0x01A8(0x0028)(Edit, BlueprintVisible)
	class AMassEnemyCharacterBase*                ControlledEnemy;                                   // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitForActivation;                                 // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CanPerformGapAttack(bool* Result);
	void ExecuteUbergraph_BTService_GapAttackUpdate(int32 EntryPoint);
	void OnActivateGapAttack();
	void OnDeactivateGapAttack();
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTService_GapAttackUpdate_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTService_GapAttackUpdate_C")
	}
	static class UBTService_GapAttackUpdate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_GapAttackUpdate_C>();
	}
};
DUMPER7_ASSERTS_UBTService_GapAttackUpdate_C;

}

