#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrAiMeleeRuntime

#include "Basic.hpp"

#include "MassAIPrototypeEnemyRuntime_structs.hpp"
#include "MassAIBehavior_structs.hpp"
#include "MassReplication_structs.hpp"
#include "MassEntity_structs.hpp"


namespace SDK
{

// ScriptStruct CrAiMeleeRuntime.ReplicatedMeleeVertexAnimationData
// 0x0008 (0x0008 - 0x0000)
struct FReplicatedMeleeVertexAnimationData final
{
public:
	bool                                          bShouldPlayHitReaction;                            // 0x0000(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         CurrentAimStateID;                                 // 0x0001(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EnterStateTimestamp;                               // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FReplicatedMeleeVertexAnimationData;

// ScriptStruct CrAiMeleeRuntime.ReplicatedMeleeAgent
// 0x00D0 (0x00F8 - 0x0028)
struct FReplicatedMeleeAgent final : public FReplicatedAgentBase
{
public:
	struct FCrMassEnemyReplicatedAgentPositionYawData PositionYaw;                                   // 0x0028(0x0020)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	struct FReplicatedMeleeVertexAnimationData    VertexAnimationData;                               // 0x0048(0x0008)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	struct FMassEnemyCommonReplicationData        CommonReplicationData;                             // 0x0050(0x0050)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	struct FMassEnemyRagdollReplicationData       RagdollReplicationData;                            // 0x00A0(0x0040)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	struct FMassEnemyFrequentlyReplicatedData     FrequentlyReplicatedData;                          // 0x00E0(0x0018)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FReplicatedMeleeAgent;

// ScriptStruct CrAiMeleeRuntime.MeleeFastArrayItem
// 0x00F8 (0x0108 - 0x0010)
struct FMeleeFastArrayItem final : public FMassFastArrayItemBase
{
public:
	struct FReplicatedMeleeAgent                  Agent;                                             // 0x0010(0x00F8)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMeleeFastArrayItem;

// ScriptStruct CrAiMeleeRuntime.MeleeClientBubbleSerializer
// 0x01C0 (0x02F8 - 0x0138)
struct FMeleeClientBubbleSerializer final : public FMassClientBubbleSerializerBase
{
public:
	uint8                                         Pad_138[0x1B0];                                    // 0x0138(0x01B0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMeleeFastArrayItem>            Ais;                                               // 0x02E8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FMeleeClientBubbleSerializer;

// ScriptStruct CrAiMeleeRuntime.MeleeTier0Tag
// 0x0000 (0x0001 - 0x0001)
struct FMeleeTier0Tag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMeleeTier0Tag;

// ScriptStruct CrAiMeleeRuntime.MeleeTier1Tag
// 0x0000 (0x0001 - 0x0001)
struct FMeleeTier1Tag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMeleeTier1Tag;

// ScriptStruct CrAiMeleeRuntime.MeleeTier3Tag
// 0x0000 (0x0001 - 0x0001)
struct FMeleeTier3Tag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMeleeTier3Tag;

// ScriptStruct CrAiMeleeRuntime.MeleeTier0LodGroupTag
// 0x0000 (0x0001 - 0x0001)
struct FMeleeTier0LodGroupTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMeleeTier0LodGroupTag;

// ScriptStruct CrAiMeleeRuntime.MeleeTier1LodGroupTag
// 0x0000 (0x0001 - 0x0001)
struct FMeleeTier1LodGroupTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMeleeTier1LodGroupTag;

// ScriptStruct CrAiMeleeRuntime.MeleeTier2LodGroupTag
// 0x0000 (0x0001 - 0x0001)
struct FMeleeTier2LodGroupTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMeleeTier2LodGroupTag;

// ScriptStruct CrAiMeleeRuntime.MeleeTier3LodGroupTag
// 0x0000 (0x0001 - 0x0001)
struct FMeleeTier3LodGroupTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FMeleeTier3LodGroupTag;

// ScriptStruct CrAiMeleeRuntime.MeleeStateEvaluatorInstanceData
// 0x0014 (0x0014 - 0x0000)
struct FMeleeStateEvaluatorInstanceData final
{
public:
	float                                         MinAttackDistance;                                 // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAttackDistance;                                 // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinPreferredToTargetDistance;                      // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPreferredToTargetDistance;                      // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttackAngle;                                       // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMeleeStateEvaluatorInstanceData;

// ScriptStruct CrAiMeleeRuntime.MeleeStateEvaluator
// 0x0018 (0x0038 - 0x0020)
struct FMeleeStateEvaluator final : public FMassStateTreeEvaluatorBase
{
public:
	float                                         MinAttackDistance;                                 // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxAttackDistance;                                 // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinPreferredToTargetDistance;                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxPreferredToTargetDistance;                      // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AttackAngle;                                       // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMeleeStateEvaluator;

}

