#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrantLandscapeRuntime

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"
#include "ErrantLandscapeRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ErrantLandscapeRuntime.ElProjectSettings
// 0x0008 (0x0040 - 0x0038)
class UElProjectSettings final : public UDeveloperSettings
{
public:
	bool                                          bEnableRuntimeLandscape;                           // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableRuntimeNavigationUpdates;                   // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElProjectSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElProjectSettings")
	}
	static class UElProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElProjectSettings>();
	}
};
DUMPER7_ASSERTS_UElProjectSettings;

// Class ErrantLandscapeRuntime.ElRtBrushComponent
// 0x0020 (0x0530 - 0x0510)
#pragma pack(push, 0x1)
class alignas(0x10) UElRtBrushComponent : public UPrimitiveComponent
{
public:
	uint8                                         Pad_510[0x8];                                      // 0x0510(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UElRtWorldSubsystem*                    RtSubsystem;                                       // 0x0518(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	int32                                         BrushPriority;                                     // 0x0520(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBrushPriority(int32 InBrushPriority);

	int32 GetBrushPriority() const;
	void UpdateLandscape() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtBrushComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtBrushComponent")
	}
	static class UElRtBrushComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElRtBrushComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UElRtBrushComponent;

// Class ErrantLandscapeRuntime.ElRtBrushInterface
// 0x0000 (0x0000 - 0x0000)
class IElRtBrushInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtBrushInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtBrushInterface")
	}
	static class IElRtBrushInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IElRtBrushInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IElRtBrushInterface;

// Class ErrantLandscapeRuntime.ElRtBrushSystemInterface
// 0x0000 (0x0000 - 0x0000)
class IElRtBrushSystemInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtBrushSystemInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtBrushSystemInterface")
	}
	static class IElRtBrushSystemInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IElRtBrushSystemInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IElRtBrushSystemInterface;

// Class ErrantLandscapeRuntime.ElRtDataTransferComponent
// 0x0070 (0x0128 - 0x00B8)
class UElRtDataTransferComponent final : public UActorComponent
{
public:
	int32                                         MaxChunkSizeInBytes;                               // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNumOfPacketsInFlight;                           // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x64];                                      // 0x00C0(0x0064)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bLog;                                              // 0x0124(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisplayLogsToScreen;                              // 0x0125(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisplayTransferProgressToScreen;                  // 0x0126(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_127[0x1];                                      // 0x0127(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientEndTransfer(const struct FIntPoint& LandscapeCompIdx);
	void ClientNotifyOfAllTransfers(int32 TotalDataSize, int32 TransferCount);
	void ClientStartTransfer(const struct FIntPoint& LandscapeCompIdx, const class FString& WeightmapName);
	void ClientTransferDataChunk(const TArray<uint8>& Data);
	void ServerRequestData();
	void ServerTransferData(const struct FIntPoint& LandscapeCompIdx, const class FString& WeightmapName, const TArray<uint8>& Data);
	void ServerTransferDataForAllStaticLayerComponents();

	int32 GetRemainingBytesToTransfer() const;
	int32 GetRemainingTransferCount() const;
	int32 GetTotalBytesToTransfer() const;
	int32 GetTotalTransferCount() const;
	float GetTransferProgress() const;
	bool IsTransferInProgress() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtDataTransferComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtDataTransferComponent")
	}
	static class UElRtDataTransferComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElRtDataTransferComponent>();
	}
};
DUMPER7_ASSERTS_UElRtDataTransferComponent;

// Class ErrantLandscapeRuntime.ElRtEditorUserSettings
// 0x0008 (0x0040 - 0x0038)
class UElRtEditorUserSettings final : public UDeveloperSettings
{
public:
	bool                                          bWarnAboutIncorrectStaticSetup;                    // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtEditorUserSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtEditorUserSettings")
	}
	static class UElRtEditorUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElRtEditorUserSettings>();
	}
};
DUMPER7_ASSERTS_UElRtEditorUserSettings;

// Class ErrantLandscapeRuntime.ElRtStampBrushComponent
// 0x0000 (0x0530 - 0x0530)
#pragma pack(push, 0x1)
class alignas(0x10) UElRtStampBrushComponent : public UElRtBrushComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtStampBrushComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtStampBrushComponent")
	}
	static class UElRtStampBrushComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElRtStampBrushComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UElRtStampBrushComponent;

// Class ErrantLandscapeRuntime.ElRtTextureStampBrushComponent
// 0x01A0 (0x06D0 - 0x0530)
class UElRtTextureStampBrushComponent : public UElRtStampBrushComponent
{
public:
	EElRtStampBrushShape                          Shape;                                             // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FElRtStampBrushSplineShapeParams       SplineParams;                                      // 0x0530(0x0058)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FElRtStampBrushTextureSettings         Heightmap;                                         // 0x0588(0x00C8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TMap<TSoftObjectPtr<class ULandscapeLayerInfoObject>, struct FElRtStampBrushTextureSettings> WeightMaps; // 0x0650(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class ALandscape>              BrushLandscape;                                    // 0x06A0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C8[0x8];                                      // 0x06C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void NotifySplineChanged();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtTextureStampBrushComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtTextureStampBrushComponent")
	}
	static class UElRtTextureStampBrushComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElRtTextureStampBrushComponent>();
	}
};
DUMPER7_ASSERTS_UElRtTextureStampBrushComponent;

// Class ErrantLandscapeRuntime.ElRtStaticTextureStampBrushComponent
// 0x0000 (0x06D0 - 0x06D0)
class UElRtStaticTextureStampBrushComponent final : public UElRtTextureStampBrushComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtStaticTextureStampBrushComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtStaticTextureStampBrushComponent")
	}
	static class UElRtStaticTextureStampBrushComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElRtStaticTextureStampBrushComponent>();
	}
};
DUMPER7_ASSERTS_UElRtStaticTextureStampBrushComponent;

// Class ErrantLandscapeRuntime.ElRtStampBrushSubsystem
// 0x0008 (0x0030 - 0x0028)
class UElRtStampBrushSubsystem final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtStampBrushSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtStampBrushSubsystem")
	}
	static class UElRtStampBrushSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElRtStampBrushSubsystem>();
	}
};
DUMPER7_ASSERTS_UElRtStampBrushSubsystem;

// Class ErrantLandscapeRuntime.ElRtStaticLayerStampBrushComponent
// 0x0060 (0x0590 - 0x0530)
class UElRtStaticLayerStampBrushComponent : public UElRtStampBrushComponent
{
public:
	uint8                                         Pad_528[0x48];                                     // 0x0528(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 StaticData;                                        // 0x0570(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FIntPoint                              StaticPartitionXY;                                 // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_588[0x8];                                      // 0x0588(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtStaticLayerStampBrushComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtStaticLayerStampBrushComponent")
	}
	static class UElRtStaticLayerStampBrushComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElRtStaticLayerStampBrushComponent>();
	}
};
DUMPER7_ASSERTS_UElRtStaticLayerStampBrushComponent;

// Class ErrantLandscapeRuntime.ElRtStaticHeightmapLayerStampBrushComponent
// 0x0000 (0x0590 - 0x0590)
class UElRtStaticHeightmapLayerStampBrushComponent final : public UElRtStaticLayerStampBrushComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtStaticHeightmapLayerStampBrushComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtStaticHeightmapLayerStampBrushComponent")
	}
	static class UElRtStaticHeightmapLayerStampBrushComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElRtStaticHeightmapLayerStampBrushComponent>();
	}
};
DUMPER7_ASSERTS_UElRtStaticHeightmapLayerStampBrushComponent;

// Class ErrantLandscapeRuntime.ElRtStaticWeightmapLayerStampBrushComponent
// 0x0030 (0x05C0 - 0x0590)
class UElRtStaticWeightmapLayerStampBrushComponent final : public UElRtStaticLayerStampBrushComponent
{
public:
	TSoftObjectPtr<class ULandscapeLayerInfoObject> StaticWeightmap;                                 // 0x0590(0x0028)(Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5B8[0x8];                                      // 0x05B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtStaticWeightmapLayerStampBrushComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtStaticWeightmapLayerStampBrushComponent")
	}
	static class UElRtStaticWeightmapLayerStampBrushComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElRtStaticWeightmapLayerStampBrushComponent>();
	}
};
DUMPER7_ASSERTS_UElRtStaticWeightmapLayerStampBrushComponent;

// Class ErrantLandscapeRuntime.ElRtStaticLayerPartitions
// 0x0070 (0x0318 - 0x02A8)
class AElRtStaticLayerPartitions final : public AActor
{
public:
	bool                                          bAutoInitialize;                                   // 0x02A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class ULandscapeLayerInfoObject>> WeightMaps;                              // 0x02B0(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class ALandscape>              Landscape;                                         // 0x02C0(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UElRtStaticHeightmapLayerStampBrushComponent*> StaticHeightmapLayerComponents;      // 0x02E8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class UElRtStaticWeightmapLayerStampBrushComponent*> StaticWeightmapLayerComponents;      // 0x02F8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	struct FVector2D                              StaticLayerPartitionSize;                          // 0x0308(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtStaticLayerPartitions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtStaticLayerPartitions")
	}
	static class AElRtStaticLayerPartitions* GetDefaultObj()
	{
		return GetDefaultObjImpl<AElRtStaticLayerPartitions>();
	}
};
DUMPER7_ASSERTS_AElRtStaticLayerPartitions;

// Class ErrantLandscapeRuntime.ElRtWorldSubsystem
// 0x03C0 (0x0400 - 0x0040)
class alignas(0x40) UElRtWorldSubsystem final : public UTickableWorldSubsystem
{
public:
	TMulticastInlineDelegate<void(const TArray<class ULandscapeComponent*>& LandscapeComponents)> OnLandscapeCollisionsUpdated; // 0x0040(0x0018)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0xC8];                                      // 0x0058(0x00C8)(Fixing Size After Last Property [ Dumper-7 ])
	class ALandscape*                             DefaultLandscape;                                  // 0x0120(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TMap<TSoftObjectPtr<class ALandscape>, class AElRtStaticLayerPartitions*> StaticLayerPartitions; // 0x0128(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	class UElProjectSettings*                     ProjectSettings;                                   // 0x0178(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TMap<class UTexture*, class UTexture*>        CachedTextures;                                    // 0x0180(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_1D0[0x230];                                    // 0x01D0(0x0230)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void QueueRender(const struct FBox2D& InWorldUpdateBounds);
	void SetDefaultLandscape(class ALandscape* InLandscape);

	class ALandscape* GetDefaultLandscape() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ElRtWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ElRtWorldSubsystem")
	}
	static class UElRtWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UElRtWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_UElRtWorldSubsystem;

}

