#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrantBiomesPCG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum ErrantBiomesPCG.EBiomesPCGMaskDataSource
// NumValues: 0x0006
enum class EBiomesPCGMaskDataSource : uint8
{
	SpeciesGrowth                            = 0,
	SpeciesScale                             = 1,
	SpeciesGroup                             = 2,
	SubBiome                                 = 3,
	SpeciesRotation                          = 4,
	EBiomesPCGMaskDataSource_MAX             = 5,
};

// Enum ErrantBiomesPCG.EBiomesPCGMaskType
// NumValues: 0x0003
enum class EBiomesPCGMaskType : uint8
{
	MaterialMask                             = 0,
	AssetMask                                = 1,
	EBiomesPCGMaskType_MAX                   = 2,
};

// Enum ErrantBiomesPCG.EBiomesPCGLimit
// NumValues: 0x0004
enum class EBiomesPCGLimit : uint32
{
	CreateAll                                = 0,
	AllowList                                = 1,
	BlockList                                = 2,
	EBiomesPCGLimit_MAX                      = 3,
};

// Enum ErrantBiomesPCG.EBiomesPCGLimitMask
// NumValues: 0x0006
enum class EBiomesPCGLimitMask : uint8
{
	None                                     = 0,
	Growth                                   = 1,
	Scale                                    = 2,
	Rotation                                 = 3,
	Group                                    = 4,
	EBiomesPCGLimitMask_MAX                  = 5,
};

// ScriptStruct ErrantBiomesPCG.BiomesPCGMaskData
// 0x0010 (0x0010 - 0x0000)
struct FBiomesPCGMaskData final
{
public:
	TArray<uint8>                                 MaskData;                                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBiomesPCGMaskData;

// ScriptStruct ErrantBiomesPCG.BiomesPCGMaskSource
// 0x0028 (0x0028 - 0x0000)
struct FBiomesPCGMaskSource final
{
public:
	struct FSoftObjectPath                        SourceAsset;                                       // 0x0000(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBiomesPCGMaskDataSource                      MaskDataSource;                                    // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBiomesPCGMaskSource;

// ScriptStruct ErrantBiomesPCG.BiomesPCGSpeciesPointsData
// 0x0030 (0x0030 - 0x0000)
struct FBiomesPCGSpeciesPointsData final
{
public:
	TArray<struct FTransform>                     Transforms;                                        // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Indices;                                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                Assets;                                            // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBiomesPCGSpeciesPointsData;

// ScriptStruct ErrantBiomesPCG.BiomesPCGSpeciesPointsLowerPrecisionData
// 0x0020 (0x0020 - 0x0000)
struct FBiomesPCGSpeciesPointsLowerPrecisionData final
{
public:
	TArray<uint8>                                 Data;                                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                Assets;                                            // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBiomesPCGSpeciesPointsLowerPrecisionData;

// ScriptStruct ErrantBiomesPCG.BiomesPCGSpeciesInput
// 0x0028 (0x0028 - 0x0000)
struct FBiomesPCGSpeciesInput final
{
public:
	struct FSoftObjectPath                        AssetPath;                                         // 0x0000(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LimitMask;                                         // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStoreInstancesTransforms;                         // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBiomesPCGSpeciesInput;

}

