#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BuildingToolConstructEquipped

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_BuildingToolConstructEquipped.GA_BuildingToolConstructEquipped_C
// 0x0090 (0x0598 - 0x0508)
class UGA_BuildingToolConstructEquipped_C final : public UCrGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           Tpp_Montage_to_Play;                               // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  SoldierTag;                                        // 0x0518(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  ScientistTag;                                      // 0x0538(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  EngineerTag;                                       // 0x0558(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  BiologistTag;                                      // 0x0578(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_BuildingToolConstructEquipped(int32 EntryPoint);
	void K2_ActivateAbility();
	void OnCancelled_4574D1044C405CC00A130CB9AEC27FB4(class FName NotifyName);
	void OnFppMontageBlendOut_4574D1044C405CC00A130CB9AEC27FB4(class FName NotifyName);
	void OnFppMontageEnded_4574D1044C405CC00A130CB9AEC27FB4(class FName NotifyName);
	void OnFppMontageNotifyBegin_4574D1044C405CC00A130CB9AEC27FB4(class FName NotifyName);
	void OnFppMontageNotifyEnd_4574D1044C405CC00A130CB9AEC27FB4(class FName NotifyName);
	void OnInterrupted_4574D1044C405CC00A130CB9AEC27FB4(class FName NotifyName);
	void OnNotLocallyControlledTppMontageBlendOut_4574D1044C405CC00A130CB9AEC27FB4(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_BuildingToolConstructEquipped_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_BuildingToolConstructEquipped_C")
	}
	static class UGA_BuildingToolConstructEquipped_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_BuildingToolConstructEquipped_C>();
	}
};
DUMPER7_ASSERTS_UGA_BuildingToolConstructEquipped_C;

}

