#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BuildingToolDeconstructEquipped

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_BuildingToolDeconstructEquipped.GA_BuildingToolDeconstructEquipped_C.ExecuteUbergraph_GA_BuildingToolDeconstructEquipped
// 0x0170 (0x0170 - 0x0000)
struct GA_BuildingToolDeconstructEquipped_C_ExecuteUbergraph_GA_BuildingToolDeconstructEquipped final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0078(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0098(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCrAbilityTask_PlayMontage*             CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x0110(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_2; // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2; // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_3; // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_3; // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolDeconstructEquipped_C_ExecuteUbergraph_GA_BuildingToolDeconstructEquipped;

// Function GA_BuildingToolDeconstructEquipped.GA_BuildingToolDeconstructEquipped_C.OnCancelled_A49255BA4A206111255EC2B1C4FEFAC2
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolDeconstructEquipped_C_OnCancelled_A49255BA4A206111255EC2B1C4FEFAC2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolDeconstructEquipped_C_OnCancelled_A49255BA4A206111255EC2B1C4FEFAC2;

// Function GA_BuildingToolDeconstructEquipped.GA_BuildingToolDeconstructEquipped_C.OnFppMontageBlendOut_A49255BA4A206111255EC2B1C4FEFAC2
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolDeconstructEquipped_C_OnFppMontageBlendOut_A49255BA4A206111255EC2B1C4FEFAC2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolDeconstructEquipped_C_OnFppMontageBlendOut_A49255BA4A206111255EC2B1C4FEFAC2;

// Function GA_BuildingToolDeconstructEquipped.GA_BuildingToolDeconstructEquipped_C.OnFppMontageEnded_A49255BA4A206111255EC2B1C4FEFAC2
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolDeconstructEquipped_C_OnFppMontageEnded_A49255BA4A206111255EC2B1C4FEFAC2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolDeconstructEquipped_C_OnFppMontageEnded_A49255BA4A206111255EC2B1C4FEFAC2;

// Function GA_BuildingToolDeconstructEquipped.GA_BuildingToolDeconstructEquipped_C.OnFppMontageNotifyBegin_A49255BA4A206111255EC2B1C4FEFAC2
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolDeconstructEquipped_C_OnFppMontageNotifyBegin_A49255BA4A206111255EC2B1C4FEFAC2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolDeconstructEquipped_C_OnFppMontageNotifyBegin_A49255BA4A206111255EC2B1C4FEFAC2;

// Function GA_BuildingToolDeconstructEquipped.GA_BuildingToolDeconstructEquipped_C.OnFppMontageNotifyEnd_A49255BA4A206111255EC2B1C4FEFAC2
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolDeconstructEquipped_C_OnFppMontageNotifyEnd_A49255BA4A206111255EC2B1C4FEFAC2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolDeconstructEquipped_C_OnFppMontageNotifyEnd_A49255BA4A206111255EC2B1C4FEFAC2;

// Function GA_BuildingToolDeconstructEquipped.GA_BuildingToolDeconstructEquipped_C.OnInterrupted_A49255BA4A206111255EC2B1C4FEFAC2
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolDeconstructEquipped_C_OnInterrupted_A49255BA4A206111255EC2B1C4FEFAC2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolDeconstructEquipped_C_OnInterrupted_A49255BA4A206111255EC2B1C4FEFAC2;

// Function GA_BuildingToolDeconstructEquipped.GA_BuildingToolDeconstructEquipped_C.OnNotLocallyControlledTppMontageBlendOut_A49255BA4A206111255EC2B1C4FEFAC2
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingToolDeconstructEquipped_C_OnNotLocallyControlledTppMontageBlendOut_A49255BA4A206111255EC2B1C4FEFAC2 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingToolDeconstructEquipped_C_OnNotLocallyControlledTppMontageBlendOut_A49255BA4A206111255EC2B1C4FEFAC2;

}

