#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_UseEdibleItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AuItems_structs.hpp"
#include "Chimera_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_UseEdibleItem.GA_UseEdibleItem_C
// 0x0090 (0x0680 - 0x05F0)
class UGA_UseEdibleItem_C final : public UCrSystemAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 HealthEffectClass;                                 // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HydrationEffectClass;                              // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CaloriesEffectClass;                               // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ToxicityEffectClass;                               // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCrEdibleItemBase*                      EditbleItemData;                                   // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                OwnerAbilitySystemComponent;                       // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ItemOwner;                                         // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAuItemId                              ItemId;                                            // 0x0630(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HydrationDecreaseClass;                            // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CaloriesDecreaseClass;                             // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MaxAttributeMarginMultiplier;                      // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 EnergyEffectClass;                                 // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCrGemAttributeSet*                     GemAttributes;                                     // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         FinalToxicityChange;                               // 0x0668(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ToxicityPenaltyMultiplier;                         // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void clamp(double ValueChange, const struct FGameplayAttribute& AttributeMin, const struct FGameplayAttribute& AttributeMax, const struct FGameplayAttribute& AttibuteCurrent, double* EndValue);
	void ExecuteUbergraph_GA_UseEdibleItem(int32 EntryPoint);
	void GetAttributeValues(const struct FGameplayAttribute& AttributeValue, double* CurrentValue);
	void IsAttributeFull(const struct FGameplayAttribute& Attribute, double AttributeMaxVal, bool* IsFull);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_UseEdibleItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_UseEdibleItem_C")
	}
	static class UGA_UseEdibleItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_UseEdibleItem_C>();
	}
};
DUMPER7_ASSERTS_UGA_UseEdibleItem_C;

}

