#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ZiplineModeEnded

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_ZiplineModeEnded.GA_ZiplineModeEnded_C.ExecuteUbergraph_GA_ZiplineModeEnded
// 0x0100 (0x0100 - 0x0000)
struct GA_ZiplineModeEnded_C_ExecuteUbergraph_GA_ZiplineModeEnded final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0090(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00D0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCrAbilityTask_PlayMontage*             CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_ZiplineModeEnded_C_ExecuteUbergraph_GA_ZiplineModeEnded;

// Function GA_ZiplineModeEnded.GA_ZiplineModeEnded_C.OnCancelled_E69301A24324A74EE4BE35829B6C31CF
// 0x0008 (0x0008 - 0x0000)
struct GA_ZiplineModeEnded_C_OnCancelled_E69301A24324A74EE4BE35829B6C31CF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_ZiplineModeEnded_C_OnCancelled_E69301A24324A74EE4BE35829B6C31CF;

// Function GA_ZiplineModeEnded.GA_ZiplineModeEnded_C.OnFppMontageBlendOut_E69301A24324A74EE4BE35829B6C31CF
// 0x0008 (0x0008 - 0x0000)
struct GA_ZiplineModeEnded_C_OnFppMontageBlendOut_E69301A24324A74EE4BE35829B6C31CF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_ZiplineModeEnded_C_OnFppMontageBlendOut_E69301A24324A74EE4BE35829B6C31CF;

// Function GA_ZiplineModeEnded.GA_ZiplineModeEnded_C.OnFppMontageEnded_E69301A24324A74EE4BE35829B6C31CF
// 0x0008 (0x0008 - 0x0000)
struct GA_ZiplineModeEnded_C_OnFppMontageEnded_E69301A24324A74EE4BE35829B6C31CF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_ZiplineModeEnded_C_OnFppMontageEnded_E69301A24324A74EE4BE35829B6C31CF;

// Function GA_ZiplineModeEnded.GA_ZiplineModeEnded_C.OnFppMontageNotifyBegin_E69301A24324A74EE4BE35829B6C31CF
// 0x0008 (0x0008 - 0x0000)
struct GA_ZiplineModeEnded_C_OnFppMontageNotifyBegin_E69301A24324A74EE4BE35829B6C31CF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_ZiplineModeEnded_C_OnFppMontageNotifyBegin_E69301A24324A74EE4BE35829B6C31CF;

// Function GA_ZiplineModeEnded.GA_ZiplineModeEnded_C.OnFppMontageNotifyEnd_E69301A24324A74EE4BE35829B6C31CF
// 0x0008 (0x0008 - 0x0000)
struct GA_ZiplineModeEnded_C_OnFppMontageNotifyEnd_E69301A24324A74EE4BE35829B6C31CF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_ZiplineModeEnded_C_OnFppMontageNotifyEnd_E69301A24324A74EE4BE35829B6C31CF;

// Function GA_ZiplineModeEnded.GA_ZiplineModeEnded_C.OnInterrupted_E69301A24324A74EE4BE35829B6C31CF
// 0x0008 (0x0008 - 0x0000)
struct GA_ZiplineModeEnded_C_OnInterrupted_E69301A24324A74EE4BE35829B6C31CF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_ZiplineModeEnded_C_OnInterrupted_E69301A24324A74EE4BE35829B6C31CF;

// Function GA_ZiplineModeEnded.GA_ZiplineModeEnded_C.OnNotLocallyControlledTppMontageBlendOut_E69301A24324A74EE4BE35829B6C31CF
// 0x0008 (0x0008 - 0x0000)
struct GA_ZiplineModeEnded_C_OnNotLocallyControlledTppMontageBlendOut_E69301A24324A74EE4BE35829B6C31CF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_ZiplineModeEnded_C_OnNotLocallyControlledTppMontageBlendOut_E69301A24324A74EE4BE35829B6C31CF;

}

