#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassAIPrototypeEnemyRuntime

#include "Basic.hpp"

#include "MassSpawner_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MassAIPrototypeEnemyRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Chimera_structs.hpp"
#include "Chimera_classes.hpp"
#include "AuActorPlacement_structs.hpp"
#include "MassEntity_structs.hpp"
#include "MassEntity_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "MassRepresentation_structs.hpp"
#include "MassRepresentation_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "GameplayAbilities_classes.hpp"
#include "MassMovement_structs.hpp"
#include "MassNavigation_structs.hpp"
#include "MassLOD_classes.hpp"
#include "PCG_classes.hpp"


namespace SDK
{

// Class MassAIPrototypeEnemyRuntime.AbstractMassEnemySpawner
// 0x0210 (0x04D0 - 0x02C0)
class AAbstractMassEnemySpawner : public ACrAISpawner
{
public:
	uint8                                         Pad_2C0[0x30];                                     // 0x02C0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMassEnemySpawnPresetConfigurationAsset> SpawnPresetAsset;                  // 0x02F0(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UMassEnemySpawnerConfigurationAsset> SpawnerConfigurationAsset;             // 0x0318(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideSpawnPreset;                              // 0x0340(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEnemySpawnerPreset                SpawnPreset;                                       // 0x0348(0x0060)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bOverrideSpawnerConfigurationPreset;               // 0x03A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEnemySpawnerConfiguration         SpawnerConfiguration;                              // 0x03AC(0x0014)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bTriggerActive;                                    // 0x03C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpawnedEntitiesCount;                              // 0x03C4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         KilledEntitiesCount;                               // 0x03C8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ActiveEntitiesCount;                               // 0x03CC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMassEnemySpawnerState                        SpawnerState;                                      // 0x03D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NavmeshGenerationAttempts;                         // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<ECrSpawnPositionIndexFlag, class UMassEnemySpawnPositionComponent*> SpawnPositionComponents; // 0x03D8(0x0050)(Edit, ExportObject, EditConst, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	class UNavigationInvokerComponent*            NavigationInvokerComponent;                        // 0x0428(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMassEnemySpawnerNavmeshRadius*         NavmeshRadiusComponent;                            // 0x0430(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMassEnemySpawnerTriggerSphere*         ForcedDisableTrigger;                              // 0x0438(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	ECrEnemyType                                  EnemyType;                                         // 0x0440(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FirstSpawnTimestamp;                               // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LastSpawnRequestTimestamp;                         // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinTimeBetweenSpawnRequestAndStateChangeS;         // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           SpawnTickTimerHandle;                              // 0x0450(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           WaitForNavmeshTimerHandle;                         // 0x0458(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           NextBurstTimerHandle;                              // 0x0460(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           DebugTickTimerHandle;                              // 0x0468(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           CreateMassEntityTimer;                             // 0x0470(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECrSpawnFenceType                             CurrentFenceType;                                  // 0x0478(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_47C[0x14];                                     // 0x047C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowComponent*                        SpawnTransformComponent;                           // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	bool                                          bSkipDigOutAnimation;                              // 0x0498(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAffectedByWave;                                   // 0x0499(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSpawnedWithAggro;                               // 0x049A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49B[0x5];                                      // 0x049B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMassEntityConfigAsset>  EntityConfig;                                      // 0x04A0(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C8[0x8];                                      // 0x04C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateSpawner(bool bDisableAggroLock);
	void ActivateTrigger(bool Active);
	void DeactivateSpawner(bool bPermanently);
	void SetState(EMassEnemySpawnerState NewState);

	bool IsDebugEnabled() const;
	bool IsTriggerActive() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbstractMassEnemySpawner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbstractMassEnemySpawner")
	}
	static class AAbstractMassEnemySpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAbstractMassEnemySpawner>();
	}
};
DUMPER7_ASSERTS_AAbstractMassEnemySpawner;

// Class MassAIPrototypeEnemyRuntime.MassEnemyInstancedStaticMeshComponent
// 0x0000 (0x09A0 - 0x09A0)
class UMassEnemyInstancedStaticMeshComponent final : public UInstancedStaticMeshComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEnemyInstancedStaticMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEnemyInstancedStaticMeshComponent")
	}
	static class UMassEnemyInstancedStaticMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnemyInstancedStaticMeshComponent>();
	}
};
DUMPER7_ASSERTS_UMassEnemyInstancedStaticMeshComponent;

// Class MassAIPrototypeEnemyRuntime.AiFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAiFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddLooseGameplayTagToEnemyCharacter(class AMassEnemyCharacterBase* Character, const struct FGameplayTag& Tag);
	static bool AoEAttack(const class AActor* Attacker, const TArray<class AActor*>& IgnoredActors, const struct FVector& AttackLocation, float AttackRadius, TSubclassOf<class UGameplayEffect> PlayerDamageEffect, TSubclassOf<class UGameplayEffect> AiDamageEffect, float BuildingDamageAmount, float MaxPushDistance, float PushDuration, float EnemyActorPushVelocity, float EnemyEntityPushVelocity, bool bResetPushZAxis);
	static bool BPFindClosestPointOnNavmesh(class UObject* WorldContextObject, const struct FVector& OriginalLocation, struct FVector* OutLocationIfSuccess, const struct FVector& Extents, class FName AgentName);
	static bool BPGetManagedRandomPointOnNavmesh(class AMassEnemyCharacterBase* MassEnemyCharacter, const struct FVector& CenterLocation, struct FVector* OutLocationIfSuccess, float Radius, class FName AgentName, bool bEnsureReachable, class AAIController* AIController, TSubclassOf<class UNavigationQueryFilter> NavFilter);
	static bool BPGetManagedTargetLocation(const class AMassEnemyCharacterBase* MassEnemyCharacterBase, const class AActor* TargetActor, struct FVector* OutTargetLocation, class FName AgentName);
	static bool BPGetRandomPointOnNavmesh(class UObject* WorldContextObject, const struct FVector& CenterLocation, struct FVector* OutLocationIfSuccess, float Radius, class FName AgentName, bool bEnsureReachable, class AAIController* AIController, TSubclassOf<class UNavigationQueryFilter> NavFilter);
	static struct FVector CalculateJumpParabolaParameters(const struct FVector2D& Start, const struct FVector2D& Middle, const struct FVector2D& End);
	static bool CanActorRunAway(const class AActor* Actor);
	static bool CanEnemyPlaySpawnAnim(class AMassEnemyCharacterBase* EnemyCharacterBase);
	static bool CanPerformMovementAttack(class AMassEnemyCharacterBase* Enemy, const class AActor* Target);
	static bool DealDamageToActor(const class AActor* CallingCActor, class AActor* TargetActor, TSubclassOf<class UGameplayEffect> PlayerDamageEffect, TSubclassOf<class UGameplayEffect> AiDamageEffect, float BuildingInfectionDamage, float MaxDistance, float ConeHalfAngle);
	static bool DealDamageToEntityAtProjectileHitLocation(const class AActor* ProjectileActor, const struct FTransform& ProjectileHitTransform, TSubclassOf<class UGameplayEffect> PlayerDamageEffect, TSubclassOf<class UGameplayEffect> AiDamageEffect, float BuildingInfectionDamage, float EntitySearchExtents, float BuildingSearchExtents);
	static void DebugSetZeroHPForAllEnemies(class UObject* WorldContext);
	static void DebugSwitchBetweenDefaultAndBigNavmeshVisibility(class UObject* WorldContext);
	static TArray<struct FVector> FindPointsForLongAoeAttack(class AActor* Instigator, const float& Distance, const int32& StepsNum, const float& StartAdditionalDistance);
	static bool FindSpawnPosition(const class UWorld* World, const struct FBox& Bounds, struct FVector* OutSpawnPosition, class FName AgentName);
	static struct FVector GetClosestPointOnBounds(class UObject* WorldContext, const struct FVector& BoundsCenter, const struct FVector& BoundsExtents, const struct FRotator& BoundsRotation, const struct FVector& SourcePoint, bool PreserveSourceZ);
	static ECrEnemySpawnType GetCrMassEnemySpawnType(class AMassEnemyCharacterBase* EnemyCharacterBase);
	static ECrEnemyType GetCrMassEnemyType(class AMassEnemyCharacterBase* EnemyCharacterBase);
	static TMap<int32, struct FCrDebugEnemyData> GetDebugMassEnemiesData(class UObject* WorldContext);
	static float GetJumpParabolaY(const struct FVector& ParabolaParameters, float X);
	static struct FVector GetLootEndLocation(class AActor* Actor);
	static struct FVector GetLootStartLocation(class AActor* Actor);
	static EMassEnemyInitializationState GetMassEnemyState(class AMassEnemyCharacterBase* EnemyCharacterBase);
	static float GetPitchAngleFromForwardToPosition(const struct FTransform& SelfTransform, const struct FVector& Position);
	static TArray<class ACrCharacterPlayerBase*> GetPlayersInRadius(const struct FVector& Center, const float& Radius, class UObject* WorldContext);
	static float GetYawAngleFromForwardToPosition(const struct FTransform& SelfTransform, const struct FVector& Position);
	static float GetYawAngleFromForwardToVelocity(const struct FTransform& SelfTransform, const struct FVector& VelocityVector);
	static bool HasLineOfSightToLocation(class UWorld* World, const class AActor* TestedActor, const struct FVector& TargetLocation, float ConeHalfAngle, bool IgnoreOtherAiCollision, float DebugDrawTime);
	static bool HasLineOfSightToTarget(class UWorld* World, const class AActor* TestedActor, const class AActor* TargetActor, float ConeHalfAngle, bool IgnoreOtherAiCollision, float DebugDrawTime);
	static bool IsActorInFence(const class AMassEnemyCharacterBase* MassEnemyCharacterBase);
	static bool IsFenceForcedForActor(const class AMassEnemyCharacterBase* MassEnemyCharacterBase);
	static bool IsLocalPlayerIsInsideBox(class UWorld* World, const struct FVector& BoxLocation, const struct FVector& ScaledBoxExtent, int32* OutLocalPlayerId);
	static bool IsLocalPlayerIsInsideSphere(const class UWorld* World, const struct FVector& SphereLocation, float SphereRadius, int32* OutLocalPlayerId);
	static bool IsLootTriggered(class AActor* Actor);
	static bool IsNavmeshGenerated(const class UWorld* World, const struct FBox& BoundsToCheck, class FName AgentName);
	static bool LongAoEAttack(const class AActor* Attacker, const TArray<class AActor*>& IgnoredActors, const TArray<struct FVector>& AoePoints, float PushZDistance, float AttackRadius, TSubclassOf<class UGameplayEffect> PlayerDamageEffect, TSubclassOf<class UGameplayEffect> AiDamageEffect, float BuildingDamageAmount, float MaxPushDistance, float PushDuration, float EnemyActorPushVelocity, float EnemyEntityPushVelocity);
	static bool PushBackEnemyActorFromAttack(const class AActor* Attacker, const class AActor* Target, float PushSpeed, bool bResetZAxis);
	static bool PushBackPlayerFromAttack(const class AActor* Attacker, const class AActor* Target, float MaxPushDistance, float PushDuration, bool bResetZAxis);
	static bool PushEnemyActorInDirection(const class AActor* TargetActor, const struct FVector& PushVelocity);
	static bool PushPlayerInDirection(const class AActor* TargetActor, const struct FVector& Direction, float MaxPushDistance, float PushDuration);
	static void RemoveLooseGameplayTagFromEnemyCharacter(class AMassEnemyCharacterBase* Character, const struct FGameplayTag& Tag);
	static void SetIsLootTriggered(class AActor* Actor, bool bNew);
	static void SetIsStuckForActorEnemy(class AActor* ActorEnemy, bool bIsStuck);
	static void SetMassEnemyState(class AMassEnemyCharacterBase* EnemyCharacterBase, EMassEnemyInitializationState NewState);
	static bool SpawnEntityAtLocation(class AActor* CallingActor, const struct FAuAPMassSpawnedEntityType& EntityType, const struct FVector& Location, const struct FVector& Scale);
	static bool TryStartRagdollForMassEnemy(const struct FMassEntityHandle& Entity, class UCrAiDeathSequenceSubsystem* DeathSequenceSubsystem, const struct FTransform& EntityWorldTransform, const struct FVector& KillingHitLocation, const struct FVector& KillingHitNormal, float KillingHitDistance, const struct FGameplayTag& KillingDamageTag, struct FMassEnemyStateFragment* StateFragment, const struct FCrMassEnemyConfigurationFragment& MassEnemyConfiguration, const struct FVector& VisualVariationSeed);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AiFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AiFunctionLibrary")
	}
	static class UAiFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAiFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UAiFunctionLibrary;

// Class MassAIPrototypeEnemyRuntime.BaseAttackSpawnIndicator
// 0x0030 (0x02D8 - 0x02A8)
class ABaseAttackSpawnIndicator final : public AActor
{
public:
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxHealth;                                         // 0x02B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DestroyDelay;                                      // 0x02B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAbilitySystemComponent*                AbilitySystem;                                     // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UCrAIBaseAttributeSet*                  HealthAttributes;                                  // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	bool                                          bActivated;                                        // 0x02C8(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDied;                                             // 0x02C9(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassAgentComponent*                    MassAgentComponent;                                // 0x02D0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	void BP_OnActivateVisuals();
	void BP_OnDelayedDestroyRequested();
	void BP_OnDied();
	void OnRep_Activated();
	void OnRep_Died();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseAttackSpawnIndicator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseAttackSpawnIndicator")
	}
	static class ABaseAttackSpawnIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseAttackSpawnIndicator>();
	}
};
DUMPER7_ASSERTS_ABaseAttackSpawnIndicator;

// Class MassAIPrototypeEnemyRuntime.MassEnemyTemperatureModifierProcessor
// 0x0370 (0x0430 - 0x00C0)
class UMassEnemyTemperatureModifierProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x370];                                     // 0x00C0(0x0370)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEnemyTemperatureModifierProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEnemyTemperatureModifierProcessor")
	}
	static class UMassEnemyTemperatureModifierProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnemyTemperatureModifierProcessor>();
	}
};
DUMPER7_ASSERTS_UMassEnemyTemperatureModifierProcessor;

// Class MassAIPrototypeEnemyRuntime.CrMassBaseAttackStateProcessor
// 0x0350 (0x0410 - 0x00C0)
class UCrMassBaseAttackStateProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x350];                                     // 0x00C0(0x0350)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMassBaseAttackStateProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMassBaseAttackStateProcessor")
	}
	static class UCrMassBaseAttackStateProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMassBaseAttackStateProcessor>();
	}
};
DUMPER7_ASSERTS_UCrMassBaseAttackStateProcessor;

// Class MassAIPrototypeEnemyRuntime.BaseAttackVisualizationInterface
// 0x0000 (0x0000 - 0x0000)
class IBaseAttackVisualizationInterface final
{
public:
	void OnActivateDonut();
	void OnAttackIndicatorSpawned(const struct FVector& Location);
	void OnDeactivateDonut();
	void SetFloatingTrailObjectCount(int32 Count);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseAttackVisualizationInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseAttackVisualizationInterface")
	}
	static class IBaseAttackVisualizationInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBaseAttackVisualizationInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IBaseAttackVisualizationInterface;

// Class MassAIPrototypeEnemyRuntime.MassEnemyFXEventSubsystem
// 0x0018 (0x0048 - 0x0030)
class UMassEnemyFXEventSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AMassEnemyAudioStatesPlayersManager*    AudioStatesPlayersManager;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	void RegisterEvent(const class AMassEnemyCharacterBase* Character, const struct FGameplayTag& EventTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEnemyFXEventSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEnemyFXEventSubsystem")
	}
	static class UMassEnemyFXEventSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnemyFXEventSubsystem>();
	}
};
DUMPER7_ASSERTS_UMassEnemyFXEventSubsystem;

// Class MassAIPrototypeEnemyRuntime.DonutVisualizationActor
// 0x0098 (0x0340 - 0x02A8)
class ADonutVisualizationActor final : public AActor
{
public:
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FallingTrailSpeed;                                 // 0x02B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FloatingTrailOffsetMax;                            // 0x02B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FallingTrailTangentMul;                            // 0x02B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TrailDisappearUnderZ;                              // 0x02BC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TrailParticleZNegativeOffset;                      // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TrailParticleRotationRadius;                       // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TrailParticleAngularSpeed;                         // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bClientTrailsDirty;                                // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          FloatingTrailSystemDef;                            // 0x02D0(0x0028)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         LoadedFloatingTrailSystem;                         // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_300[0x10];                                     // 0x0300(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDonutFloatingTrailData>        FloatingTrails;                                    // 0x0310(0x0010)(BlueprintVisible, Net, ZeroConstructor, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_320[0x20];                                     // 0x0320(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearArrayByIndex(TArray<class UNiagaraComponent*>& Array, int32 Index_0);
	void OnRep_FloatingTrails();
	void SetFloatingTrailObjectCount(int32 Count);
	void StartFallingRandomFloatingTrail(const struct FVector& TargetLocation);
	void UpdateFallingTrails(float DeltaTime);
	void UpdateFloatingTrails();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DonutVisualizationActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DonutVisualizationActor")
	}
	static class ADonutVisualizationActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADonutVisualizationActor>();
	}
};
DUMPER7_ASSERTS_ADonutVisualizationActor;

// Class MassAIPrototypeEnemyRuntime.MovingTowardsBaseNavmeshInvokerActor
// 0x0008 (0x02B0 - 0x02A8)
class AMovingTowardsBaseNavmeshInvokerActor final : public AActor
{
public:
	bool                                          DrawDebug;                                         // 0x02A8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovingTowardsBaseNavmeshInvokerActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovingTowardsBaseNavmeshInvokerActor")
	}
	static class AMovingTowardsBaseNavmeshInvokerActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMovingTowardsBaseNavmeshInvokerActor>();
	}
};
DUMPER7_ASSERTS_AMovingTowardsBaseNavmeshInvokerActor;

// Class MassAIPrototypeEnemyRuntime.MassEnemyInitializeProcessor
// 0x0350 (0x0410 - 0x00C0)
class UMassEnemyInitializeProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x350];                                     // 0x00C0(0x0350)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEnemyInitializeProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEnemyInitializeProcessor")
	}
	static class UMassEnemyInitializeProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnemyInitializeProcessor>();
	}
};
DUMPER7_ASSERTS_UMassEnemyInitializeProcessor;

// Class MassAIPrototypeEnemyRuntime.MovingTowardsBaseActor
// 0x0020 (0x02C8 - 0x02A8)
class AMovingTowardsBaseActor final : public AActor
{
public:
	struct FVector                                WantedPos;                                         // 0x02A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DespawnDelay;                                      // 0x02C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MoveInterval;                                      // 0x02C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnDespawnScheduled();
	void ScheduleDespawnMulticast();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovingTowardsBaseActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovingTowardsBaseActor")
	}
	static class AMovingTowardsBaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMovingTowardsBaseActor>();
	}
};
DUMPER7_ASSERTS_AMovingTowardsBaseActor;

// Class MassAIPrototypeEnemyRuntime.CrBaseSiteAttackSpawnHandler
// 0x0028 (0x0050 - 0x0028)
class UCrBaseSiteAttackSpawnHandler final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrBaseSiteAttackSpawnHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrBaseSiteAttackSpawnHandler")
	}
	static class UCrBaseSiteAttackSpawnHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrBaseSiteAttackSpawnHandler>();
	}
};
DUMPER7_ASSERTS_UCrBaseSiteAttackSpawnHandler;

// Class MassAIPrototypeEnemyRuntime.CrMassEnemyStartRagdollObserver
// 0x0358 (0x0430 - 0x00D8)
class UCrMassEnemyStartRagdollObserver final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMassEnemyStartRagdollObserver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMassEnemyStartRagdollObserver")
	}
	static class UCrMassEnemyStartRagdollObserver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMassEnemyStartRagdollObserver>();
	}
};
DUMPER7_ASSERTS_UCrMassEnemyStartRagdollObserver;

// Class MassAIPrototypeEnemyRuntime.BaseSiteAttackSubsystem
// 0x0260 (0x0290 - 0x0030)
class UBaseSiteAttackSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x48];                                      // 0x0030(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassEnemyBaseSpawnerDataAsset*         Configuration;                                     // 0x0078(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_80[0x1A8];                                     // 0x0080(0x01A8)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrBaseAttackStateSubsystem*            BaseAttackStateSubsystem;                          // 0x0228(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class ADonutVisualizationActor*               DonutVisualizationActor;                           // 0x0230(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class AMovingTowardsBaseActor*                MovingTowardsBaseActor;                            // 0x0238(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_240[0x10];                                     // 0x0240(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABaseAttackSpawnIndicator*>      SpawnPositionIndicators;                           // 0x0250(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class AMovingTowardsBaseNavmeshInvokerActor*> MovingTowardsBaseNavmeshInvokerActors;      // 0x0260(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class UCrBaseSiteAttackSpawnHandler*>  HelperSpawnHandlers;                               // 0x0270(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class UObject*>                        HardReferencesForSpawnersPresetObjects;            // 0x0280(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	void DebugKillAllEnemies();
	void OnBaseCoreInfected(const struct FMassEntityHandle& Core);
	void OnBaseCoreInfectionActorDestroyed(const struct FMassEntityHandle& BaseCore, bool LaseActor);
	void OnBaseCoreInfectionCleanedUp(const struct FMassEntityHandle& Core);
	void OnCoreInfectionActorDestroyed(const struct FMassEntityHandle& Core);
	void OnPreSaveStart();
	void OnSaveLoaded();
	void OnWavePositionChanged(EEnviroWave Wave, const struct FCrEnviroWaveSettings& Settings, float Position);
	void OnWaveStarted(EEnviroWave Wave, EEnviroWaveStage Stage, const struct FCrEnviroWaveSettings& Settings, float Progress);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseSiteAttackSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseSiteAttackSubsystem")
	}
	static class UBaseSiteAttackSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseSiteAttackSubsystem>();
	}
};
DUMPER7_ASSERTS_UBaseSiteAttackSubsystem;

// Class MassAIPrototypeEnemyRuntime.BTService_CrCalculateCurrentAiStateData
// 0x0128 (0x0198 - 0x0070)
class UBTService_CrCalculateCurrentAiStateData final : public UBTService
{
public:
	struct FBlackboardKeySelector                 SelfActorKey;                                      // 0x0070(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 TargetActorKey;                                    // 0x0098(0x0028)(Edit, NativeAccessSpecifierPublic)
	float                                         UpdateIntervalS;                                   // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RandomUpdateDeviationS;                            // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCrAiBtDistanceCheck>           DistanceCheckDefinitions;                          // 0x00C8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCrAiBtAngleCheck>              AngleCheckDefinitions;                             // 0x00D8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCrAiBtPathCheck>               NavPathCheckDefinitions;                           // 0x00E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCrAiBtLineOfSightCheck>        LosCheckDefinitions;                               // 0x00F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCrAiBtSweepCheck>              SweepCheckDefinitions;                             // 0x0108(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCrAiBtVelocityCheck>           VelocityCheckDefinitions;                          // 0x0118(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCrAiBtTimestampCheck>          TimestampCheckDefinitions;                         // 0x0128(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCrAiBtTrajectoryCheck>         TrajectoryCheckDefinitions;                        // 0x0138(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 TargetPositionAfter1s;                             // 0x0148(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 SelfPositionWithTargetVAfter1s;                    // 0x0170(0x0028)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTService_CrCalculateCurrentAiStateData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTService_CrCalculateCurrentAiStateData")
	}
	static class UBTService_CrCalculateCurrentAiStateData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_CrCalculateCurrentAiStateData>();
	}
};
DUMPER7_ASSERTS_UBTService_CrCalculateCurrentAiStateData;

// Class MassAIPrototypeEnemyRuntime.MassEnemyMoveToTaskDataProcessor
// 0x0360 (0x0420 - 0x00C0)
class UMassEnemyMoveToTaskDataProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x360];                                     // 0x00C0(0x0360)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEnemyMoveToTaskDataProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEnemyMoveToTaskDataProcessor")
	}
	static class UMassEnemyMoveToTaskDataProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnemyMoveToTaskDataProcessor>();
	}
};
DUMPER7_ASSERTS_UMassEnemyMoveToTaskDataProcessor;

// Class MassAIPrototypeEnemyRuntime.BTService_UpdateAggroTarget
// 0x0350 (0x03C0 - 0x0070)
class UBTService_UpdateAggroTarget final : public UBTService
{
public:
	float                                         UpdateIntervalS;                                   // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RandomUpdateDeviationS;                            // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 SearchRadiusKey;                                   // 0x0078(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 MinSearchIntervalS;                                // 0x00A0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 EntityKey;                                         // 0x00C8(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 SelfActorKey;                                      // 0x00F0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 ActorKey;                                          // 0x0118(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 PositionKey;                                       // 0x0140(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 IsPositionFakeKey;                                 // 0x0168(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 IsInActiveFenceKey;                                // 0x0190(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 MinAggroKey;                                       // 0x01B8(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 AttackRadiusKey;                                   // 0x01E0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 MaxBuildingAttackRadiusKey;                        // 0x0208(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 IsNewTargetKey;                                    // 0x0230(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 TimeToUnsetAggroTargetAfterAggroLostKey;           // 0x0258(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 LostAggroTargetTimestampKey;                       // 0x0280(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 ChangeAggroTargetMultiplierKey;                    // 0x02A8(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 HasValidTargetKey;                                 // 0x02D0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 AggroTargetTypeKey;                                // 0x02F8(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 AggroTargetExtentsKey;                             // 0x0320(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 BuildingTargetAttackLocation;                      // 0x0348(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 BuildingTargetCenterLocation;                      // 0x0370(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                 TargetRotator;                                     // 0x0398(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTService_UpdateAggroTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTService_UpdateAggroTarget")
	}
	static class UBTService_UpdateAggroTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_UpdateAggroTarget>();
	}
};
DUMPER7_ASSERTS_UBTService_UpdateAggroTarget;

// Class MassAIPrototypeEnemyRuntime.CrAiActionAttack
// 0x0058 (0x00E0 - 0x0088)
class UCrAiActionAttack : public UCrAiAction
{
public:
	ECrEnemyAttackType                            AttackType;                                        // 0x0088(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWaitForAnimFinishEvent;                           // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            DamageGameplayEffect;                              // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BuildingInfectionDamage;                           // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AllowedAttackDistance;                             // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AllowedBuildingAttackDistance;                     // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AllowedAttackConeHalfAngle;                        // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepRotatedToMovement;                            // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         YawRotationRate;                                   // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetYawRotationRateOnStart;                        // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetPosition;                                    // 0x00B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAttackWithTurnInPlace;                            // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0xF];                                       // 0x00D1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCrAiActionAttack* Create_CrAiActionAttack(TSubclassOf<class UCrAiActionAttack> ActionType, float NewMaxLifetimeS, ECrEnemyAttackType NewAttackType, bool bNewWaitForAnimFinishEvent, TSubclassOf<class UGameplayEffect> NewDamageGameplayEffect, float NewBuildingInfectionDamage, float NewAllowedAttackDistance, float NewAllowedBuildingAttackDistance, float NewAllowedAttackConeHalfAngle, bool bKeepRotatedToMovement_0, float NewYawRotationRate, const struct FVector& TargetPosition_0, bool bNewAttackWithTurnInPlace);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiActionAttack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiActionAttack")
	}
	static class UCrAiActionAttack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrAiActionAttack>();
	}
};
DUMPER7_ASSERTS_UCrAiActionAttack;

// Class MassAIPrototypeEnemyRuntime.MassEnemyInfectionBoostProcessor
// 0x0350 (0x0410 - 0x00C0)
class UMassEnemyInfectionBoostProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x350];                                     // 0x00C0(0x0350)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassEnemyInfectionBoostProcessor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassEnemyInfectionBoostProcessor")
	}
	static class UMassEnemyInfectionBoostProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnemyInfectionBoostProcessor>();
	}
};
DUMPER7_ASSERTS_UMassEnemyInfectionBoostProcessor;

// Class MassAIPrototypeEnemyRuntime.CrAiActionBtTaskMoveTo
// 0x0060 (0x0130 - 0x00D0)
class UCrAiActionBtTaskMoveTo final : public UBTTask_RunCrAiAction
{
public:
	struct FBlackboardKeySelector                 MoveDestinationKey;                                // 0x00D0(0x0028)(Edit, NativeAccessSpecifierPublic)
	ECrEnemyLocomotionType                        LocomotionType;                                    // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AcceptanceRadius;                                  // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOrientRotationToMovement;                         // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         YawRotationRate;                                   // 0x0104(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetMaxSpeed;                                      // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchTargetSpeed;                                 // 0x0109(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxSpeed;                                          // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinSpeed;                                          // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetSpeedMultiplier;                             // 0x0114(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopMovementOnActionFinish;                       // 0x0118(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UNavigationQueryFilter>     NavFilterClass;                                    // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowPartialPath;                                 // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableRootMotionOnMovement;                      // 0x0129(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiActionBtTaskMoveTo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiActionBtTaskMoveTo")
	}
	static class UCrAiActionBtTaskMoveTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrAiActionBtTaskMoveTo>();
	}
};
DUMPER7_ASSERTS_UCrAiActionBtTaskMoveTo;

// Class MassAIPrototypeEnemyRuntime.CrAiActionBtTaskSetFocus
// 0x0038 (0x0108 - 0x00D0)
class UCrAiActionBtTaskSetFocus final : public UBTTask_RunCrAiAction
{
public:
	bool                                          bClearFocus;                                       // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 FocusKey;                                          // 0x00D8(0x0028)(Edit, NativeAccessSpecifierPublic)
	int32                                         FocusPriority;                                     // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiActionBtTaskSetFocus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiActionBtTaskSetFocus")
	}
	static class UCrAiActionBtTaskSetFocus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrAiActionBtTaskSetFocus>();
	}
};
DUMPER7_ASSERTS_UCrAiActionBtTaskSetFocus;

// Class MassAIPrototypeEnemyRuntime.CrMassEnemyAiClientDestructorObserver
// 0x0358 (0x0430 - 0x00D8)
class UCrMassEnemyAiClientDestructorObserver final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMassEnemyAiClientDestructorObserver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMassEnemyAiClientDestructorObserver")
	}
	static class UCrMassEnemyAiClientDestructorObserver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMassEnemyAiClientDestructorObserver>();
	}
};
DUMPER7_ASSERTS_UCrMassEnemyAiClientDestructorObserver;

// Class MassAIPrototypeEnemyRuntime.CrAiActionBtTaskRotateToFocus
// 0x0008 (0x00D8 - 0x00D0)
class UCrAiActionBtTaskRotateToFocus final : public UBTTask_RunCrAiAction
{
public:
	float                                         ThresholdAngleDeg;                                 // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawRotationRate;                                   // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiActionBtTaskRotateToFocus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiActionBtTaskRotateToFocus")
	}
	static class UCrAiActionBtTaskRotateToFocus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrAiActionBtTaskRotateToFocus>();
	}
};
DUMPER7_ASSERTS_UCrAiActionBtTaskRotateToFocus;

// Class MassAIPrototypeEnemyRuntime.CrAiActionBtTaskAttack
// 0x0110 (0x01E0 - 0x00D0)
class UCrAiActionBtTaskAttack : public UBTTask_RunCrAiAction
{
public:
	ECrEnemyAttackType                            AttackType;                                        // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWaitForAnimFinishEvent;                           // 0x00D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            DamageGameplayEffect;                              // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BuildingInfectionDamage;                           // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAllowedAttackDistanceKey;                      // 0x00E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
