#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsyncMessageSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AsyncMessageSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AsyncMessageSystem.AsyncAction_ListenForAsyncMessage.StartListeningForAsyncMessage
// 0x0030 (0x0030 - 0x0000)
struct AsyncAction_ListenForAsyncMessage_StartListeningForAsyncMessage final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAsyncMessageId                        MessageId;                                         // 0x0008(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IAsyncMessageBindingEndpointInterface> DesiredEndpoint;                   // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETickingGroup                                 TickGroup;                                         // 0x0020(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForAsyncMessage*     ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncAction_ListenForAsyncMessage_StartListeningForAsyncMessage;

// Function AsyncMessageSystem.AsyncMessageSystemBlueprintLibrary.Conv_AsyncMessageIdToString
// 0x0018 (0x0018 - 0x0000)
struct AsyncMessageSystemBlueprintLibrary_Conv_AsyncMessageIdToString final
{
public:
	struct FAsyncMessageId                        MessageId;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncMessageSystemBlueprintLibrary_Conv_AsyncMessageIdToString;

// Function AsyncMessageSystem.AsyncMessageSystemBlueprintLibrary.GetMessageBlueprintScriptCallstack
// 0x0058 (0x0058 - 0x0000)
struct AsyncMessageSystemBlueprintLibrary_GetMessageBlueprintScriptCallstack final
{
public:
	struct FAsyncMessage                          Message;                                           // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncMessageSystemBlueprintLibrary_GetMessageBlueprintScriptCallstack;

// Function AsyncMessageSystem.AsyncMessageSystemBlueprintLibrary.GetMessageNativeQueueCallstack
// 0x0058 (0x0058 - 0x0000)
struct AsyncMessageSystemBlueprintLibrary_GetMessageNativeQueueCallstack final
{
public:
	struct FAsyncMessage                          Message;                                           // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncMessageSystemBlueprintLibrary_GetMessageNativeQueueCallstack;

// Function AsyncMessageSystem.AsyncMessageSystemBlueprintLibrary.QueueAsyncMessageForBroadcast
// 0x0038 (0x0038 - 0x0000)
struct AsyncMessageSystemBlueprintLibrary_QueueAsyncMessageForBroadcast final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAsyncMessageId                        MessageId;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       Payload;                                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TScriptInterface<class IAsyncMessageBindingEndpointInterface> DesiredEndpoint;                   // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AsyncMessageSystemBlueprintLibrary_QueueAsyncMessageForBroadcast;

}

