#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuAbilities

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "AuItems_structs.hpp"
#include "ChimeraMassCommon_structs.hpp"
#include "NetCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum AuAbilities.ENxAbilityAttribute
// NumValues: 0x0006
enum class ENxAbilityAttribute : uint8
{
	Add                                      = 0,
	Subtract                                 = 1,
	Multiply                                 = 2,
	PercentageAdd                            = 3,
	PercentageSubtract                       = 4,
	ENxAbilityAttribute_MAX                  = 5,
};

// Enum AuAbilities.ENxTargetingType
// NumValues: 0x000A
enum class ENxTargetingType : uint8
{
	SingleLineTrace                          = 0,
	MultiLineTrace                           = 1,
	SingleSphereTrace                        = 2,
	MultiSphereTrace                         = 3,
	SingleSphereOnOwnerTrace                 = 4,
	MultiSphereOnOwnerTrace                  = 5,
	SingleSphereAtLocationTrace              = 6,
	MultiSphereAtLocationTrace               = 7,
	Custom                                   = 8,
	ENxTargetingType_MAX                     = 9,
};

// Enum AuAbilities.ENxTraceType
// NumValues: 0x0003
enum class ENxTraceType : uint8
{
	Object                                   = 0,
	Channel                                  = 1,
	ENxTraceType_MAX                         = 2,
};

// Enum AuAbilities.ENxTraceSync
// NumValues: 0x0003
enum class ENxTraceSync : uint8
{
	Sync                                     = 0,
	Async                                    = 1,
	ENxTraceSync_MAX                         = 2,
};

// Enum AuAbilities.ENxDebugDrawType
// NumValues: 0x0003
enum class ENxDebugDrawType : uint8
{
	Full                                     = 0,
	Points                                   = 1,
	ENxDebugDrawType_MAX                     = 2,
};

// ScriptStruct AuAbilities.AuGameplayAbilityActorInfo
// 0x0010 (0x0058 - 0x0048)
struct FAuGameplayAbilityActorInfo : public FGameplayAbilityActorInfo
{
public:
	TScriptInterface<class IAuTargetingInterface> TargetingInterface;                                // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuGameplayAbilityActorInfo;

// ScriptStruct AuAbilities.AuCustomTargetHandle
// 0x0001 (0x0001 - 0x0000)
struct FAuCustomTargetHandle final
{
public:
	uint8                                         ID;                                                // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FAuCustomTargetHandle;

// ScriptStruct AuAbilities.AuCustomTraceDataHandle
// 0x0018 (0x0018 - 0x0000)
struct FAuCustomTraceDataHandle final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UScriptStruct*                          Type;                                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
};
DUMPER7_ASSERTS_FAuCustomTraceDataHandle;

// ScriptStruct AuAbilities.AuCustomTraceReplicatedData
// 0x0040 (0x0040 - 0x0000)
struct FAuCustomTraceReplicatedData final
{
public:
	struct FAuCustomTargetHandle                  TargetingHandle;                                   // 0x0000(0x0001)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuCustomTraceDataHandle               CustomData;                                        // 0x0008(0x0018)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_20[0x18];                                      // 0x0020(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         ForceRep;                                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuCustomTraceReplicatedData;

// ScriptStruct AuAbilities.AuTargetDataHandle
// 0x0002 (0x0002 - 0x0000)
struct FAuTargetDataHandle final
{
public:
	uint16                                        Handle;                                            // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FAuTargetDataHandle;

// ScriptStruct AuAbilities.AuHitResult
// 0x0060 (0x0060 - 0x0000)
struct FAuHitResult final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_10[0x50];                                      // 0x0010(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuHitResult;

// ScriptStruct AuAbilities.AuTargetData
// 0x0078 (0x0078 - 0x0000)
struct FAuTargetData final
{
public:
	struct FAuTargetDataHandle                    Handle;                                            // 0x0000(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2[0x3E];                                       // 0x0002(0x003E)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Avatar;                                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<struct FAuHitResult>                   Hits;                                              // 0x0048(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FHitResult>                     HitResults;                                        // 0x0058(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x10];                                      // 0x0068(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuTargetData;

// ScriptStruct AuAbilities.AuMinimalActiveEffectArray
// 0x0010 (0x0118 - 0x0108)
struct FAuMinimalActiveEffectArray final : public FFastArraySerializer
{
public:
	uint8                                         Pad_108[0x10];                                     // 0x0108(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuMinimalActiveEffectArray;

// ScriptStruct AuAbilities.AuGameplayEffectContext
// 0x0018 (0x00D8 - 0x00C0)
struct FAuGameplayEffectContext : public FAuItemGameplayEffectContext
{
public:
	uint8                                         Pad_C0[0x18];                                      // 0x00C0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuGameplayEffectContext;

// ScriptStruct AuAbilities.AuCountedGameplayTagItem
// 0x000C (0x0018 - 0x000C)
struct FAuCountedGameplayTagItem final : public FFastArraySerializerItem
{
public:
	struct FGameplayTag                           Tag;                                               // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuCountedGameplayTagItem;

// ScriptStruct AuAbilities.AuCountedGameplayTagReplication
// 0x0140 (0x0248 - 0x0108)
struct FAuCountedGameplayTagReplication final : public FFastArraySerializer
{
public:
	uint8                                         Pad_108[0x70];                                     // 0x0108(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAuCountedGameplayTagItem>      Items;                                             // 0x0178(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ExplicitTags;                                      // 0x0188(0x0020)(NativeAccessSpecifierPublic)
	uint8                                         Pad_1A8[0xA0];                                     // 0x01A8(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuCountedGameplayTagReplication;

// ScriptStruct AuAbilities.AuAbilityReplicationHandle
// 0x0014 (0x0014 - 0x0000)
struct FAuAbilityReplicationHandle final
{
public:
	struct FGameplayAbilitySpecHandle             Spec;                                              // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPredictionKey                         Key;                                               // 0x0004(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuAbilityReplicationHandle;

// ScriptStruct AuAbilities.AuReplicatedProjectile
// 0x0028 (0x0028 - 0x0000)
struct FAuReplicatedProjectile final
{
public:
	struct FGameplayAbilitySpecHandle             Spec;                                              // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPredictionKey                         Key;                                               // 0x0004(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAuAbilityProjectile*>           Projectiles;                                       // 0x0018(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FAuReplicatedProjectile;

// ScriptStruct AuAbilities.AuMinimalActiveEffect
// 0x0024 (0x0030 - 0x000C)
struct FAuMinimalActiveEffect final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayEffect*                        Def;                                               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         Duration;                                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Period;                                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Stack;                                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            Handle;                                            // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuMinimalActiveEffect;

// ScriptStruct AuAbilities.AuGameplayAttributeChangedData
// 0x0090 (0x0090 - 0x0000)
struct FAuGameplayAttributeChangedData final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FAuTargetData                          TargetData;                                        // 0x0008(0x0078)(ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewValue;                                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OldValue;                                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuGameplayAttributeChangedData;

// ScriptStruct AuAbilities.AuPredictedAttributeChange
// 0x0058 (0x0058 - 0x0000)
struct FAuPredictedAttributeChange final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     ModifiedAttribute;                                 // 0x0008(0x0038)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x0040(0x0018)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuPredictedAttributeChange;

// ScriptStruct AuAbilities.AuReplicateCueProperty
// 0x00E8 (0x00E8 - 0x0000)
struct FAuReplicateCueProperty final
{
public:
	struct FGameplayTag                           GameplayCueTag;                                    // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReplicationCounter;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CurrentEvent;                                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 GameplayCueParameters;                             // 0x0010(0x00D8)(ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuReplicateCueProperty;

// ScriptStruct AuAbilities.AuGameplayCueCustomTraceReplicatedData
// 0x0050 (0x0050 - 0x0000)
struct FAuGameplayCueCustomTraceReplicatedData final
{
public:
	struct FAuCustomTargetHandle                  TargetingHandle;                                   // 0x0000(0x0001)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuCustomTraceDataHandle               CustomData;                                        // 0x0008(0x0018)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_20[0x18];                                      // 0x0020(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CueTag;                                            // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         ForceRep;                                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuGameplayCueCustomTraceReplicatedData;

// ScriptStruct AuAbilities.AttributeEffectHandle
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FAttributeEffectHandle final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAttributeEffectHandle;

// ScriptStruct AuAbilities.AuTargetingCameraNetUpdate
// 0x0030 (0x0030 - 0x0000)
struct FAuTargetingCameraNetUpdate final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuTargetingCameraNetUpdate;

// ScriptStruct AuAbilities.AuTargetRequest
// 0x0014 (0x0014 - 0x0000)
struct FAuTargetRequest final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityHandle;                                     // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPredictionKey                         Key;                                               // 0x0004(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FAuTargetRequest;

// ScriptStruct AuAbilities.AuRequestCustomTargetsRPCBatch
// 0x00A8 (0x00A8 - 0x0000)
struct FAuRequestCustomTargetsRPCBatch final
{
public:
	struct FAuTargetData                          ClientResult;                                      // 0x0000(0x0078)(ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuCustomTargetHandle                  InHandle;                                          // 0x0078(0x0001)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuTargetRequest                       RequestHandle;                                     // 0x007C(0x0014)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuCustomTraceDataHandle               CustomData;                                        // 0x0090(0x0018)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuRequestCustomTargetsRPCBatch;

// ScriptStruct AuAbilities.AuGCMTickFunction
// 0x0008 (0x0030 - 0x0028)
struct FAuGCMTickFunction final : public FTickFunction
{
public:
	class UAuGameplayCueManager*                  CueManager;                                        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
};
DUMPER7_ASSERTS_FAuGCMTickFunction;

// ScriptStruct AuAbilities.AuTargeting
// 0x00A8 (0x00A8 - 0x0000)
struct FAuTargeting final
{
public:
	TSubclassOf<class UAuCustomTickTargeting>     CustomTargeting;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENxTargetingType                              TargetingType;                                     // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENxTraceType                                  TraceType;                                         // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETraceTypeQuery                               TraceChannel;                                      // 0x000A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	ECollisionResponse                            CollisionResponse;                                 // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxRange;                                          // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultRange;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENxTraceSync                                  UseAsyncTracing;                                   // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bTraceComplex : 1;                                 // 0x002D(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReturnPhysicalMaterial : 1;                       // 0x002D(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIgnoreSelf : 1;                                   // 0x002D(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bActive : 1;                                       // 0x002D(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bClientOnly : 1;                                   // 0x002D(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  RequiredTags;                                      // 0x0030(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  IgnoreTags;                                        // 0x0050(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FVector                                Extent;                                            // 0x0070(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSecondTrace;                                   // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SecondExtent;                                      // 0x0090(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuTargeting;

// ScriptStruct AuAbilities.AuTickTargetingHandle
// 0x0004 (0x0004 - 0x0000)
struct FAuTickTargetingHandle final
{
public:
	int32                                         Handle;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuTickTargetingHandle;

// ScriptStruct AuAbilities.AuGameplayTargetDataFilter
// 0x0020 (0x0020 - 0x0000)
struct FAuGameplayTargetDataFilter
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     RequiredActorClass;                                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class AActor>>             IgnoreActorClasses;                                // 0x0010(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuGameplayTargetDataFilter;

// ScriptStruct AuAbilities.AuFilterClosestToCrosshair
// 0x0000 (0x0020 - 0x0020)
struct FAuFilterClosestToCrosshair final : public FAuGameplayTargetDataFilter
{
};
DUMPER7_ASSERTS_FAuFilterClosestToCrosshair;

// ScriptStruct AuAbilities.AuGameplayTargetDataFilterHandle
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FAuGameplayTargetDataFilterHandle final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuGameplayTargetDataFilterHandle;

// ScriptStruct AuAbilities.AuCustomTraceRequestConfig
// 0x0038 (0x0038 - 0x0000)
struct FAuCustomTraceRequestConfig final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptStruct*                          CustomStartLocation;                               // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TSubclassOf<class UAuCustomTrace>             CustomTrace;                                       // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENxTraceType                                  TraceType;                                         // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETraceTypeQuery                               TraceChannel;                                      // 0x0019(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	ECollisionResponse                            CollisionResponse;                                 // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bTraceComplex : 1;                                 // 0x0031(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReturnPhysicalMaterial : 1;                       // 0x0031(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIgnoreSelf : 1;                                   // 0x0031(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuCustomTraceRequestConfig;

// ScriptStruct AuAbilities.AuCustomTraceData
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FAuCustomTraceData
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuCustomTraceData;

// ScriptStruct AuAbilities.AuRangeTraceData
// 0x0010 (0x0018 - 0x0008)
struct FAuRangeTraceData final : public FAuCustomTraceData
{
public:
	float                                         Range;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraTraceCutoff;                                 // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RandomSeed;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuRangeTraceData;

// ScriptStruct AuAbilities.AuTraceDebugParams
// 0x0008 (0x0008 - 0x0000)
struct FAuTraceDebugParams final
{
public:
	float                                         Lifetime;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPersistent;                                       // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuTraceDebugParams;

// ScriptStruct AuAbilities.AuCustomTraceStartLocation
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FAuCustomTraceStartLocation final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuCustomTraceStartLocation;

// ScriptStruct AuAbilities.AuCustomTraceRequest
// 0x0038 (0x0038 - 0x0000)
struct FAuCustomTraceRequest final
{
public:
	class UAuCustomTrace*                         CustomTrace;                                       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	ENxTraceType                                  TraceType;                                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETraceTypeQuery                               TraceChannel;                                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	ECollisionResponse                            CollisionResponse;                                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bTraceComplex : 1;                                 // 0x0031(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReturnPhysicalMaterial : 1;                       // 0x0031(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIgnoreSelf : 1;                                   // 0x0031(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuCustomTraceRequest;

// ScriptStruct AuAbilities.AuGATD_HitResultArray
// 0x00C8 (0x00D0 - 0x0008)
struct FAuGATD_HitResultArray final : public FGameplayAbilityTargetData
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetingLocationInfo  SourceLocation;                                    // 0x0010(0x0090)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FHitResult>                     HitResults;                                        // 0x00A0(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCrMassEntityReplicationHelper> MassEntityHandles;                                 // 0x00B0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FAuTargetDataHandle                    Handle;                                            // 0x00C0(0x0002)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C2[0xE];                                       // 0x00C2(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuGATD_HitResultArray;

}

