#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuActorPlacement

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "ChimeraMassCommon_structs.hpp"
#include "AuActorPlacement_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MassRepresentation_classes.hpp"
#include "MassEntity_classes.hpp"


namespace SDK
{

// Class AuActorPlacement.AuActorPlacementComponent
// 0x0638 (0x06F0 - 0x00B8)
class UAuActorPlacementComponent : public UActorComponent
{
public:
	TSubclassOf<class AActor>                     SulphurClass;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuAPPayloadDataHandle                 PlacementDataHandle;                               // 0x00C0(0x0020)(NativeAccessSpecifierPublic)
	class AAuAPHelperActor*                       HelperActor;                                       // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class AAuAPHelperActor*                       PrevHelperActor;                                   // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_F0[0x1C8];                                     // 0x00F0(0x01C8)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPlacementConfirmed;                              // 0x02B8(0x0018)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlacementFailed;                                 // 0x02D0(0x0018)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnActorChanged;                                    // 0x02E8(0x0018)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int64 Direction)> OnBuildingRotationChanged;                       // 0x0300(0x0018)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int64 Direction)> OnBuildingLiftChanged;                           // 0x0318(0x0018)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnDestructionConfirmed;                            // 0x0330(0x0018)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	uint8                                         Pad_348[0x228];                                    // 0x0348(0x0228)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 BuildingSnappedActor;                              // 0x0570(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UStaticMeshSocket*                      BuildingSnappedSocket;                             // 0x0578(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_580[0x10];                                     // 0x0580(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshSocket*                      VerticalSnappedSocket;                             // 0x0590(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_598[0x20];                                     // 0x0598(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CurrentSocketMesh;                                 // 0x05B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UStaticMeshSocket*                      CurrentSocket;                                     // 0x05C0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class AActor*                                 SnappedActor;                                      // 0x05C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_5D0[0x40];                                     // 0x05D0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCrMassEntityReplicationHelper> BuildingsToReplace;                                // 0x0610(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         BuildingActorsToReplace;                           // 0x0620(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	class UAuActorPlacementData*                  LastPlacementData;                                 // 0x0630(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UAuActorPlacementDeveloperSettings*     PlacementDeveloperSettings;                        // 0x0638(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class AAuAPHelperActor*                       AdditionalHelperActor;                             // 0x0640(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class AAuAPHelperActor*                       AdditionalHelperOwnerActor;                        // 0x0648(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class AActor*                                 ActorToConnectTo;                                  // 0x0650(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UStaticMeshSocket*                      FirstRailAutoConnectionSocket;                     // 0x0658(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_660[0x10];                                     // 0x0660(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPlacementSoundType, struct FActorPlacementSounds> PlacementSounds;                         // 0x0670(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         SparksFX;                                          // 0x06C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class USoundBase*                             SparksSFX;                                         // 0x06C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_6D0[0x20];                                     // 0x06D0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FRotator GetActorPlacementRotation();
	const struct FHitResult GetIgnoredPlacementHit();
	const struct FHitResult GetPlacementHit();
	EAuAPlacementConditionResult GetResourceConditionResult();
	bool OnAddZLocationRequest(float DeltaTime);
	bool OnRemoveZLocationRequest(float DeltaTime);
	void ServerDestroyHelper(class AActor* InHelperActor);
	void ServerSetHelperDynamicExtent(const struct FVector& InExtent);
	void ServerSpawnActorFromSubsystem(const struct FAuAPPayloadDataHandle& InPayloadHandle, const struct FTransform& InSpawnTransform, const TArray<struct FVector>& TilesLocations, bool bCurrentFoundation, bool bCurrentTiles, const TArray<struct FCrMassEntityReplicationHelper>& InBuildingsToReplace);
	void ServerSpawnHelperActor(TSubclassOf<class AAuAPHelperActor> HelperClass, const struct FVector& Position, bool bInDynamic, bool bFromClient, const struct FAuAPPayloadDataHandle& InPayloadHandle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuActorPlacementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuActorPlacementComponent")
	}
	static class UAuActorPlacementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuActorPlacementComponent>();
	}
};
DUMPER7_ASSERTS_UAuActorPlacementComponent;

// Class AuActorPlacement.AuActorPlacementCustomCondition
// 0x0000 (0x0028 - 0x0028)
class UAuActorPlacementCustomCondition : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuActorPlacementCustomCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuActorPlacementCustomCondition")
	}
	static class UAuActorPlacementCustomCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuActorPlacementCustomCondition>();
	}
};
DUMPER7_ASSERTS_UAuActorPlacementCustomCondition;

// Class AuActorPlacement.AuCustomPlacementMethod
// 0x0000 (0x0030 - 0x0030)
class UAuCustomPlacementMethod : public UDataAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuCustomPlacementMethod")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuCustomPlacementMethod")
	}
	static class UAuCustomPlacementMethod* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuCustomPlacementMethod>();
	}
};
DUMPER7_ASSERTS_UAuCustomPlacementMethod;

// Class AuActorPlacement.AuActorPlacementData
// 0x0190 (0x01C0 - 0x0030)
class UAuActorPlacementData : public UDataAsset
{
public:
	TSoftClassPtr<class UClass>                   ActorClass;                                        // 0x0030(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AAuAPHelperActor>           HelperActorClass;                                  // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxMultiConfirmPoints;                             // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAuAPlacementPointsRespectingSurface          PointsRespectingSurfaceMode;                       // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RangeOfPointsRespectingSurface;                    // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            HelperActorCustomMesh;                             // 0x0070(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	bool                                          bRepeatedPlacement;                                // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         MeshComponentsToShow;                              // 0x0080(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FString>                         MeshComponentsToAlwaysShow;                        // 0x0090(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                         MinPlacementDistance;                              // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxPlacementDistance;                              // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DroneMinPlacementDistance;                         // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DroneMaxPlacementDistance;                         // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAuCustomPlacementMethod*               CustomPlacementMethod;                             // 0x00B0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UAuActorPlacingConditionsData*          PlacementConditions;                               // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TSubclassOf<class UAuPlaceActorCustom>        CustomPlacement;                                   // 0x00C0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanBePlacedOnOil;                                 // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanBePlacedOnTerrain;                             // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasToBePlacedOnTerrain;                           // 0x00CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapToHitNormal;                                  // 0x00CB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnapToSocketNormal;                               // 0x00CC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class AActor>>             MustHitActors;                                     // 0x00D0(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FAuAPSocketParams                      Socket;                                            // 0x00E0(0x0040)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          AllSocketsShouldBeSnapped;                         // 0x0120(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuAPMassSpawnedEntityType             EntityType;                                        // 0x0128(0x0038)(Edit, Protected, NativeAccessSpecifierProtected)
	class UAuActorPlacementData*                  TilesData;                                         // 0x0160(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UAuActorPlacementData*                  FoundationData;                                    // 0x0168(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	float                                         FoundationYaw;                                     // 0x0170(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceDirectPlacementTrace;                        // 0x0174(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECrBuildingID                                 BuildingID;                                        // 0x0175(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECrBuildingID                                 AdditionalHelperBuildingID;                        // 0x0176(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsExtractor;                                       // 0x0177(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CanSnapToActor;                                    // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CanRotateSnapToActor;                              // 0x0179(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          UseGrid;                                           // 0x017A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ForceAllignToTerrain;                              // 0x017B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CanBlockZLevel;                                    // 0x017C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          UseLowCollisionRestriction;                        // 0x017D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          PlacementHitIgnoreBuildings;                       // 0x017E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          UseBuildingCamera;                                 // 0x017F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CanSetMainMeshZLocation;                           // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxMainMeshZLocationShift;                         // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinMainMeshZLocationShift;                         // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuActorPlacementData*                  FoundationHelperVariant;                           // 0x0190(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UAuActorPlacementData*                  AdditionalHelper;                                  // 0x0198(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	bool                                          RequireHabitat;                                    // 0x01A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          RequiresBeingInsideHabitat;                        // 0x01A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          SplineBased;                                       // 0x01A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CheckBaseCoreArea;                                 // 0x01A3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CheckOutsideBaseCoreArea;                          // 0x01A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECrDirection                                  StartHelperDirection;                              // 0x01A5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A6[0x2];                                      // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   AdditionalButtonText;                              // 0x01A8(0x0010)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	bool                                          UsesConnectors;                                    // 0x01B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ShowConstrucionHudStability;                       // 0x01B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CanRotateInSnapSocket;                             // 0x01BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CheckZAxisTraceCollision;                          // 0x01BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          RequirePlatformConnecting;                         // 0x01BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          StabilityPlatformsHiddenInGame;                    // 0x01BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CanCopyBuilding;                                   // 0x01BE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1BF[0x1];                                      // 0x01BF(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class AActor* GetActorDefaultObject() const;
	class FName GetBuildingUniqueName() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuActorPlacementData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuActorPlacementData")
	}
	static class UAuActorPlacementData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuActorPlacementData>();
	}
};
DUMPER7_ASSERTS_UAuActorPlacementData;

// Class AuActorPlacement.AuActorPlacementDataInterface
// 0x0000 (0x0000 - 0x0000)
class IAuActorPlacementDataInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuActorPlacementDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuActorPlacementDataInterface")
	}
	static class IAuActorPlacementDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAuActorPlacementDataInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAuActorPlacementDataInterface;

// Class AuActorPlacement.AuActorPlacementDeveloperSettings
// 0x0198 (0x01D0 - 0x0038)
class UAuActorPlacementDeveloperSettings final : public UDeveloperSettings
{
public:
	TSubclassOf<class AAuAPHelperActor>           DefaultHelperActorClass;                           // 0x0038(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAuActorPlacementComponent> PlayerHelperComponentClass;                        // 0x0040(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             BuildingTraceChannel;                              // 0x0048(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BuildingTraceMaxDistance;                          // 0x004C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BuildingTraceMinDistance;                          // 0x0050(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InstaRotationAngle;                                // 0x0054(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InstaOffsetValue;                                  // 0x0058(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MouseToTriggerNormalRotation;                      // 0x005C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MouseToTriggerSnappedRotation;                     // 0x0060(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FoundationSocketTag;                               // 0x0068(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DrillBeamTag;                                      // 0x0078(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicalSurface                              GoldPanelSurfaceType;                              // 0x0088(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MoveSpeed;                                         // 0x008C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationSpeed;                                     // 0x0090(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinPitchDown;                                      // 0x0094(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPitchDown;                                      // 0x0098(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinPitchTop;                                       // 0x009C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPitchTop;                                       // 0x00A0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawDebugPlacementInfo;                            // 0x00A4(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GridSizeXY;                                        // 0x00A8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GridSizeZ;                                         // 0x00AC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BuildingDroneSphereRadius;                         // 0x00B0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BuildingDroneSpeedPerSec;                          // 0x00B4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BuildingDroneMaxRadius;                            // 0x00B8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BuildingDroneWarningRadius;                        // 0x00BC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BuildingDroneMaxHeight;                            // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BuildingDroneWarningHeight;                        // 0x00C4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDroneRailLenght;                                // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Cheats;                                            // 0x00CC(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInstanceConstant> GridMaterialInstance;                            // 0x00D0(0x0028)(Edit, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialParameterCollection> GridMaterialParametersCollection;             // 0x00F8(0x0028)(Edit, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> CollisionBoxMaterialInstance;                    // 0x0120(0x0028)(Edit, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GridDistanceFadeout;                               // 0x0148(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             PlatformSnapIcon;                                  // 0x0150(0x0028)(Edit, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> PlatformSnapIconMaterialInstance;                // 0x0178(0x0028)(Edit, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstanceConstant> ConnectorBoxOutlineMaterialInstance;             // 0x01A0(0x0028)(Edit, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 CollisionColor;                                    // 0x01C8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FixedDroneRailConstInstances;                      // 0x01CC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuActorPlacementDeveloperSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuActorPlacementDeveloperSettings")
	}
	static class UAuActorPlacementDeveloperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuActorPlacementDeveloperSettings>();
	}
};
DUMPER7_ASSERTS_UAuActorPlacementDeveloperSettings;

// Class AuActorPlacement.AuActorPlacementFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAuActorPlacementFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static const class UAuActorPlacementData* GetPayloadPlacementData(const struct FAuAPPayloadDataHandle& InHandle);
	static struct FAuAPSplineActorPayloadData GetSplineActorData(const struct FAuAPPayloadDataHandle& InHandle);
	static struct FAuAPPayloadDataHandle MakePayloadHandle(const class UAuActorPlacementData* InPlacementData);
	static struct FAuAPPayloadDataHandle MakeSplineActorData(class USplineComponent* InSpline, const class UAuActorPlacementData* InPlacementData, const struct FActorInstanceHandle& StartActor, const struct FActorInstanceHandle& EndActor);
	static void SetSplineActorData(const struct FAuAPPayloadDataHandle& InHandle, class USplineComponent* InSpline);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuActorPlacementFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuActorPlacementFunctionLibrary")
	}
	static class UAuActorPlacementFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuActorPlacementFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UAuActorPlacementFunctionLibrary;

// Class AuActorPlacement.AuActorPlacementInterface
// 0x0000 (0x0000 - 0x0000)
class IAuActorPlacementInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuActorPlacementInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuActorPlacementInterface")
	}
	static class IAuActorPlacementInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAuActorPlacementInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAuActorPlacementInterface;

// Class AuActorPlacement.AuActorPlacementSocketData
// 0x0020 (0x0050 - 0x0030)
class UAuActorPlacementSocketData final : public UDataAsset
{
public:
	class FName                                   Name_0;                                            // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Tag;                                               // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuActorPlacementSocketData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuActorPlacementSocketData")
	}
	static class UAuActorPlacementSocketData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuActorPlacementSocketData>();
	}
};
DUMPER7_ASSERTS_UAuActorPlacementSocketData;

// Class AuActorPlacement.AuActorPlacementSocketsComponent
// 0x0010 (0x00C8 - 0x00B8)
class UAuActorPlacementSocketsComponent final : public UActorComponent
{
public:
	TArray<struct FAuActorPlacementSingleSocketData> Sockets;                                        // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void SetAllSocketsActive(bool bActive);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuActorPlacementSocketsComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuActorPlacementSocketsComponent")
	}
	static class UAuActorPlacementSocketsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuActorPlacementSocketsComponent>();
	}
};
DUMPER7_ASSERTS_UAuActorPlacementSocketsComponent;

// Class AuActorPlacement.AuActorPlacingConditionsData
// 0x02D0 (0x0300 - 0x0030)
class UAuActorPlacingConditionsData : public UDataAsset
{
public:
	struct FAuAPGridSettings                      Grid;                                              // 0x0030(0x0080)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAuAPRotationSnappingSettings          RotSnapping;                                       // 0x00B0(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCheckSurfaceAngleConditions;                      // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuAPSurfaceAngleConditions            SurfaceAngleConditions;                            // 0x00D8(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCheckStability;                                   // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuAPOffsetSettings                    OffsetSettings;                                    // 0x0100(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UAuActorPlacementCustomCondition> CustomCondition;                             // 0x0120(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             PlaceTraceChannel;                                 // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<EPhysicalSurface>                        AllowedPhysicalSurfaces;                           // 0x0130(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FBodyInstance                          HelperCollisionResponse;                           // 0x0180(0x0180)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuActorPlacingConditionsData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuActorPlacingConditionsData")
	}
	static class UAuActorPlacingConditionsData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuActorPlacingConditionsData>();
	}
};
DUMPER7_ASSERTS_UAuActorPlacingConditionsData;

// Class AuActorPlacement.AuAPHelperActor
// 0x0578 (0x0820 - 0x02A8)
class AAuAPHelperActor : public AActor
{
public:
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 AcceptColor;                                       // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 NoResourceColor;                                   // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 RejectColor;                                       // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 BuildingAndGridPlacementColor;                     // 0x02BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 SimulatedProxyColor;                               // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      HelperMaterial;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterialInstance*                      HelperBoostMaterial;                               // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterialInstance*                      HelperGoldPanelMaterial;                           // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UMaterialInstance*                      HelperGoldPanelBoostMaterial;                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	bool                                          bIgnoreOverlaps;                                   // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class AActor>>             IgnoreActors;                                      // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AActor>>             MainMeshIgnoreActors;                              // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<ECollisionChannel>                     IgnoreObjectTypes;                                 // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AActor>>             TemporaryActors;                                   // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AActor>>             NoAdditionalMeshesActors;                          // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                     AutomaticHeightCollisionClass;                     // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSnappingActive;                                   // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSplineBased;                                      // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCrMassActorReplicationHelper          ActorToReplace;                                    // 0x0350(0x0018)(Edit, Net, EditConst, RepNotify, Protected, NativeAccessSpecifierProtected)
	class USceneComponent*                        Root;                                              // 0x0368(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0370(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0378(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_380[0x2C];                                     // 0x0380(0x002C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bInCompatibleSocket;                               // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshSocket*>              UsedSockets;                                       // 0x03B0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	class UStaticMesh*                            ReplicatedStaticMesh;                              // 0x03C0(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class USkeletalMesh*                          ReplicatedSkeletalMesh;                            // 0x03C8(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	struct FTransform                             MeshRelativeTransform;                             // 0x03D0(0x0060)(Net, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMesh*                            ReplicatedFoundationInstanceMesh;                  // 0x0430(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UStaticMesh*                            ReplicatedTilesInstanceMesh;                       // 0x0438(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	int32                                         FoundationSizeX;                                   // 0x0440(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         FoundationSizeY;                                   // 0x0444(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FoundationYaw;                                     // 0x0448(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFoundationShown;                                  // 0x044C(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAuAPlacementConditionResult                  ReplicatedPlacementConditionResult;                // 0x044D(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44E[0x2];                                      // 0x044E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReplicatedMainMeshZOffset;                         // 0x0450(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ReplicatedIsVisible;                               // 0x0454(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_455[0x3];                                      // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UInstancedStaticMeshComponent*          FoundationISM;                                     // 0x0458(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UInstancedStaticMeshComponent*          TilesISM;                                          // 0x0460(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UInstancedStaticMeshComponent*          CollisionBoxISM;                                   // 0x0468(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UInstancedStaticMeshComponent*          PlatformSnapBoxISM;                                // 0x0470(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UInstancedStaticMeshComponent*          PlatformSnapIconISM;                               // 0x0478(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class UMeshComponent*>                 AllMeshes;                                         // 0x0480(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_490[0xC0];                                     // 0x0490(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SmallSnappingIndex;                                // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         BigSnappingIndex;                                  // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_558[0x58];                                     // 0x0558(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuActorPlacementComponent*             PlacementComponent;                                // 0x05B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_5B8[0xD0];                                     // 0x05B8(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuActorPlacementDeveloperSettings*     PlacementDeveloperSettings;                        // 0x0688(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_690[0x8];                                      // 0x0690(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          OverlapWaterDecalBox;                              // 0x0698(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAuActorPlacementData*                  BuildingData;                                      // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_6A8[0x78];                                     // 0x06A8(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SnappedActor;                                      // 0x0720(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_728[0x10];                                     // 0x0728(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuBuildingGridSubsystem*               GridSubsystem;                                     // 0x0738(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class ADecalActor*                            GridDecal;                                         // 0x0740(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_748[0x8];                                      // 0x0748(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AAuAPHelperActor*                       BasicHelper;                                       // 0x0750(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
