#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuCrafting

#include "Basic.hpp"

#include "AuItems_structs.hpp"


namespace SDK
{

// ScriptStruct AuCrafting.AuItemRecipeOrder
// 0x0010 (0x0010 - 0x0000)
struct FAuItemRecipeOrder final
{
public:
	TSubclassOf<class UAuItemDataBase>            Item;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuItemRecipeOrder;

// ScriptStruct AuCrafting.AuCraftItem
// 0x0050 (0x0050 - 0x0000)
struct FAuCraftItem final
{
public:
	class UAuItemRecipeData*                      RecipeData;                                        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         Amount;                                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAuSimpleItem>                  NeededResources;                                   // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FAuSimpleItem                          OutputItem;                                        // 0x0020(0x0030)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuCraftItem;

}

