#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuGameplay

#include "Basic.hpp"

#include "AuGameplay_structs.hpp"


namespace SDK::Params
{

// Function AuGameplay.AuGameplayBPF.ActorMassLessThan
// 0x0010 (0x0010 - 0x0000)
struct AuGameplayBPF_ActorMassLessThan final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LessThan;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENxComparsionResult                           Result;                                            // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuGameplayBPF_ActorMassLessThan;

// Function AuGameplay.AuGameplayBPF.GetMass
// 0x0010 (0x0010 - 0x0000)
struct AuGameplayBPF_GetMass final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuGameplayBPF_GetMass;

// Function AuGameplay.AuGameplayBPF.GetStaticMesh
// 0x0010 (0x0010 - 0x0000)
struct AuGameplayBPF_GetStaticMesh final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayBPF_GetStaticMesh;

// Function AuGameplay.AuGameplayBPF.GetStaticMeshComponent
// 0x0010 (0x0010 - 0x0000)
struct AuGameplayBPF_GetStaticMeshComponent final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayBPF_GetStaticMeshComponent;

// Function AuGameplay.AuGameplayBPF.MoveStaticMesh
// 0x0010 (0x0010 - 0x0000)
struct AuGameplayBPF_MoveStaticMesh final
{
public:
	class UStaticMeshComponent*                   From;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   To;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayBPF_MoveStaticMesh;

// Function AuGameplay.AuGameplayBPF.MoveStaticMeshActor
// 0x0010 (0x0010 - 0x0000)
struct AuGameplayBPF_MoveStaticMeshActor final
{
public:
	class AActor*                                 From;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 To;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuGameplayBPF_MoveStaticMeshActor;

}

