#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuGear

#include "Basic.hpp"

#include "AuItems_structs.hpp"
#include "AuCore_structs.hpp"


namespace SDK
{

// Enum AuGear.EAuAttachType
// NumValues: 0x0003
enum class EAuAttachType : uint8
{
	MasterSlave                              = 0,
	CopyPose                                 = 1,
	EAuAttachType_MAX                        = 2,
};

// ScriptStruct AuGear.AuSlotHideData
// 0x0040 (0x0040 - 0x0000)
struct FAuSlotHideData final
{
public:
	struct FAuItemSlot                            SlotToHideMeshParts;                               // 0x0000(0x0030)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 HideMaterialSlot;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuSlotHideData;

// ScriptStruct AuGear.AuGearMesh
// 0x0038 (0x0038 - 0x0000)
struct FAuGearMesh final
{
public:
	struct FAuSocketName                          AttachSocket;                                      // 0x0000(0x0008)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SkeletalMeshe;                                     // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UStaticMesh*                            StaticMesh;                                        // 0x0010(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bUseMasterPoseComponent;                           // 0x0018(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimInstance>              AnimInstance;                                      // 0x0020(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAuSlotHideData>                HideSlots;                                         // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAuGearMesh;

}

