#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuItems

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AuItems_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// Class AuItems.AuCustomItemStat
// 0x0000 (0x0028 - 0x0028)
class UAuCustomItemStat final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuCustomItemStat")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuCustomItemStat")
	}
	static class UAuCustomItemStat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuCustomItemStat>();
	}
};
DUMPER7_ASSERTS_UAuCustomItemStat;

// Class AuItems.AuEquipmentItemBarComponent
// 0x0078 (0x0130 - 0x00B8)
class UAuEquipmentItemBarComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(const struct FAuBarID& New, const struct FAuBarID& Old)> OnBarChanged; // 0x00B8(0x0018)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FAuAbilitiesBarContainer               Bars;                                              // 0x00D0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UAuItemsComponent*                      OwnerItemsComponent;                               // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	struct FAuBarID                               CurrentBarID;                                      // 0x0128(0x0004)(Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAuBarID                               ClientPredictedCurrentBarID;                       // 0x012C(0x0004)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_SelectBar(const struct FAuBarID& BarID);
	void OnRep_CurrentBarID(const struct FAuBarID& OldBar);
	void ServerAddItemOnBar(const struct FAuBarID& BarID, const struct FAuBarSlotID& SlotID, const struct FAuItemId& Item, class UAuItemsComponent* FromInventory);
	void ServerSelectBar(const struct FAuBarID& BarID);

	TArray<struct FAuItemSlot> GetBarsItemSlots() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuEquipmentItemBarComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuEquipmentItemBarComponent")
	}
	static class UAuEquipmentItemBarComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuEquipmentItemBarComponent>();
	}
};
DUMPER7_ASSERTS_UAuEquipmentItemBarComponent;

// Class AuItems.AuGenerateItemStats
// 0x0000 (0x0028 - 0x0028)
class UAuGenerateItemStats final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuGenerateItemStats")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuGenerateItemStats")
	}
	static class UAuGenerateItemStats* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuGenerateItemStats>();
	}
};
DUMPER7_ASSERTS_UAuGenerateItemStats;

// Class AuItems.AuEquipmentAttributePool
// 0x0018 (0x0048 - 0x0030)
class UAuEquipmentAttributePool final : public UDataAsset
{
public:
	TSubclassOf<class UAuItemStatsGE>             StatsEffect;                                       // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemDataAttributeContainer          PoolAttributes;                                    // 0x0038(0x0010)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuEquipmentAttributePool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuEquipmentAttributePool")
	}
	static class UAuEquipmentAttributePool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuEquipmentAttributePool>();
	}
};
DUMPER7_ASSERTS_UAuEquipmentAttributePool;

// Class AuItems.AuEquipmentAttributePoolContainer
// 0x0010 (0x0040 - 0x0030)
class UAuEquipmentAttributePoolContainer final : public UDataAsset
{
public:
	TArray<struct FAuRandomAttribute>             Attributes;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuEquipmentAttributePoolContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuEquipmentAttributePoolContainer")
	}
	static class UAuEquipmentAttributePoolContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuEquipmentAttributePoolContainer>();
	}
};
DUMPER7_ASSERTS_UAuEquipmentAttributePoolContainer;

// Class AuItems.AuEquipmentStatsPool
// 0x0010 (0x0040 - 0x0030)
class UAuEquipmentStatsPool final : public UDataAsset
{
public:
	struct FAuItemDataAttributeContainer          PoolAttributes;                                    // 0x0030(0x0010)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuEquipmentStatsPool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuEquipmentStatsPool")
	}
	static class UAuEquipmentStatsPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuEquipmentStatsPool>();
	}
};
DUMPER7_ASSERTS_UAuEquipmentStatsPool;

// Class AuItems.AuEquipmentStatsPoolContainer
// 0x0010 (0x0040 - 0x0030)
class UAuEquipmentStatsPoolContainer final : public UDataAsset
{
public:
	TArray<struct FAuRandomStat>                  Stats;                                             // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuEquipmentStatsPoolContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuEquipmentStatsPoolContainer")
	}
	static class UAuEquipmentStatsPoolContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuEquipmentStatsPoolContainer>();
	}
};
DUMPER7_ASSERTS_UAuEquipmentStatsPoolContainer;

// Class AuItems.AuEquipmentEffectsPool
// 0x0010 (0x0040 - 0x0030)
class UAuEquipmentEffectsPool final : public UDataAsset
{
public:
	TArray<TSubclassOf<class UAuItemStatsGE>>     EffectClass;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuEquipmentEffectsPool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuEquipmentEffectsPool")
	}
	static class UAuEquipmentEffectsPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuEquipmentEffectsPool>();
	}
};
DUMPER7_ASSERTS_UAuEquipmentEffectsPool;

// Class AuItems.AuEquipmentEffectsPoolContainer
// 0x0010 (0x0040 - 0x0030)
class UAuEquipmentEffectsPoolContainer final : public UDataAsset
{
public:
	TArray<struct FAuRandomEffectsPool>           Effects;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuEquipmentEffectsPoolContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuEquipmentEffectsPoolContainer")
	}
	static class UAuEquipmentEffectsPoolContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuEquipmentEffectsPoolContainer>();
	}
};
DUMPER7_ASSERTS_UAuEquipmentEffectsPoolContainer;

// Class AuItems.AuItemRandomProperties
// 0x0018 (0x0048 - 0x0030)
class UAuItemRandomProperties final : public UDataAsset
{
public:
	class UAuEquipmentAttributePoolContainer*     Attributes;                                        // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAuEquipmentStatsPoolContainer*         Stats;                                             // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAuEquipmentEffectsPoolContainer*       Effects;                                           // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemRandomProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemRandomProperties")
	}
	static class UAuItemRandomProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemRandomProperties>();
	}
};
DUMPER7_ASSERTS_UAuItemRandomProperties;

// Class AuItems.AuItemBlueprint
// 0x0000 (0x00A8 - 0x00A8)
class UAuItemBlueprint final : public UBlueprint
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemBlueprint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemBlueprint")
	}
	static class UAuItemBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemBlueprint>();
	}
};
DUMPER7_ASSERTS_UAuItemBlueprint;

// Class AuItems.AuItemDataBase
// 0x03D8 (0x0400 - 0x0028)
class UAuItemDataBase : public UObject
{
public:
	ENxItemStackType                              StackingType;                                      // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxStack;                                          // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ItemTags;                                          // 0x0030(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AssetTags;                                         // 0x0050(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  GrantedTags;                                       // 0x0070(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RequiredTags;                                      // 0x0090(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  DenyTags;                                          // 0x00B0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FPrimaryAssetType                      ItemType;                                          // 0x00D0(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptStruct*                          ItemClass;                                         // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bIsInventoryItem;                                  // 0x00E0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanBeSelectedInStorage;                           // 0x00E1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuMapAbilityEffectContainer           AbilityEffectsToApply;                             // 0x00E8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FAuSystemAbilityContainer              SystemAbilities;                                   // 0x0138(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	bool                                          bAutoGrantAbilitiesAndEffects;                     // 0x0188(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuGrantedAbilityContainer             GrantedAbilities;                                  // 0x0190(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FAuGrantedGameplayEffectContainer      GrantedEffects;                                    // 0x01E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FAuGrantedPassiveAbilityContainer      PassiveAbilities;                                  // 0x01F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FAuItemDataAttributeContainer          ItemStats;                                         // 0x0200(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FAuItemDataAttributeContainer          StatsToGive;                                       // 0x0210(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	TSubclassOf<class UAuItemStatsGE>             StatsToGiveGEClass;                                // 0x0220(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAuItemStatsGE*                         StatsToGiveGE2;                                    // 0x0228(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FSlateBrush                            ItemIcon;                                          // 0x0230(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, Config, Protected, NativeAccessSpecifierProtected)
	class FText                                   ItemName;                                          // 0x02E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, Protected, NativeAccessSpecifierProtected)
	class FName                                   UniqueItemName;                                    // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           GroupsNames;                                       // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	class FText                                   ItemDescription;                                   // 0x0308(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AAuItemPickupBase>          PickupClass;                                       // 0x0318(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMesh*                            ItemMesh;                                          // 0x0320(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	bool                                          bRandomizedTransform;                              // 0x0328(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUIItemType                                   UIItemType;                                        // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUICraftingType                               UICraftingType;                                    // 0x032A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32B[0x5];                                      // 0x032B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   GatheredFrom;                                      // 0x0330(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Config, Protected, NativeAccessSpecifierProtected)
	bool                                          bShowItemName;                                     // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuUseSfxSet                           OnUseSFX_FPP;                                      // 0x0348(0x0058)(Edit, BlueprintVisible, Config, Protected, NativeAccessSpecifierProtected)
	struct FAuUseSfxSet                           OnUseSFX_TPP;                                      // 0x03A0(0x0058)(Edit, BlueprintVisible, Config, Protected, NativeAccessSpecifierProtected)
	uint8                                         Rarity;                                            // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class USoundBase* GetOnUseSound_FPP(uint8 InProfession) const;
	class USoundBase* GetOnUseSound_TPP(uint8 InProfession) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemDataBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemDataBase")
	}
	static class UAuItemDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemDataBase>();
	}
};
DUMPER7_ASSERTS_UAuItemDataBase;

// Class AuItems.AuItemComponentData
// 0x0000 (0x0400 - 0x0400)
class UAuItemComponentData : public UAuItemDataBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemComponentData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemComponentData")
	}
	static class UAuItemComponentData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemComponentData>();
	}
};
DUMPER7_ASSERTS_UAuItemComponentData;

// Class AuItems.AuItemData
// 0x0000 (0x0400 - 0x0400)
class UAuItemData : public UAuItemDataBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemData")
	}
	static class UAuItemData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemData>();
	}
};
DUMPER7_ASSERTS_UAuItemData;

// Class AuItems.AuItemOwnerInterface
// 0x0000 (0x0000 - 0x0000)
class IAuItemOwnerInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemOwnerInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemOwnerInterface")
	}
	static class IAuItemOwnerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAuItemOwnerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAuItemOwnerInterface;

// Class AuItems.AuItemDataBaseSubsystem
// 0x0010 (0x0040 - 0x0030)
class UAuItemDataBaseSubsystem final : public UWorldSubsystem
{
public:
	TArray<class UAuItemDataBase*>                ItemDataBaseArray;                                 // 0x0030(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemDataBaseSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemDataBaseSubsystem")
	}
	static class UAuItemDataBaseSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemDataBaseSubsystem>();
	}
};
DUMPER7_ASSERTS_UAuItemDataBaseSubsystem;

// Class AuItems.AuItemDataBind
// 0x0000 (0x0028 - 0x0028)
class UAuItemDataBind : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemDataBind")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemDataBind")
	}
	static class UAuItemDataBind* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemDataBind>();
	}
};
DUMPER7_ASSERTS_UAuItemDataBind;

// Class AuItems.NxItemFloatDataBind
// 0x0008 (0x0030 - 0x0028)
class UNxItemFloatDataBind final : public UAuItemDataBind
{
public:
	float                                         Value;                                             // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NxItemFloatDataBind")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NxItemFloatDataBind")
	}
	static class UNxItemFloatDataBind* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNxItemFloatDataBind>();
	}
};
DUMPER7_ASSERTS_UNxItemFloatDataBind;

// Class AuItems.AuItemTableFloatDataBind
// 0x0018 (0x0040 - 0x0028)
class UAuItemTableFloatDataBind final : public UAuItemDataBind
{
public:
	class FName                                   RowName;                                           // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ColumnName;                                        // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             DataSource;                                        // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemTableFloatDataBind")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemTableFloatDataBind")
	}
	static class UAuItemTableFloatDataBind* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemTableFloatDataBind>();
	}
};
DUMPER7_ASSERTS_UAuItemTableFloatDataBind;

// Class AuItems.AuStructFloatDataBind
// 0x0010 (0x0038 - 0x0028)
class UAuStructFloatDataBind final : public UAuItemDataBind
{
public:
	class FName                                   RowName;                                           // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScriptStruct*                          DataLayout;                                        // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuStructFloatDataBind")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuStructFloatDataBind")
	}
	static class UAuStructFloatDataBind* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuStructFloatDataBind>();
	}
};
DUMPER7_ASSERTS_UAuStructFloatDataBind;

// Class AuItems.AuItemJsonFloatDataBind
// 0x0010 (0x0038 - 0x0028)
class UAuItemJsonFloatDataBind final : public UAuItemDataBind
{
public:
	class FName                                   FieldName;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   JsonSource;                                        // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemJsonFloatDataBind")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemJsonFloatDataBind")
	}
	static class UAuItemJsonFloatDataBind* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemJsonFloatDataBind>();
	}
};
DUMPER7_ASSERTS_UAuItemJsonFloatDataBind;

// Class AuItems.AuItemGiveComponent
// 0x0020 (0x00D8 - 0x00B8)
class UAuItemGiveComponent final : public UActorComponent
{
public:
	TArray<TSubclassOf<class UAuItemDataBase>>    ItemsToGive;                                       // 0x00B8(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	int32                                         MinResource;                                       // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MaxResource;                                       // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemGiveComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemGiveComponent")
	}
	static class UAuItemGiveComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemGiveComponent>();
	}
};
DUMPER7_ASSERTS_UAuItemGiveComponent;

// Class AuItems.AuItemPickupBase
// 0x0120 (0x03C8 - 0x02A8)
class AAuItemPickupBase : public AActor
{
public:
	TArray<struct FAuItemPickupClass>             ItemClasses;                                       // 0x02A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FAuItemEntryData                       ItemData;                                          // 0x02B8(0x00C0)(Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                        PickupSoundFPP;                                    // 0x0378(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        PickupSoundTPP;                                    // 0x0398(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x03B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void AddItem(class UAuItemsComponent* Inventory);
	void MulticastPlayOnItemPickedEffects(class AActor* PickingActor);
	void OnFound(class APlayerController* FoundBy);
	void OnItemPicked(class AActor* PickingActor);
	void ResetGuid();

	struct FGuid GetGuid() const;
	TArray<class FText> GetItemNames() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemPickupBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemPickupBase")
	}
	static class AAuItemPickupBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAuItemPickupBase>();
	}
};
DUMPER7_ASSERTS_AAuItemPickupBase;

// Class AuItems.AuItemsBPF
// 0x0000 (0x0028 - 0x0028)
class UAuItemsBPF final : public UBlueprintFunctionLibrary
{
public:
	static const bool EqualId(const struct FAuItemId& A, const struct FAuItemId& B);
	static struct FSlateBrush GetIcon(struct FAuItemEntry* Item);
	static const class FText GetItemName(const struct FAuItemEntry& Item);
	static const struct FGameplayTagContainer GetTags(const struct FAuItemEntry& Item);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemsBPF")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemsBPF")
	}
	static class UAuItemsBPF* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemsBPF>();
	}
};
DUMPER7_ASSERTS_UAuItemsBPF;

// Class AuItems.AuItemsComponent
// 0x0918 (0x09D0 - 0x00B8)
class UAuItemsComponent : public UActorComponent
{
public:
	struct FGuid                                  ItemsComponentId;                                  // 0x00B8(0x0010)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAuItemsIdContainer                    OwnedItems;                                        // 0x00C8(0x0120)(Net, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FAuItemSlotArray                       SlottedItemsArray;                                 // 0x01E8(0x0290)(Net, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FAuItemAbilityHandleContainer          ItemAbilityHandles;                                // 0x0478(0x0120)(Net, Protected, NativeAccessSpecifierProtected)
	struct FAuEquipmentItemContainer              ItemContainer;                                     // 0x0598(0x0068)(Edit, Protected, NativeAccessSpecifierProtected)
	class UAuItemsStoreComponent*                 ItemsStore;                                        // 0x0600(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_608[0x140];                                    // 0x0608(0x0140)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAuSlotDefaultItemsData> DefaultSlotItems;                                  // 0x0748(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UAuSlotDefaultItemsData> CheatSlotItems;                                    // 0x0770(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_798[0x230];                                    // 0x0798(0x0230)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                ASC;                                               // 0x09C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static struct FAuItemId GetItemId(const struct FGameplayEventData& EventData);
	static class AActor* GetItemOwner(const struct FGameplayEventData& EventData);
	static const class UAuItemDataBase* GetItemType(const struct FGameplayEventData& EventData);

	void AddCheatSlotsItems();
	void AddDefaultSlotsItems();
	struct FAuItemId BP_AddComponentToItemHandle(const struct FAuItemId& InItem, const struct FAuItemSlot& InComponentSlot, class UAuItemComponentData* InComponentData);
	void BP_MoveComponentToItemHandle(const struct FAuItemId& ModdedItem, const struct FAuItemSlot& AuComponentSlot, const struct FAuItemId& AuComponentId, class UAuItemsComponent* From, bool bRemove);
	void BP_MoveComponentToItems(const struct FAuItemId& ComponentId, const struct FAuItemId& FromId, class UAuItemsComponent* To);
	void BP_MoveComponentToItemsFromItem(const struct FAuItemId& InItemId, const struct FAuItemSlot& InSlot, class UAuItemsComponent* To);
	void BP_MoveItem(const struct FAuItemId& Item, class UAuItemsComponent* From, bool bRemoveFrom);
	void BP_MoveItemToSlot(const struct FAuItemSlot& Slot, const struct FAuItemId& Item, class UAuItemsComponent* From, bool bRemoveFrom);
	void BP_RemoveComponentFromItemHandle(const struct FAuItemId& InItem, const struct FAuItemSlot& InComponentSlot);
	void BP_SetItemOnSlot(const struct FAuItemId& Handle, const struct FAuItemSlot& TargetSlot);
	void K2_ServerAddNewItemToSlot(const class UAuItemData* NewItem, const struct FAuItemSlot& Slot, bool bRemoveIfExists);
	void MulticastResetSlot(const struct FAuItemSlot& SlotToReset);
	void OnRep_ItemsComponentId();
	void OnRep_ItemsDataArray();
	void OnRep_OwnedItems();
	void OnRep_SlottedItemsArray();
	void ServerAckComponentId();
	void ServerAddComponentToItemHandle(const struct FAuItemId& InItem, const struct FAuItemSlot& InComponentSlot, class UAuItemComponentData* InComponentData);
	void ServerAddNewItemBatch(const TArray<struct FAuSimpleItem>& ItemBatch);
	void ServerDestroyItem(const struct FAuItemId& Item);
	void ServerDropItem(const struct FAuItemId& InItemId, bool bRemove, int32 Count);
	void ServerMergeStack(const struct FAuItemId& FromItemId, const struct FAuItemId& ToItemId, float Amount);
	void ServerMoveBetweenSlots(const struct FAuItemSlot& Slot, const struct FAuItemSlot& FromSlot);
	void ServerMoveComponentToItemHandle(const struct FAuItemId& ModdedItem, const struct FAuItemSlot& AuComponentSlot, const struct FAuItemId& AuComponentId, class UAuItemsComponent* From, bool bRemove);
	void ServerMoveComponentToItems(const struct FAuItemId& ComponentId, const struct FAuItemId& FromId, class UAuItemsComponent* To);
	void ServerMoveComponentToItemsFromItem(const struct FAuItemId& InItemId, const struct FAuItemSlot& InSlot, class UAuItemsComponent* To);
	void ServerMoveItem(const struct FAuItemId& Handle, class UAuItemsComponent* From, bool bRemoveFrom);
	void ServerMoveItemToSlot(const struct FAuItemSlot& Slot, const struct FAuItemId& Handle, class UAuItemsComponent* From, bool bRemoveFrom);
	void ServerRemoveComponentFromItemHandle(const struct FAuItemId& InItem, const struct FAuItemSlot& InComponentSlot);
	void ServerRemoveItem(const struct FAuItemId& Item, int32 Amount, bool bRemoveFromStore);
	void ServerRemoveItemByType(const class UAuItemDataBase* InItem, int32 Amount, bool bRemoveFromStore);
	void ServerSetItemOnSlot(const struct FAuItemId& Handle, const struct FAuItemSlot& TargetSlot);
	void ServerSplitStack(const struct FAuItemId& ItemId, float Amount);
	void ServerUseSystemAbilitOnOwnery(class UObject* InOwner, const struct FAuItemId& InItemId, const class UAuItemDataBase* ItemType, const struct FGameplayTag& InAbilityTag);
	void ServerUseSystemAbility(const struct FAuItemId& InItemId, const struct FGameplayTag& InAbilityTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemsComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemsComponent")
	}
	static class UAuItemsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemsComponent>();
	}
};
DUMPER7_ASSERTS_UAuItemsComponent;

// Class AuItems.AuItemsStoreComponent
// 0x0768 (0x0820 - 0x00B8)
class UAuItemsStoreComponent : public UActorComponent
{
public:
	struct FAuItemsArray                          ItemsArray;                                        // 0x00B8(0x0170)(Net, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAuItemComponentsArray                 ItemsComponentsArray;                              // 0x0228(0x01C0)(Net, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAuItemDataArray                       ItemsDataArray;                                    // 0x03E8(0x0170)(Net, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UAuItemsComponent*>              RegisteredComponenets;                             // 0x0558(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	class UAbilitySystemComponent*                ASC;                                               // 0x0568(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_570[0x2B0];                                    // 0x0570(0x02B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientOnItemAdded(const class UAuItemDataBase* NewItem, int32 Amount);
	void OnRep_ItemsArray();
	void OnRep_ItemsComponentId();
	void OnRep_ItemsDataArray();

	struct FAuItemEntry GetItemCopy(const struct FAuItemId& Handle) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemsStoreComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemsStoreComponent")
	}
	static class UAuItemsStoreComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemsStoreComponent>();
	}
};
DUMPER7_ASSERTS_UAuItemsStoreComponent;

// Class AuItems.AuItemStatsGE
// 0x0000 (0x0A90 - 0x0A90)
class UAuItemStatsGE : public UGameplayEffect
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemStatsGE")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemStatsGE")
	}
	static class UAuItemStatsGE* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemStatsGE>();
	}
};
DUMPER7_ASSERTS_UAuItemStatsGE;

// Class AuItems.AuSlotDefaultItemsData
// 0x0010 (0x0040 - 0x0030)
class UAuSlotDefaultItemsData : public UDataAsset
{
public:
	TArray<struct FAuSlotDefaultItem>             Items;                                             // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuSlotDefaultItemsData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuSlotDefaultItemsData")
	}
	static class UAuSlotDefaultItemsData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuSlotDefaultItemsData>();
	}
};
DUMPER7_ASSERTS_UAuSlotDefaultItemsData;

// Class AuItems.AuUseableItemOwnerInterface
// 0x0000 (0x0000 - 0x0000)
class IAuUseableItemOwnerInterface final
{
public:
	void AddItem(const class UAuItemDataBase* InItem, int32 Count);
	void RemoveItem(const struct FAuItemId& InItemId, int32 Count);
	void RemoveItemType(const class UAuItemDataBase* InItem, int32 Count);

	int32 GetItemCount(const class UAuItemDataBase* InItemType) const;
	bool HaveSpace(const class UAuItemDataBase* InItem, int32 Amount) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuUseableItemOwnerInterface")
	}
