#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AuUI_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "AuItems_structs.hpp"


namespace SDK
{

// Class AuUI.AuItemAttributeProvider
// 0x0000 (0x0028 - 0x0028)
class UAuItemAttributeProvider final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemAttributeProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemAttributeProvider")
	}
	static class UAuItemAttributeProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemAttributeProvider>();
	}
};
DUMPER7_ASSERTS_UAuItemAttributeProvider;

// Class AuUI.AuItemViewWidgetOwner
// 0x0000 (0x0000 - 0x0000)
class IAuItemViewWidgetOwner final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemViewWidgetOwner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemViewWidgetOwner")
	}
	static class IAuItemViewWidgetOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAuItemViewWidgetOwner>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAuItemViewWidgetOwner;

// Class AuUI.AuUISettings
// 0x0100 (0x0138 - 0x0038)
class UAuUISettings final : public UDeveloperSettings
{
public:
	struct FAuUIFloatingTextSettings              FloatingTextSettings;                              // 0x0038(0x00B8)(Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAuUIOverheadTargetInfo                OverheadTargetInfo;                                // 0x00F0(0x0048)(Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuUISettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuUISettings")
	}
	static class UAuUISettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuUISettings>();
	}
};
DUMPER7_ASSERTS_UAuUISettings;

// Class AuUI.AuUISubsystem
// 0x0020 (0x0050 - 0x0030)
class UAuUISubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuUISubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuUISubsystem")
	}
	static class UAuUISubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuUISubsystem>();
	}
};
DUMPER7_ASSERTS_UAuUISubsystem;

// Class AuUI.AuItemBaseViewModel
// 0x0168 (0x0190 - 0x0028)
class UAuItemBaseViewModel final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Icon;                                              // 0x0030(0x00B0)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   Name_0;                                            // 0x00E0(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x00F0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemId                              ItemHandle;                                        // 0x00F4(0x0010)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemId                              DestinationItemHandle;                             // 0x0104(0x0010)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuItemSlot                            ItemSlot;                                          // 0x0118(0x0030)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            DestinationItemSlot;                               // 0x0148(0x0030)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UAuItemsComponent>       ItemsComponent;                                    // 0x0178(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UAuItemsComponent>       DestinationComponent;                              // 0x0180(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemBaseViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemBaseViewModel")
	}
	static class UAuItemBaseViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemBaseViewModel>();
	}
};
DUMPER7_ASSERTS_UAuItemBaseViewModel;

// Class AuUI.AuUW_FloatingTextEntry
// 0x0008 (0x03A8 - 0x03A0)
class UAuUW_FloatingTextEntry final : public UUserWidget
{
public:
	class UTextBlock*                             Text;                                              // 0x03A0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuUW_FloatingTextEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuUW_FloatingTextEntry")
	}
	static class UAuUW_FloatingTextEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuUW_FloatingTextEntry>();
	}
};
DUMPER7_ASSERTS_UAuUW_FloatingTextEntry;

// Class AuUI.AuUW_FloatingText
// 0x00B8 (0x0458 - 0x03A0)
class UAuUW_FloatingText final : public UUserWidget
{
public:
	uint8                                         Pad_3A0[0x30];                                     // 0x03A0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            ScaleOverTime;                                     // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UCurveFloat*                            OpacityOverTime;                                   // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_3E0[0x18];                                     // 0x03E0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         Font;                                              // 0x03F8(0x0060)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuUW_FloatingText")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuUW_FloatingText")
	}
	static class UAuUW_FloatingText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuUW_FloatingText>();
	}
};
DUMPER7_ASSERTS_UAuUW_FloatingText;

// Class AuUI.AuUW_ItemSlots
// 0x00B0 (0x0450 - 0x03A0)
class UAuUW_ItemSlots final : public UUserWidget
{
public:
	uint8                                         Pad_3A0[0xA0];                                     // 0x03A0(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAuWidget_ItemSlotView*>         ItemSlots;                                         // 0x0440(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuUW_ItemSlots")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuUW_ItemSlots")
	}
	static class UAuUW_ItemSlots* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuUW_ItemSlots>();
	}
};
DUMPER7_ASSERTS_UAuUW_ItemSlots;

// Class AuUI.AuUW_OverheadTargetInfo
// 0x0018 (0x03B8 - 0x03A0)
class UAuUW_OverheadTargetInfo final : public UUserWidget
{
public:
	uint8                                         Pad_3A0[0x10];                                     // 0x03A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgressBar*                           HealthBar;                                         // 0x03B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuUW_OverheadTargetInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuUW_OverheadTargetInfo")
	}
	static class UAuUW_OverheadTargetInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuUW_OverheadTargetInfo>();
	}
};
DUMPER7_ASSERTS_UAuUW_OverheadTargetInfo;

// Class AuUI.AuUW_OverheadInfoCanvas
// 0x0090 (0x0430 - 0x03A0)
class UAuUW_OverheadInfoCanvas final : public UUserWidget
{
public:
	uint8                                         Pad_3A0[0x30];                                     // 0x03A0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PC;                                                // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_3D8[0x10];                                     // 0x03D8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAuUW_OverheadTargetInfo*>       OTIWidgets;                                        // 0x03E8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_3F8[0x20];                                     // 0x03F8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CurrentTarget;                                     // 0x0418(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_420[0x10];                                     // 0x0420(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuUW_OverheadInfoCanvas")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuUW_OverheadInfoCanvas")
	}
	static class UAuUW_OverheadInfoCanvas* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuUW_OverheadInfoCanvas>();
	}
};
DUMPER7_ASSERTS_UAuUW_OverheadInfoCanvas;

// Class AuUI.AuWidget_AbilitySlot
// 0x04B0 (0x0640 - 0x0190)
class UAuWidget_AbilitySlot final : public UWidget
{
public:
	uint8                                         Pad_190[0x8];                                      // 0x0190(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuItemSlot                            AbilitySlot;                                       // 0x0198(0x0030)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowCooldownText;                                 // 0x01C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowCooldownProgress;                             // 0x01C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowCooldownProgressDirection;                    // 0x01CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1CB[0x1];                                      // 0x01CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreviewTimeRemaining;                              // 0x01CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                            AbilityIcon;                                       // 0x01D0(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            Icon;                                              // 0x0280(0x00B0)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FSlateFontInfo                         Font;                                              // 0x0330(0x0060)(Edit, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   PreviewText;                                       // 0x0390(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TDelegate<void()>                             PreviewTextDelegate;                               // 0x03A0(0x0018)(ZeroConstructor, InstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FProgressBarStyle                      ProgressBarStyle;                                  // 0x03C0(0x0230)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FLinearColor                           ProgressBarFillColorAndOpacity;                    // 0x05F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EProgressBarFillType                          BarFillType;                                       // 0x0600(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_601[0x3];                                      // 0x0601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreviewPercent;                                    // 0x0604(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TDelegate<void()>                             PreviewPercentDelegate;                            // 0x0608(0x0018)(ZeroConstructor, InstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_620[0x20];                                     // 0x0620(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAbilityInputPressed(class UGameplayAbility* Ability, const struct FAuItemSlot& InSlot, bool bActivated);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuWidget_AbilitySlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuWidget_AbilitySlot")
	}
	static class UAuWidget_AbilitySlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuWidget_AbilitySlot>();
	}
};
DUMPER7_ASSERTS_UAuWidget_AbilitySlot;

// Class AuUI.AuWidget_Attribute
// 0x0008 (0x03A8 - 0x03A0)
class UAuWidget_Attribute final : public UUserWidget
{
public:
	uint8                                         Pad_3A0[0x8];                                      // 0x03A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindWidget(const struct FAuGameplayAttribute& Attribute);
	void OnAttributeChanged(float AttributeValue);
	void UnbindWidget(const struct FAuGameplayAttribute& Attribute);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuWidget_Attribute")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuWidget_Attribute")
	}
	static class UAuWidget_Attribute* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuWidget_Attribute>();
	}
};
DUMPER7_ASSERTS_UAuWidget_Attribute;

// Class AuUI.AuItemAttributeAccesor
// 0x0000 (0x0028 - 0x0028)
class UAuItemAttributeAccesor final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemAttributeAccesor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemAttributeAccesor")
	}
	static class UAuItemAttributeAccesor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemAttributeAccesor>();
	}
};
DUMPER7_ASSERTS_UAuItemAttributeAccesor;

// Class AuUI.AuWidget_AttributeItem
// 0x0010 (0x03B0 - 0x03A0)
class UAuWidget_AttributeItem final : public UUserWidget
{
public:
	TSubclassOf<class UAuItemAttributeAccesor>    AttributeAccesor;                                  // 0x03A0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindWidget(const struct FAuItemSlot& ItemSlot, const struct FAuGameplayAttribute& Attribute);
	void OnAttributeChanged(float AttributeValue);
	void UnbindWidget(const struct FAuItemSlot& ItemSlot, const struct FAuGameplayAttribute& Attribute);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuWidget_AttributeItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuWidget_AttributeItem")
	}
	static class UAuWidget_AttributeItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuWidget_AttributeItem>();
	}
};
DUMPER7_ASSERTS_UAuWidget_AttributeItem;

// Class AuUI.AuWidget_AttributeProgressBar
// 0x0000 (0x0430 - 0x0430)
class UAuWidget_AttributeProgressBar final : public UProgressBar
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuWidget_AttributeProgressBar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuWidget_AttributeProgressBar")
	}
	static class UAuWidget_AttributeProgressBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuWidget_AttributeProgressBar>();
	}
};
DUMPER7_ASSERTS_UAuWidget_AttributeProgressBar;

// Class AuUI.AuWidget_AttributeText
// 0x0010 (0x0380 - 0x0370)
class UAuWidget_AttributeText final : public UTextBlock
{
public:
	uint8                                         Pad_370[0x10];                                     // 0x0370(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindAttribute(const struct FAuGameplayAttribute& Attribute);
	void OnAttributeChanged(float AttributeValue);
	void UnbindAttribute(const struct FAuGameplayAttribute& Attribute);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuWidget_AttributeText")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuWidget_AttributeText")
	}
	static class UAuWidget_AttributeText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuWidget_AttributeText>();
	}
};
DUMPER7_ASSERTS_UAuWidget_AttributeText;

// Class AuUI.AuWidget_ItemAttributeText
// 0x0010 (0x0380 - 0x0370)
class UAuWidget_ItemAttributeText final : public UTextBlock
{
public:
	TSubclassOf<class UAuItemAttributeProvider>   AttributeProvider;                                 // 0x0370(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindAttribute(const struct FAuItemSlot& ItemSlot, const struct FAuGameplayAttribute& Attribute);
	void OnAttributeChanged(float AttributeValue);
	void UnbindAttribute(const struct FAuItemSlot& ItemSlot, const struct FAuGameplayAttribute& Attribute);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuWidget_ItemAttributeText")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuWidget_ItemAttributeText")
	}
	static class UAuWidget_ItemAttributeText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuWidget_ItemAttributeText>();
	}
};
DUMPER7_ASSERTS_UAuWidget_ItemAttributeText;

// Class AuUI.AuWidget_ItemContainerView
// 0x0138 (0x04D8 - 0x03A0)
class UAuWidget_ItemContainerView final : public UUserWidget
{
public:
	uint8                                         Pad_3A0[0x10];                                     // 0x03A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    WidgetPool;                                        // 0x03B0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class UUserWidget*>                    Widgets;                                           // 0x03C0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_3D0[0x60];                                     // 0x03D0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                ItemSlotClass;                                     // 0x0430(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_438[0xA0];                                     // 0x0438(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnItemsChanged(const TArray<class UUserWidget*>& OutWidgets);

	TArray<class UUserWidget*> GetItemWidgets() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuWidget_ItemContainerView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuWidget_ItemContainerView")
	}
	static class UAuWidget_ItemContainerView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuWidget_ItemContainerView>();
	}
};
DUMPER7_ASSERTS_UAuWidget_ItemContainerView;

// Class AuUI.AuWidget_ItemSlotView
// 0x00E0 (0x0480 - 0x03A0)
class UAuWidget_ItemSlotView final : public UUserWidget
{
public:
	uint8                                         Pad_3A0[0x10];                                     // 0x03A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuItemSlot                            ItemSlot;                                          // 0x03B0(0x0030)(Edit, BlueprintVisible, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E0[0xA0];                                     // 0x03E0(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnItemAdded();
	void OnItemAddedToSlot(const class FText& ItemName, const struct FSlateBrush& ItemIcon);
	void OnItemRemoved();
	void OnItemRemovedFromSlot();
	void OnSlotMouseEnter();
	void OnSlotMouseLeave();
	void OnSlotSelected();
	void OnSlotUnselected();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuWidget_ItemSlotView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuWidget_ItemSlotView")
	}
	static class UAuWidget_ItemSlotView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuWidget_ItemSlotView>();
	}
};
DUMPER7_ASSERTS_UAuWidget_ItemSlotView;

// Class AuUI.AuWidget_ItemView
// 0x0078 (0x0418 - 0x03A0)
class UAuWidget_ItemView final : public UUserWidget
{
public:
	uint8                                         Pad_3A0[0x78];                                     // 0x03A0(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnItemAdded(const struct FSlateBrush& Icon, const class FText& Name_0, const int32& Count);
	void OnViewMouseEnter(const struct FSlateBrush& Icon, const class FText& Name_0);
	void OnViewMouseLeave(const struct FSlateBrush& Icon, const class FText& Name_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuWidget_ItemView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuWidget_ItemView")
	}
	static class UAuWidget_ItemView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuWidget_ItemView>();
	}
};
DUMPER7_ASSERTS_UAuWidget_ItemView;

// Class AuUI.AuWidget_Notification
// 0x0000 (0x03A0 - 0x03A0)
class UAuWidget_Notification final : public UUserWidget
{
public:
	void OnNotificationAdded();
	void OnNotificationPreRemove();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuWidget_Notification")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuWidget_Notification")
	}
	static class UAuWidget_Notification* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuWidget_Notification>();
	}
};
DUMPER7_ASSERTS_UAuWidget_Notification;

// Class AuUI.AuWidget_NotificationContainer
// 0x0000 (0x03A0 - 0x03A0)
class UAuWidget_NotificationContainer final : public UUserWidget
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuWidget_NotificationContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuWidget_NotificationContainer")
	}
	static class UAuWidget_NotificationContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuWidget_NotificationContainer>();
	}
};
DUMPER7_ASSERTS_UAuWidget_NotificationContainer;

}

