#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuUI

#include "Basic.hpp"

#include "AuItems_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AuUI.AuWidget_AbilitySlot.OnAbilityInputPressed
// 0x0040 (0x0040 - 0x0000)
struct AuWidget_AbilitySlot_OnAbilityInputPressed final
{
public:
	class UGameplayAbility*                       Ability;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuItemSlot                            InSlot;                                            // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivated;                                        // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuWidget_AbilitySlot_OnAbilityInputPressed;

// Function AuUI.AuWidget_Attribute.BindWidget
// 0x0040 (0x0040 - 0x0000)
struct AuWidget_Attribute_BindWidget final
{
public:
	struct FAuGameplayAttribute                   Attribute;                                         // 0x0000(0x0040)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_Attribute_BindWidget;

// Function AuUI.AuWidget_Attribute.OnAttributeChanged
// 0x0004 (0x0004 - 0x0000)
struct AuWidget_Attribute_OnAttributeChanged final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_Attribute_OnAttributeChanged;

// Function AuUI.AuWidget_Attribute.UnbindWidget
// 0x0040 (0x0040 - 0x0000)
struct AuWidget_Attribute_UnbindWidget final
{
public:
	struct FAuGameplayAttribute                   Attribute;                                         // 0x0000(0x0040)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_Attribute_UnbindWidget;

// Function AuUI.AuWidget_AttributeItem.BindWidget
// 0x0070 (0x0070 - 0x0000)
struct AuWidget_AttributeItem_BindWidget final
{
public:
	struct FAuItemSlot                            ItemSlot;                                          // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuGameplayAttribute                   Attribute;                                         // 0x0030(0x0040)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_AttributeItem_BindWidget;

// Function AuUI.AuWidget_AttributeItem.OnAttributeChanged
// 0x0004 (0x0004 - 0x0000)
struct AuWidget_AttributeItem_OnAttributeChanged final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_AttributeItem_OnAttributeChanged;

// Function AuUI.AuWidget_AttributeItem.UnbindWidget
// 0x0070 (0x0070 - 0x0000)
struct AuWidget_AttributeItem_UnbindWidget final
{
public:
	struct FAuItemSlot                            ItemSlot;                                          // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuGameplayAttribute                   Attribute;                                         // 0x0030(0x0040)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_AttributeItem_UnbindWidget;

// Function AuUI.AuWidget_AttributeText.BindAttribute
// 0x0040 (0x0040 - 0x0000)
struct AuWidget_AttributeText_BindAttribute final
{
public:
	struct FAuGameplayAttribute                   Attribute;                                         // 0x0000(0x0040)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_AttributeText_BindAttribute;

// Function AuUI.AuWidget_AttributeText.OnAttributeChanged
// 0x0004 (0x0004 - 0x0000)
struct AuWidget_AttributeText_OnAttributeChanged final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_AttributeText_OnAttributeChanged;

// Function AuUI.AuWidget_AttributeText.UnbindAttribute
// 0x0040 (0x0040 - 0x0000)
struct AuWidget_AttributeText_UnbindAttribute final
{
public:
	struct FAuGameplayAttribute                   Attribute;                                         // 0x0000(0x0040)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_AttributeText_UnbindAttribute;

// Function AuUI.AuWidget_ItemAttributeText.BindAttribute
// 0x0070 (0x0070 - 0x0000)
struct AuWidget_ItemAttributeText_BindAttribute final
{
public:
	struct FAuItemSlot                            ItemSlot;                                          // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuGameplayAttribute                   Attribute;                                         // 0x0030(0x0040)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_ItemAttributeText_BindAttribute;

// Function AuUI.AuWidget_ItemAttributeText.OnAttributeChanged
// 0x0004 (0x0004 - 0x0000)
struct AuWidget_ItemAttributeText_OnAttributeChanged final
{
public:
	float                                         AttributeValue;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_ItemAttributeText_OnAttributeChanged;

// Function AuUI.AuWidget_ItemAttributeText.UnbindAttribute
// 0x0070 (0x0070 - 0x0000)
struct AuWidget_ItemAttributeText_UnbindAttribute final
{
public:
	struct FAuItemSlot                            ItemSlot;                                          // 0x0000(0x0030)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuGameplayAttribute                   Attribute;                                         // 0x0030(0x0040)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_ItemAttributeText_UnbindAttribute;

// Function AuUI.AuWidget_ItemContainerView.OnItemsChanged
// 0x0010 (0x0010 - 0x0000)
struct AuWidget_ItemContainerView_OnItemsChanged final
{
public:
	TArray<class UUserWidget*>                    OutWidgets;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_ItemContainerView_OnItemsChanged;

// Function AuUI.AuWidget_ItemContainerView.GetItemWidgets
// 0x0010 (0x0010 - 0x0000)
struct AuWidget_ItemContainerView_GetItemWidgets final
{
public:
	TArray<class UUserWidget*>                    ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_ItemContainerView_GetItemWidgets;

// Function AuUI.AuWidget_ItemSlotView.OnItemAddedToSlot
// 0x00C0 (0x00C0 - 0x0000)
struct AuWidget_ItemSlotView_OnItemAddedToSlot final
{
public:
	class FText                                   ItemName;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ItemIcon;                                          // 0x0010(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_ItemSlotView_OnItemAddedToSlot;

// Function AuUI.AuWidget_ItemView.OnItemAdded
// 0x00D0 (0x00D0 - 0x0000)
struct AuWidget_ItemView_OnItemAdded final
{
public:
	struct FSlateBrush                            Icon;                                              // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Name_0;                                            // 0x00B0(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x00C0(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AuWidget_ItemView_OnItemAdded;

// Function AuUI.AuWidget_ItemView.OnViewMouseEnter
// 0x00C0 (0x00C0 - 0x0000)
struct AuWidget_ItemView_OnViewMouseEnter final
{
public:
	struct FSlateBrush                            Icon;                                              // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Name_0;                                            // 0x00B0(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_ItemView_OnViewMouseEnter;

// Function AuUI.AuWidget_ItemView.OnViewMouseLeave
// 0x00C0 (0x00C0 - 0x0000)
struct AuWidget_ItemView_OnViewMouseLeave final
{
public:
	struct FSlateBrush                            Icon;                                              // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   Name_0;                                            // 0x00B0(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AuWidget_ItemView_OnViewMouseLeave;

}

