#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_RunCrAiAction_DealDamage

#include "Basic.hpp"

#include "MassAIPrototypeEnemyRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotify_RunCrAiAction_DealDamage.BP_AnimNotify_RunCrAiAction_DealDamage_C
// 0x0018 (0x0050 - 0x0038)
class UBP_AnimNotify_RunCrAiAction_DealDamage_C final : public UCrAnimNotify_RunAiAction
{
public:
	TSubclassOf<class UGameplayEffect>            Damage_Gameplay_Effect;                            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Building_Infection_Damage;                         // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackDistance;                                    // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackConeHalf_Angle;                              // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BuildingAttackDistance;                            // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class UCrAiAction* CreateAiAction(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotify_RunCrAiAction_DealDamage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotify_RunCrAiAction_DealDamage_C")
	}
	static class UBP_AnimNotify_RunCrAiAction_DealDamage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotify_RunCrAiAction_DealDamage_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotify_RunCrAiAction_DealDamage_C;

}

