#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_RunCrAiAction_DealLongAoeDamage

#include "Basic.hpp"

#include "MassAIPrototypeEnemyRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotify_RunCrAiAction_DealLongAoeDamage.BP_AnimNotify_RunCrAiAction_DealLongAoeDamage_C
// 0x0030 (0x0068 - 0x0038)
class UBP_AnimNotify_RunCrAiAction_DealLongAoeDamage_C final : public UCrAnimNotify_RunAiAction
{
public:
	float                                         PushZDistance;                                     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackRadius;                                      // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            Damage_Gameplay_Effect;                            // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Building_Infection_Damage;                         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            Damage_To_Ai_Gameplay_Effect;                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         PlayerMaxPushDistance;                             // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayerPushDuration;                                // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnemyActorPushVelocity;                            // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EnemyEntityPushVelocity;                           // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class UCrAiAction* CreateAiAction(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotify_RunCrAiAction_DealLongAoeDamage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotify_RunCrAiAction_DealLongAoeDamage_C")
	}
	static class UBP_AnimNotify_RunCrAiAction_DealLongAoeDamage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotify_RunCrAiAction_DealLongAoeDamage_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotify_RunCrAiAction_DealLongAoeDamage_C;

}

