#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CloningBed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CloningBed.BP_CloningBed_C
// 0x0070 (0x06C8 - 0x0658)
class ABP_CloningBed_C : public ACrSpawnPointBuilding
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0658(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_CloningBed;                                     // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CloningBed_main_body_top;                       // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Cloningbed;                                     // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CloningBed_door_R;                              // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CloningBed_door_L;                              // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Cloningbed_door_center;                         // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BedOwnedTaken_value_BedOwnedTaken_FBC7F53C4321F647EA6402B789AABC6A; // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BedOwnedTaken_value__Direction_FBC7F53C4321F647EA6402B789AABC6A; // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_695[0x3];                                      // 0x0695(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     BedOwnedTaken_value;                               // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         BedFree_value_BedFree_9322525842C472872A1788863BFF508E; // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BedFree_value__Direction_9322525842C472872A1788863BFF508E; // 0x06A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A5[0x3];                                      // 0x06A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     BedFree_value;                                     // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Window_Opacity_Opacity_ED547ABE48A0BDCBDE2572BEFF8943BE; // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Window_Opacity__Direction_ED547ABE48A0BDCBDE2572BEFF8943BE; // 0x06B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B5[0x3];                                      // 0x06B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Window_Opacity;                                    // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BedWindowMI;                                       // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BedFree_value__FinishedFunc();
	void BedFree_value__UpdateFunc();
	void BedOwnedTaken_value__FinishedFunc();
	void BedOwnedTaken_value__UpdateFunc();
	void ChangeWindowMaterial(class UMaterialInterface* Material);
	void ExecuteUbergraph_BP_CloningBed(int32 EntryPoint);
	void OnBuildingOwnershipChanged(ECrBuildingOwnership NewOwnership);
	void ReceiveBeginPlay();
	void Window_Opacity__FinishedFunc();
	void Window_Opacity__UpdateFunc();

	class FText GetInteractionAdditionalTextFromOwnership(ECrBuildingOwnership InOwnership) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CloningBed_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CloningBed_C")
	}
	static class ABP_CloningBed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CloningBed_C>();
	}
};
DUMPER7_ASSERTS_ABP_CloningBed_C;

}

