#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeathDropItem_Engineer

#include "Basic.hpp"

#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DeathDropItem_Engineer.BP_DeathDropItem_Engineer_C
// 0x0048 (0x0328 - 0x02E0)
class ABP_DeathDropItem_Engineer_C final : public ACrDeathDroppedItems
{
public:
	class UChildActorComponent*                   BP_decal_blood_gradient_a_outdoor;                 // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_decal_blood_gradient_b_outdoor;                 // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_decal_blood_gradient_b_outdoor1;                // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Groom2;                                            // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Groom3;                                            // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGroomComponent*                        Groom1;                                            // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DeathDropItem_Engineer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DeathDropItem_Engineer_C")
	}
	static class ABP_DeathDropItem_Engineer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DeathDropItem_Engineer_C>();
	}
};
DUMPER7_ASSERTS_ABP_DeathDropItem_Engineer_C;

}

