#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Foundable_DeadBody_I

#include "Basic.hpp"

#include "BP_Foundable_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Foundable_DeadBody_I.BP_Foundable_DeadBody_I_C
// 0x0030 (0x0338 - 0x0308)
class ABP_Foundable_DeadBody_I_C final : public ABP_Foundable_Base_C
{
public:
	class UPointLightComponent*                   PointLight;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Flygelly_frombug;                               // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_LootableCorpse_poseWindow;                      // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_visor_poseWindow;                               // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube3;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube5;                                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	bool OnStorageEmptied();
	void UpdateFoundableVisibilityForStorageState(bool BeginPlay);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Foundable_DeadBody_I_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Foundable_DeadBody_I_C")
	}
	static class ABP_Foundable_DeadBody_I_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Foundable_DeadBody_I_C>();
	}
};
DUMPER7_ASSERTS_ABP_Foundable_DeadBody_I_C;

}

