#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Foundable_GasExtractor_D

#include "Basic.hpp"

#include "BP_Foundable_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Foundable_GasExtractor_D.BP_Foundable_GasExtractor_D_C
// 0x0058 (0x0360 - 0x0308)
class ABP_Foundable_GasExtractor_D_C final : public ABP_Foundable_Base_C
{
public:
	class UStaticMeshComponent*                   SM_GasExtractor_Tank_Destroyed_01;                 // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_GasExtractor_Leg_Destroyed_04;                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_GasExtractor_Leg_Destroyed_01;                  // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_GasExtractor_Leg_Destroyed_02;                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube9;                                             // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube8;                                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube7;                                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube6;                                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube3;                                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_GasExtractor_Leg_Destroyed_03;                  // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube5;                                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Foundable_GasExtractor_D_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Foundable_GasExtractor_D_C")
	}
	static class ABP_Foundable_GasExtractor_D_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Foundable_GasExtractor_D_C>();
	}
};
DUMPER7_ASSERTS_ABP_Foundable_GasExtractor_D_C;

}

