#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GatherableCrop_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GatherableCrop_Base.BP_GatherableCrop_Base_C
// 0x0098 (0x05B8 - 0x0520)
class ABP_GatherableCrop_Base_C : public ACrGatherableCropActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        CropDepletedSound;                                 // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             DepletedSound;                                     // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          DepletedSystemAsset;                               // 0x0538(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          DepletedWeakSpotSystemAsset;                       // 0x0560(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class USoundBase*                             DepletedWeakSpotSound;                             // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DepletedNiagaraSystem;                             // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DepletedWeakSpotSystem;                            // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Impulse_Time;                                      // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Impulse_Amplitude;                                 // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Impulse_Cycles;                                    // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnResourceDepletedCosmeticsStart();
	void OnMiningWeakSpotDepletedCosmeticsStart(const struct FTransform& CosmeticTransform);
	void OnLoaded_F9C6F4EF43C5698DA4155CAA098FF4F7(class UObject* Loaded);
	void OnLoaded_967D96A04840A99354E71499E2562BE2(class UObject* Loaded);
	void OnCropReplenishedCosmeticsStart();
	void OnCropDepletedCosmeticsStart();
	void OnBeginPlayShowCropDepletedState();
	void ExecuteUbergraph_BP_GatherableCrop_Base(int32 EntryPoint);
	void BndEvt__DepletedWeakSpotSystem_K2Node_ComponentBoundEvent_1_OnNiagaraSystemFinished__DelegateSignature(class UNiagaraComponent* PSystem);
	void BndEvt__DepletedNiagaraSystem_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature(class UNiagaraComponent* PSystem);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GatherableCrop_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GatherableCrop_Base_C")
	}
	static class ABP_GatherableCrop_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GatherableCrop_Base_C>();
	}
};
DUMPER7_ASSERTS_ABP_GatherableCrop_Base_C;

}

