#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GatherableBaseActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ST_GatherablePlantIstnacedData_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GatherableBaseActor.BP_GatherableBaseActor_C
// 0x0060 (0x0380 - 0x0320)
class ABP_GatherableBaseActor_C : public ACrGatherableBaseActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMainMesh;                                    // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        DepletedSound;                                     // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Impulse_Time;                                      // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Impulse_Amplitude;                                 // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Impulse_Cycles;                                    // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInitCalled;                                       // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInstancedStaticMeshComponent*          LocalVisualizationISMRef;                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalVisualizationInstanceIdx;                     // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FST_GatherablePlantIstnacedData> LocalVisualizationRefs;                           // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ProcessOnInstaceAdded(class UInstancedStaticMeshComponent* InVisualInstancedVisualsComponent, int32 InVisualDataInstanceIdx);
	void ProcessMeshInstancing();
	void ProcessMeshInstanceRemoval();
	void ProcessDataFloatsAfterDepletion(const struct FVector& InInteractingActorLocation);
	void PostPCGSpawnInstanceInitialize();
	void InitializeInstance();
	void ExecuteUbergraph_BP_GatherableBaseActor(int32 EntryPoint);
	void DebugProcessRegularVisualization();
	void BP_ShowInitVisuals();
	void BP_ShowDepletedVisuals(const struct FVector& InInteractingActorLocation);
	void BP_OnVisualInstanceAdded(const struct FCrGatherableInstancedVisualsData& InVisualData);
	void BP_OnRemoveInstancedVisualsRequested();
	void BP_OnDepletedCosmetics(const struct FVector& InInteractingActorLocation, const class ACrCharacterPlayerBase* InInteractingPlayer);
	void BP_DebugToggleRegularVisualization();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GatherableBaseActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GatherableBaseActor_C")
	}
	static class ABP_GatherableBaseActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GatherableBaseActor_C>();
	}
};
DUMPER7_ASSERTS_ABP_GatherableBaseActor_C;

}

