#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HabitatPostProcess_Quality

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HabitatPostProcess_Quality.BP_HabitatPostProcess_Quality_C.OnGlobalIlluminationQualityChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_HabitatPostProcess_Quality_C_OnGlobalIlluminationQualityChanged final
{
public:
	int32                                         Quality;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_HabitatPostProcess_Quality_C_OnGlobalIlluminationQualityChanged;

// Function BP_HabitatPostProcess_Quality.BP_HabitatPostProcess_Quality_C.ExecuteUbergraph_BP_HabitatPostProcess_Quality
// 0x0014 (0x0014 - 0x0000)
struct BP_HabitatPostProcess_Quality_C_ExecuteUbergraph_BP_HabitatPostProcess_Quality final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Quality;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGlobalIlluminationQuality_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_HabitatPostProcess_Quality_C_ExecuteUbergraph_BP_HabitatPostProcess_Quality;

}

