#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HorizontalBridge

#include "Basic.hpp"

#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HorizontalBridge.BP_HorizontalBridge_C
// 0x0028 (0x0858 - 0x0830)
class ABP_HorizontalBridge_C final : public ACrCustomBuilding
{
public:
	class UInteriorOverlapComponent*              InteriorOverlap;                                   // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          InteriorMapperOverlapBox;                          // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  InteriorHotAirDisable;                             // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        DoorAlignment;                                     // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetBuildingMeshes(class UMeshComponent** MainBody, TArray<class UMeshComponent*>* AdditionalMeshes) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_HorizontalBridge_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_HorizontalBridge_C")
	}
	static class ABP_HorizontalBridge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HorizontalBridge_C>();
	}
};
DUMPER7_ASSERTS_ABP_HorizontalBridge_C;

}

