#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Melee_Tier3_LongAoE_SlamAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Melee_Tier3_LongAoE_SlamAttack.BP_Melee_Tier3_LongAoE_SlamAttack_C
// 0x00A8 (0x0350 - 0x02A8)
class ABP_Melee_Tier3_LongAoE_SlamAttack_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   CubeEnd;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CubeStart;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_AoE_SlamAttack;                                 // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PostProcess;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PostprocessBoundingBox;                            // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight;                                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FloorPreviewPlane;                                 // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LightFadeTimeline_LightFadeTrack_E1C7823944983D0F39EBC78D7BF0666A; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            LightFadeTimeline__Direction_E1C7823944983D0F39EBC78D7BF0666A; // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     LightFadeTimeline;                                 // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         DecalDarkTimeline_FadeTrack_75CED22D4A8FD39858F45183226037C8; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DecalDarkTimeline__Direction_75CED22D4A8FD39858F45183226037C8; // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DecalDarkTimeline;                                 // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         DecalLightTimeline_FadeTrack_3EC7EAD046A828935A1FA1A121681599; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DecalLightTimeline__Direction_3EC7EAD046A828935A1FA1A121681599; // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DecalLightTimeline;                                // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         FadeTimeline_FadeTrack_20F486534F8ED6331C475295DF32F578; // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeTimeline__Direction_20F486534F8ED6331C475295DF32F578; // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeTimeline;                                      // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       LightDecalsMaterials;                              // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       DarkDecalsMaterials;                               // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void DecalDarkTimeline__FinishedFunc();
	void DecalDarkTimeline__UpdateFunc();
	void DecalLightTimeline__FinishedFunc();
	void DecalLightTimeline__UpdateFunc();
	void ExecuteUbergraph_BP_Melee_Tier3_LongAoE_SlamAttack(int32 EntryPoint);
	void FadeTimeline__FinishedFunc();
	void FadeTimeline__UpdateFunc();
	void LightFadeTimeline__FinishedFunc();
	void LightFadeTimeline__UpdateFunc();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Melee_Tier3_LongAoE_SlamAttack_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Melee_Tier3_LongAoE_SlamAttack_C")
	}
	static class ABP_Melee_Tier3_LongAoE_SlamAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Melee_Tier3_LongAoE_SlamAttack_C>();
	}
};
DUMPER7_ASSERTS_ABP_Melee_Tier3_LongAoE_SlamAttack_C;

}

