#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MushroomOreMassHighResActorBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MushroomOreMassHighResActorBase.BP_MushroomOreMassHighResActorBase_C
// 0x0080 (0x03B8 - 0x0338)
class ABP_MushroomOreMassHighResActorBase_C final : public ACrOreMassHighResActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAuActorPlacementSocketsComponent*      AuActorPlacementSockets;                           // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        DepletedSoundComponent;                            // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        DepletedWeakSpotSoundComponent;                    // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          DepletedWeakSpotSystemAsset;                       // 0x0358(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UNiagaraComponent*                      DepletedWeakSpotSystem;                            // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          DepletedSystemAsset;                               // 0x0388(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UNiagaraComponent*                      DepletedNiagaraSystem;                             // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_OreMassHighResActorBase_DepletedNiagaraSystem_K2Node_ComponentBoundEvent_1_OnNiagaraSystemFinished__DelegateSignature(class UNiagaraComponent* PSystem);
	void BndEvt__BP_OreMassHighResActorBase_DepletedWeakSpotSystem_K2Node_ComponentBoundEvent_0_OnNiagaraSystemFinished__DelegateSignature(class UNiagaraComponent* PSystem);
	void ExecuteUbergraph_BP_MushroomOreMassHighResActorBase(int32 EntryPoint);
	void OnLoaded_6D1D722841EF9BEB99C631B637E34E1F(class UObject* Loaded);
	void OnLoaded_7C60A1274B0C13768DA120904074AA68(class UObject* Loaded);
	void OnMiningWeakSpotDepletedCosmeticsStart(const struct FTransform& CosmeticTransform);
	void OnResourceDepletedCosmeticsStart();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MushroomOreMassHighResActorBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MushroomOreMassHighResActorBase_C")
	}
	static class ABP_MushroomOreMassHighResActorBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MushroomOreMassHighResActorBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_MushroomOreMassHighResActorBase_C;

}

