#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlacementHelperWalkway

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlacementHelperWalkway.BP_PlacementHelperWalkway_C
// 0x0050 (0x0940 - 0x08F0)
class ABP_PlacementHelperWalkway_C final : public ACrAPHelperActorCustomSpline
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   WalkwayConnector;                                  // 0x08F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class USplineMeshComponent*>           SplineMeshes;                                      // 0x0900(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           Steps;                                             // 0x0910(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsNarrow;                                          // 0x0920(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_921[0x7];                                      // 0x0921(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Stairs_Angle;                                      // 0x0928(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Ladder_Angle;                                      // 0x0930(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void SetSplineSegment(class USplineMeshComponent* SplineMeshComponent, int32 FirstPointIndex, int32 SecondPointIndex);
	void SetMeshColor(const struct FLinearColor& Color);
	void RemoveSteps(int32 Amount);
	void ReceiveTick(float DeltaSeconds);
	void OnSplinePointRemoved(int32 PointIndex);
	void OnSplinePointAdded(int32 PointIndex);
	void OnConfirmedPoint(const struct FAuAPConfirmPointData& NewPoint);
	bool IsRamp();
	bool IsLadder();
	double GetRampAngle();
	void ExecuteUbergraph_BP_PlacementHelperWalkway(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PlacementHelperWalkway_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PlacementHelperWalkway_C")
	}
	static class ABP_PlacementHelperWalkway_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlacementHelperWalkway_C>();
	}
};
DUMPER7_ASSERTS_ABP_PlacementHelperWalkway_C;

}

