#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlacementHelperConnector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlacementHelperConnector.BP_PlacementHelperConnector_C
// 0x0050 (0x0940 - 0x08F0)
class ABP_PlacementHelperConnector_C final : public ACrAPHelperActorCustomSpline
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sphere;                                            // 0x08F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0900(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class USplineMeshComponent*>           SplineMeshes;                                      // 0x0908(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UStaticMeshComponent*>           Steps;                                             // 0x0918(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsNarrow;                                          // 0x0928(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Stairs_Angle;                                      // 0x0930(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Ladder_Angle;                                      // 0x0938(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetSplineSegment(class USplineMeshComponent* SplineMeshComponent, int32 FirstPointIndex, int32 SecondPointIndex);
	void SetMeshColor(const struct FLinearColor& Color);
	void RemoveSteps(int32 Amount);
	void ReceiveTick(float DeltaSeconds);
	void OnSplinePointRemoved(int32 PointIndex);
	void OnSplinePointAdded(int32 PointIndex);
	bool IsRamp();
	bool IsLadder();
	double GetRampAngle();
	void ExecuteUbergraph_BP_PlacementHelperConnector(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PlacementHelperConnector_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PlacementHelperConnector_C")
	}
	static class ABP_PlacementHelperConnector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlacementHelperConnector_C>();
	}
};
DUMPER7_ASSERTS_ABP_PlacementHelperConnector_C;

}

