#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SideLadder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SideLadder.BP_SideLadder_C
// 0x0090 (0x08C0 - 0x0830)
class ABP_SideLadder_C final : public ACrCustomBuilding
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0830(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          LadderTrigger;                                     // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                FootstepsHights;                                   // 0x0848(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             FootstepSound;                                     // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   LadderSurfaceID;                                   // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class ACrCharacterPlayerBase*, double>   CharactersOnLadder;                                // 0x0868(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        CachedLadderHight;                                 // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateCharactersHights();
	void TryTriggerFootstep(class ACrCharacterPlayerBase* Character);
	void RemoveCharacterFromLadder(const class ACrCharacterPlayerBase*& Character);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_SideLadder(int32 EntryPoint);
	void BndEvt__BP_Ladder_LadderTrigger_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_Ladder_LadderTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void AddCharacterToLadder(const class ACrCharacterPlayerBase*& NewCharacter);

	void GetBuildingMeshes(class UMeshComponent** MainBody, TArray<class UMeshComponent*>* AdditionalMeshes) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SideLadder_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SideLadder_C")
	}
	static class ABP_SideLadder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SideLadder_C>();
	}
};
DUMPER7_ASSERTS_ABP_SideLadder_C;

}

