#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_GenericWeaponAbilitiesHelpers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AuAbilities_structs.hpp"


namespace SDK::Params
{

// Function BPFL_GenericWeaponAbilitiesHelpers.BPFL_GenericWeaponAbilitiesHelpers_C.CreateTraceDataBasedOnConfig
// 0x0060 (0x0060 - 0x0000)
struct BPFL_GenericWeaponAbilitiesHelpers_C_CreateTraceDataBasedOnConfig final
{
public:
	struct FAuCustomTargetHandle                  InCustomTargetHandle;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrWeaponItemDataBase*                  InEquippedWeapon;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                InAbilitySystemComponent;                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAuCustomTraceDataHandle               OutTraceData;                                      // 0x0020(0x0018)(Parm, OutParm)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAuCustomTraceDataHandle               CallFunc_MakeTraceDataByTraceConfig_ReturnValue;   // 0x0040(0x0018)()
	float                                         CallFunc_MakeTraceDataByTraceConfig_InRandomSeed_ImplicitCast; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPFL_GenericWeaponAbilitiesHelpers_C_CreateTraceDataBasedOnConfig;

// Function BPFL_GenericWeaponAbilitiesHelpers.BPFL_GenericWeaponAbilitiesHelpers_C.CreateTraceDataBasedOnConfigForPiercing
// 0x0088 (0x0088 - 0x0000)
struct BPFL_GenericWeaponAbilitiesHelpers_C_CreateTraceDataBasedOnConfigForPiercing final
{
public:
	struct FAuCustomTargetHandle                  InCustomTargetHandle;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrWeaponItemDataBase*                  InEquippedWeapon;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                InAbilitySystemComponent;                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     OriginalHitResults;                                // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAuCustomTraceDataHandle               OutTraceData;                                      // 0x0030(0x0018)(Parm, OutParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrWeaponComponent*                     CallFunc_BP_GetWeaponComponent_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPossibleEnemiesHitPerTrace_ReturnValue; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAuCustomTraceDataHandle               CallFunc_MakeTraceDataByPiercingTraceConfig_ReturnValue; // 0x0070(0x0018)()
};
DUMPER7_ASSERTS_BPFL_GenericWeaponAbilitiesHelpers_C_CreateTraceDataBasedOnConfigForPiercing;

}

