#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPW_Button.BPW_Button_C
// 0x0040 (0x03E0 - 0x03A0)
class UBPW_Button_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             txt_caption;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                btn_w_text;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Caption;                                           // 0x03B8(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              ButtonClicked;                                     // 0x03C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UpdateLabel(const class FText& Label);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_BPW_Button(int32 EntryPoint);
	void BndEvt__BPW_Button_btn_w_text_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPW_Button_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPW_Button_C")
	}
	static class UBPW_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPW_Button_C>();
	}
};
DUMPER7_ASSERTS_UBPW_Button_C;

}

