#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_DevStats_DLSSSR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "DLSSBlueprint_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPW_DevStats_DLSSSR.BPW_DevStats_DLSSSR_C
// 0x0048 (0x03E8 - 0x03A0)
class UBPW_DevStats_DLSSSR_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPW_Stat_C*                            t_optimal_sharpness;                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_Stat_C*                            t_optimal_screenper;                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_Stat_C*                            t_dlss_screenper;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_Stat_C*                            t_dlss_modescreenper;                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_Stat_C*                            t_dlss_mindriver;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_Stat_C*                            t_dlss_fixedscreen;                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPW_Stat_C*                            t_dlss_driverdate;                                 // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                brd_dlss_dev_stats;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateDLSSStats(EUDLSSMode CurrentDLSSMode);
	void SetStatVisiblity(bool IsVisisble, EUDLSSMode CurrentDLSSMode);
	void ExecuteUbergraph_BPW_DevStats_DLSSSR(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPW_DevStats_DLSSSR_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPW_DevStats_DLSSSR_C")
	}
	static class UBPW_DevStats_DLSSSR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPW_DevStats_DLSSSR_C>();
	}
};
DUMPER7_ASSERTS_UBPW_DevStats_DLSSSR_C;

}

