#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_Melee_Tier1_Actor_FindRandomNavPositionInRingSection

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_Melee_Tier1_Actor_FindRandomNavPositionInRingSection.BTTask_Melee_Tier1_Actor_FindRandomNavPositionInRingSection_C
// 0x00E0 (0x0188 - 0x00A8)
class UBTTask_Melee_Tier1_Actor_FindRandomNavPositionInRingSection_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        InInnerRadius;                                     // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InOuterRadius;                                     // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InRingSectionAngleDegMinMax;                       // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 InTargetActor;                                     // 0x00D0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 InSelfActor;                                       // 0x00F8(0x0028)(Edit, BlueprintVisible)
	double                                        CachedResultCircleRadius;                          // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CachedCurrentTargetLocation;                       // 0x0128(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultCircleCenterLocation;                        // 0x0140(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UNavigationQueryFilter>     InNavFilter;                                       // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 OutResultPosition;                                 // 0x0160(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTTask_Melee_Tier1_Actor_FindRandomNavPositionInRingSection(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_Melee_Tier1_Actor_FindRandomNavPositionInRingSection_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_Melee_Tier1_Actor_FindRandomNavPositionInRingSection_C")
	}
	static class UBTTask_Melee_Tier1_Actor_FindRandomNavPositionInRingSection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_Melee_Tier1_Actor_FindRandomNavPositionInRingSection_C>();
	}
};
DUMPER7_ASSERTS_UBTTask_Melee_Tier1_Actor_FindRandomNavPositionInRingSection_C;

}

