#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChimeraUI

#include "Basic.hpp"

#include "MassEntity_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ChimeraUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "ChimeraRichText_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "AuActorPlacement_structs.hpp"
#include "Chimera_structs.hpp"
#include "Chimera_classes.hpp"
#include "CommonGame_structs.hpp"
#include "CommonGame_classes.hpp"
#include "InputCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "AuItems_structs.hpp"
#include "AuNotification_structs.hpp"
#include "AuNotification_classes.hpp"
#include "AuTooltips_classes.hpp"
#include "ChimeraMassCommon_structs.hpp"
#include "AuActorWidgets_classes.hpp"
#include "GameSettings_classes.hpp"


namespace SDK
{

// Class ChimeraUI.CrBuildingsStatusData
// 0x0010 (0x0040 - 0x0030)
class UCrBuildingsStatusData final : public UDataAsset
{
public:
	TArray<struct FCrWidgetData>                  ExtraStatuses;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrBuildingsStatusData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrBuildingsStatusData")
	}
	static class UCrBuildingsStatusData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrBuildingsStatusData>();
	}
};
DUMPER7_ASSERTS_UCrBuildingsStatusData;

// Class ChimeraUI.BuildingWidgetSettingsData
// 0x0058 (0x0088 - 0x0030)
class UBuildingWidgetSettingsData final : public UDataAsset
{
public:
	TArray<TSoftClassPtr<class UClass>>           ActorClasses;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         WidgetClass;                                       // 0x0040(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPlayerInventory;                                 // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanShowInventory;                                  // 0x0061(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasScrollbar;                                     // 0x0062(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftClassPath>                 TabsClasses;                                       // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     ButtonTextures;                                    // 0x0078(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BuildingWidgetSettingsData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BuildingWidgetSettingsData")
	}
	static class UBuildingWidgetSettingsData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuildingWidgetSettingsData>();
	}
};
DUMPER7_ASSERTS_UBuildingWidgetSettingsData;

// Class ChimeraUI.CrUW_ManageServerChildTemplate
// 0x0038 (0x0400 - 0x03C8)
class UCrUW_ManageServerChildTemplate : public UCommonUserWidget
{
public:
	class UEditableText*                          InputTextField;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_3D0[0x30];                                     // 0x03D0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrUW_ManageServerChildTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrUW_ManageServerChildTemplate")
	}
	static class UCrUW_ManageServerChildTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrUW_ManageServerChildTemplate>();
	}
};
DUMPER7_ASSERTS_UCrUW_ManageServerChildTemplate;

// Class ChimeraUI.CrActionBoundRichTextBlockDecorator
// 0x0020 (0x0048 - 0x0028)
class UCrActionBoundRichTextBlockDecorator : public URichTextBlockDecorator
{
public:
	TSubclassOf<class UCrUW_BoundActionButton>    ActionButtonClass;                                 // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                Margin;                                            // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UDataTable*                             InputImageSet;                                     // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrActionBoundRichTextBlockDecorator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrActionBoundRichTextBlockDecorator")
	}
	static class UCrActionBoundRichTextBlockDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrActionBoundRichTextBlockDecorator>();
	}
};
DUMPER7_ASSERTS_UCrActionBoundRichTextBlockDecorator;

// Class ChimeraUI.CrArmoryFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UCrArmoryFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrArmoryFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrArmoryFunctionLibrary")
	}
	static class UCrArmoryFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrArmoryFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UCrArmoryFunctionLibrary;

// Class ChimeraUI.CrCommonUIColorsDevSettings
// 0x0080 (0x00B8 - 0x0038)
class UCrCommonUIColorsDevSettings final : public UDeveloperSettings
{
public:
	struct FLinearColor                           DefaultColor;                                      // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           HighlightColor;                                    // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WarningColor;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           CriticalColor;                                     // 0x0068(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultOrange;                                     // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultDisabled;                                   // 0x0088(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ButtonPressedColor;                                // 0x0098(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ButtonHoveredColor;                                // 0x00A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrCommonUIColorsDevSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrCommonUIColorsDevSettings")
	}
	static class UCrCommonUIColorsDevSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrCommonUIColorsDevSettings>();
	}
};
DUMPER7_ASSERTS_UCrCommonUIColorsDevSettings;

// Class ChimeraUI.CrCratingQueueElementDataForUI
// 0x0050 (0x0078 - 0x0028)
class UCrCratingQueueElementDataForUI final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrCratingQueueElementDataForUI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrCratingQueueElementDataForUI")
	}
	static class UCrCratingQueueElementDataForUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrCratingQueueElementDataForUI>();
	}
};
DUMPER7_ASSERTS_UCrCratingQueueElementDataForUI;

// Class ChimeraUI.CrCraftingRecipeDataForUI
// 0x0050 (0x0078 - 0x0028)
class UCrCraftingRecipeDataForUI final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrCraftingRecipeDataForUI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrCraftingRecipeDataForUI")
	}
	static class UCrCraftingRecipeDataForUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrCraftingRecipeDataForUI>();
	}
};
DUMPER7_ASSERTS_UCrCraftingRecipeDataForUI;

// Class ChimeraUI.CrUW_SafeZoneEditor
// 0x0058 (0x0590 - 0x0538)
class UCrUW_SafeZoneEditor final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_538[0x28];                                     // 0x0538(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCanCancel;                                        // 0x0560(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_561[0xF];                                      // 0x0561(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetSwitcher*                        Switcher_SafeZoneMessage;                          // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UCommonRichTextBlock*                   RichText_Default;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UCommonButtonBase*                      Button_Back;                                       // 0x0580(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UCommonButtonBase*                      Button_Done;                                       // 0x0588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	void HandleBackClicked();
	void HandleDoneClicked();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrUW_SafeZoneEditor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrUW_SafeZoneEditor")
	}
	static class UCrUW_SafeZoneEditor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrUW_SafeZoneEditor>();
	}
};
DUMPER7_ASSERTS_UCrUW_SafeZoneEditor;

// Class ChimeraUI.CrDragDropOperation
// 0x0028 (0x00D0 - 0x00A8)
class UCrDragDropOperation final : public UDragDropOperation
{
public:
	uint8                                         Pad_A8[0x28];                                      // 0x00A8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrDragDropOperation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrDragDropOperation")
	}
	static class UCrDragDropOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrDragDropOperation>();
	}
};
DUMPER7_ASSERTS_UCrDragDropOperation;

// Class ChimeraUI.MyVisualDragDropWidget
// 0x0010 (0x03D8 - 0x03C8)
class UMyVisualDragDropWidget final : public UCommonUserWidget
{
public:
	class UImage*                                 ItemIcon;                                          // 0x03C8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UBorder*                                ItemBackground;                                    // 0x03D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MyVisualDragDropWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MyVisualDragDropWidget")
	}
	static class UMyVisualDragDropWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMyVisualDragDropWidget>();
	}
};
DUMPER7_ASSERTS_UMyVisualDragDropWidget;

// Class ChimeraUI.CrEncyclopediaRichTextBlockHyperlinkDecorator
// 0x00B0 (0x0780 - 0x06D0)
class UCrEncyclopediaRichTextBlockHyperlinkDecorator final : public UCrRichTextBlockHyperlinkDecorator
{
public:
	struct FSlateBrush                            NewEntryIcon;                                      // 0x06D0(0x00B0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrEncyclopediaRichTextBlockHyperlinkDecorator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrEncyclopediaRichTextBlockHyperlinkDecorator")
	}
	static class UCrEncyclopediaRichTextBlockHyperlinkDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrEncyclopediaRichTextBlockHyperlinkDecorator>();
	}
};
DUMPER7_ASSERTS_UCrEncyclopediaRichTextBlockHyperlinkDecorator;

// Class ChimeraUI.CrCorporationDataForUI
// 0x0068 (0x0090 - 0x0028)
class UCrCorporationDataForUI final : public UObject
{
public:
	uint8                                         Pad_28[0x68];                                      // 0x0028(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrCorporationDataForUI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrCorporationDataForUI")
	}
	static class UCrCorporationDataForUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrCorporationDataForUI>();
	}
};
DUMPER7_ASSERTS_UCrCorporationDataForUI;

// Class ChimeraUI.CrHUD
// 0x00B8 (0x0450 - 0x0398)
class ACrHUD : public AHUD
{
public:
	class FName                                   InventoryMenuContextName;                          // 0x0398(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  InventoryCancelAbilitiesTags;                      // 0x03A0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCrUW_QuickUseMenu>         QuickUseMenuClass;                                 // 0x03C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   InGameMenuClass;                                   // 0x03C8(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCrUW_OnScreenBuildingResultNotification> BuildingResultNotificationClass;     // 0x03F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           ProfessionSelectionLayerTag;                       // 0x03F8(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCrUW_CharacterSelectionMenu> ProfessionSelectionMenuClass;                    // 0x0400(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCrUW_CharacterSelectionMenu*           ProfessionSelectionMenuWidget;                     // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FGameplayTag                           PopupInfoWindowLayerTag;                           // 0x0410(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCrUW_InfoPopupWindowWidget> PopupInfoWindowClass;                             // 0x0418(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCrUW_QuickUseMenu*                     QuickUseMenu;                                      // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UCrUW_OnScreenBuildingResultNotification* BuildingResultNotification;                      // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_430[0x20];                                     // 0x0430(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UCrUW_CharacterSelectionMenu* GetProfessionSelectionWidget();
	void OnShowObjectivesHUD();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrHUD")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrHUD")
	}
	static class ACrHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACrHUD>();
	}
};
DUMPER7_ASSERTS_ACrHUD;

// Class ChimeraUI.CrHUDSettings
// 0x0070 (0x00A8 - 0x0038)
class UCrHUDSettings final : public UDeveloperSettings
{
public:
	float                                         CoopHudHeadVerticalOffset;                         // 0x0038(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallenCoopBorderOffset;                            // 0x003C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVisibleCoopHudDistance;                         // 0x0040(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinVisibleCoopHudDistance;                         // 0x0044(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVisibleHPDistance;                              // 0x0048(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinVisibleHPDistance;                              // 0x004C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NickLengthLimit;                                   // 0x0050(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCrPlayerStatusIconsPriorityData> StatusIconsData;                          // 0x0058(0x0028)(Edit, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStringTable>            SystemMessagesStringTable;                         // 0x0080(0x0028)(Edit, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrHUDSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrHUDSettings")
	}
	static class UCrHUDSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrHUDSettings>();
	}
};
DUMPER7_ASSERTS_UCrHUDSettings;

// Class ChimeraUI.CrItemListWidgetOwnerInterface
// 0x0000 (0x0000 - 0x0000)
class ICrItemListWidgetOwnerInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrItemListWidgetOwnerInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrItemListWidgetOwnerInterface")
	}
	static class ICrItemListWidgetOwnerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICrItemListWidgetOwnerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICrItemListWidgetOwnerInterface;

// Class ChimeraUI.CrMainMenuRichTextBlockHyperlinkDecorator
// 0x0000 (0x06D0 - 0x06D0)
class UCrMainMenuRichTextBlockHyperlinkDecorator final : public UCrRichTextBlockHyperlinkDecorator
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMainMenuRichTextBlockHyperlinkDecorator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMainMenuRichTextBlockHyperlinkDecorator")
	}
	static class UCrMainMenuRichTextBlockHyperlinkDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMainMenuRichTextBlockHyperlinkDecorator>();
	}
};
DUMPER7_ASSERTS_UCrMainMenuRichTextBlockHyperlinkDecorator;

// Class ChimeraUI.CrMainMenuScalabilityOverrides
// 0x0000 (0x0028 - 0x0028)
class UCrMainMenuScalabilityOverrides final : public UObject
{
public:
	static void ApplyScalabilityOverrides(const TArray<class FString>& Commands);
	static void ResetScalabilityOverrides(const TArray<class FString>& Commands);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMainMenuScalabilityOverrides")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMainMenuScalabilityOverrides")
	}
	static class UCrMainMenuScalabilityOverrides* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMainMenuScalabilityOverrides>();
	}
};
DUMPER7_ASSERTS_UCrMainMenuScalabilityOverrides;

// Class ChimeraUI.CrMapManuSubsystem
// 0x0088 (0x00C8 - 0x0040)
class UCrMapManuSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x60];                                      // 0x0040(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture2D*>                     FOWTextures;                                       // 0x00A0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class UMaterialInstanceDynamic*>       FOWMaterials;                                      // 0x00B0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAntennasOwnerReplicated();
	void OnCheatFogOfWarClear(int32 FogValue);
	void OnCheatShowDebugMapBorderTexture(bool Show);
	void OnGameStateSetEvent(class AGameStateBase* GameState);
	void OnWorldBeginPlayFinished();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMapManuSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMapManuSubsystem")
	}
	static class UCrMapManuSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMapManuSubsystem>();
	}
};
DUMPER7_ASSERTS_UCrMapManuSubsystem;

// Class ChimeraUI.CrMapMenuCategoryData
// 0x00E0 (0x0110 - 0x0030)
class UCrMapMenuCategoryData : public UDataAsset
{
public:
	bool                                          CategoryBlocked;                                   // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MarkerName;                                        // 0x0038(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Icon;                                              // 0x0050(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          RotateToDirection;                                 // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanBeHiddenByFogOfWar;                             // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanShowDetails;                                    // 0x0102(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CategoryPriority;                                  // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECrMapMenuMarkerFilter                        LegendFilter;                                      // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMapMenuCategoryData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMapMenuCategoryData")
	}
	static class UCrMapMenuCategoryData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMapMenuCategoryData>();
	}
};
DUMPER7_ASSERTS_UCrMapMenuCategoryData;

// Class ChimeraUI.CrMapMenuDevSettings
// 0x0458 (0x0490 - 0x0038)
class UCrMapMenuDevSettings final : public UDeveloperSettings
{
public:
	float                                         MaxZoom;                                           // 0x0038(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultZoom;                                       // 0x003C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinZoom;                                           // 0x0040(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MarkerMergingMinimalDistance;                      // 0x0044(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MarkerMergingDistanceZoomFactor;                   // 0x0048(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MarkerMergingDistanceZoomStep;                     // 0x004C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              MapAreaPivotPoint;                                 // 0x0050(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              ForgottenEngineMarkerLocation;                     // 0x005C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              FogOfWarSegmentsGridSize;                          // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              FogOfWarRenderTargetSize;                          // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogOfWarPlayerUncoverRadius;                       // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogOfWarAntenaUncoverRadius;                       // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCrMapMenuCategoryData>  PlayerMarkerCateroryData;                          // 0x0080(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCrMapMenuCategoryData>  PersonalMarkerCateroryData;                        // 0x00A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCrMapMenuCategoryData>  CoopMarkerCateroryData;                            // 0x00D0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCrMapMenuCategoryData>  EnemyMarkerCateroryData;                           // 0x00F8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCrMapMenuFootstepsData> FootstepMarkerCateroryData;                        // 0x0120(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCrMapMenuCategoryData>  InfectionMarkerCateroryData;                       // 0x0148(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCrMapMenuCategoryData>  AttackSpawnerCategoryData;                         // 0x0170(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCrMapMenuCategoryData>  AttackWaveCategoryData;                            // 0x0198(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, TSoftObjectPtr<class UCrMapMenuCategoryData>> BuildingUniqueNameMarkerCateroryData; // 0x01C0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<ECrBuildingType, TSoftObjectPtr<class UCrMapMenuCategoryData>> BuildingTypeMarkerCateroryData; // 0x0210(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<ECrFoundableType, TSoftObjectPtr<class UCrMapMenuCategoryData>> FoundableTypeMarkerCategoryData; // 0x0260(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<ECrPointOfInterestType, TSoftObjectPtr<class UCrMapMenuPOIData>> PointOfInterestTypeMarkerCategoryData; // 0x02B0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCrMapMenuMarkerDefaultColorData> MarkerStatusesColorData;                  // 0x0300(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             BuildingMarkerNameNotAllowed;                      // 0x0328(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         UpdateBuildingMarkersPeriod;                       // 0x0378(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCrMapMenuFiltersData>   MapMenuFiltersData;                                // 0x0380(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCrMarkerMalfunctionIcon>       BuildingMalfunctionIconPrioritized;                // 0x03A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         MinFootstepDistance;                               // 0x03B8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxFootstepCount;                                  // 0x03BC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DiminishingFootstepCount;                          // 0x03C0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InfectionWarningIconDisplayTime;                   // 0x03C4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCrMapMenuTerrainData>   TerrainData;                                       // 0x03C8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<ECrBuildingMalfunctionFlags, class FText> BuildingMalfunctionDetails;                       // 0x03F0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<ECrMapMenuMarkerFilter, class FText>     MarkerTypeAdditionalDetails;                       // 0x0440(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMapMenuDevSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMapMenuDevSettings")
	}
	static class UCrMapMenuDevSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMapMenuDevSettings>();
	}
};
DUMPER7_ASSERTS_UCrMapMenuDevSettings;

// Class ChimeraUI.CrMapMenuFiltersData
// 0x0010 (0x0040 - 0x0030)
class UCrMapMenuFiltersData final : public UDataAsset
{
public:
	TArray<struct FCrMarkerFilterApperance>       MarkerFiltersApperance;                            // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMapMenuFiltersData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMapMenuFiltersData")
	}
	static class UCrMapMenuFiltersData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMapMenuFiltersData>();
	}
};
DUMPER7_ASSERTS_UCrMapMenuFiltersData;

// Class ChimeraUI.CrMapMenuFootstepsData
// 0x0050 (0x0160 - 0x0110)
class UCrMapMenuFootstepsData final : public UCrMapMenuCategoryData
{
public:
	bool                                          UseScaleInsteadOfColor;                            // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HigherColorMaxDifference;                          // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HigherColorMinDifference;                          // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowerColorMaxDifference;                           // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowerColorMinDifference;                           // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           HigherLocationColor;                               // 0x0124(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NeutralLocationColor;                              // 0x0134(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LowerLocationColor;                                // 0x0144(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HigherScale;                                       // 0x0154(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NeutralScale;                                      // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowerScale;                                        // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMapMenuFootstepsData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMapMenuFootstepsData")
	}
	static class UCrMapMenuFootstepsData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMapMenuFootstepsData>();
	}
};
DUMPER7_ASSERTS_UCrMapMenuFootstepsData;

// Class ChimeraUI.CrMapMenuMarkerDefaultColorData
// 0x0080 (0x00B0 - 0x0030)
class UCrMapMenuMarkerDefaultColorData final : public UDataAsset
{
public:
	struct FLinearColor                           MarkerPlayer;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MarkerCoop;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MarkerQuest;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultMarkerBuilding;                             // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MarkerEnemy;                                       // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MarkerNeutral;                                     // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NoColor;                                           // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultMarkerBuildingPlayer;                       // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMapMenuMarkerDefaultColorData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMapMenuMarkerDefaultColorData")
	}
	static class UCrMapMenuMarkerDefaultColorData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMapMenuMarkerDefaultColorData>();
	}
};
DUMPER7_ASSERTS_UCrMapMenuMarkerDefaultColorData;

// Class ChimeraUI.CrMapMenuPOIData
// 0x00B0 (0x01C0 - 0x0110)
class UCrMapMenuPOIData final : public UCrMapMenuCategoryData
{
public:
	struct FSlateBrush                            UnknownIcon;                                       // 0x0110(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMapMenuPOIData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMapMenuPOIData")
	}
	static class UCrMapMenuPOIData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMapMenuPOIData>();
	}
};
DUMPER7_ASSERTS_UCrMapMenuPOIData;

// Class ChimeraUI.CrUW_ActivatableWidget
// 0x0098 (0x05D0 - 0x0538)
class UCrUW_ActivatableWidget : public UCommonActivatableWidget
{
public:
	EVerticalAlignment                            VerticalAllign;                                    // 0x0538(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAllign;                                  // 0x0539(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53A[0x6];                                      // 0x053A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OwningActor;                                       // 0x0540(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_548[0x48];                                     // 0x0548(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	ECrWidgetInputMode                            InputConfig;                                       // 0x0590(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMouseCaptureMode                             GameMouseCaptureMode;                              // 0x0591(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAlllowGameMenu;                                   // 0x0592(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_593[0x5];                                      // 0x0593(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    BackInputActionData;                               // 0x0598(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    CloseMenuInputActionData;                          // 0x05A8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UInputAction*                           CloseMenuInputAction;                              // 0x05B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	struct FUIActionBindingHandle                 CloseActionHandle;                                 // 0x05C0(0x0004)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FUIActionBindingHandle                 CloseMenuActionHandle;                             // 0x05C4(0x0004)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FUIActionBindingHandle                 CloseMenuInputActionHandle;                        // 0x05C8(0x0004)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5CC[0x1];                                      // 0x05CC(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAnimationEnabled;                                 // 0x05CD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5CE[0x2];                                      // 0x05CE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindCloseActions();
	void OnWidgetInitialized(class AActor* InActor, class APlayerController* InPc);
	void TurnOffCloseAction();
	void TurnOnCloseAction();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrUW_ActivatableWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrUW_ActivatableWidget")
	}
	static class UCrUW_ActivatableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrUW_ActivatableWidget>();
	}
};
DUMPER7_ASSERTS_UCrUW_ActivatableWidget;

// Class ChimeraUI.CrUW_ShowPlaytestEndVideoWidget
// 0x0080 (0x0650 - 0x05D0)
class UCrUW_ShowPlaytestEndVideoWidget final : public UCrUW_ActivatableWidget
{
public:
	TSoftObjectPtr<class USoundWave>              AudioAsset;                                        // 0x05D0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMediaSource>            VideoAsset;                                        // 0x05F8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMediaPlayer>            MediaPlayerAsset;                                  // 0x0620(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaPlayer*                           MediaPlayerInstance;                               // 0x0648(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	void OnEndReached();
	void OnMediaOpened(const class FString& OpenedUrl);
	void ReturnToMainMenu();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrUW_ShowPlaytestEndVideoWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrUW_ShowPlaytestEndVideoWidget")
	}
	static class UCrUW_ShowPlaytestEndVideoWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrUW_ShowPlaytestEndVideoWidget>();
	}
};
DUMPER7_ASSERTS_UCrUW_ShowPlaytestEndVideoWidget;

// Class ChimeraUI.CrMapMenuTerrainData
// 0x0080 (0x00B0 - 0x0030)
class UCrMapMenuTerrainData final : public UDataAsset
{
public:
	struct FVector3f                              MapTerrainTopLeftPivotPoint;                       // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              MapTerrainSegmentSize;                             // 0x003C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MapVisibilityCheckVeryFarFromEdgeDistance;         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MapVisibilityCheckFarFromEdgeDistance;             // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MapVisibilityCheckNearToEdgeDistance;              // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MapFarToEdgeMipMapChange;                          // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MapNearToEdgeMipMapChange;                         // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCrTerrainMipMapByZoomValueData> TerrainMipMapByZoomValueData;                     // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCrTerrainSegmentData>          TerrainSegmentsData;                               // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      FogOfWarRenderTextureMaterial;                     // 0x0080(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawDebugInfo;                                     // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrMapMenuTerrainData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrMapMenuTerrainData")
	}
	static class UCrMapMenuTerrainData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrMapMenuTerrainData>();
	}
};
DUMPER7_ASSERTS_UCrMapMenuTerrainData;

// Class ChimeraUI.CrPlayerStatusIconsPriorityData
// 0x00C0 (0x00F0 - 0x0030)
class UCrPlayerStatusIconsPriorityData final : public UDataAsset
{
public:
	TArray<struct FCrStatusIconData>              StatusIcons;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSlateBrush                            IncapacitatedIcon;                                 // 0x0040(0x00B0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrPlayerStatusIconsPriorityData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrPlayerStatusIconsPriorityData")
	}
	static class UCrPlayerStatusIconsPriorityData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrPlayerStatusIconsPriorityData>();
	}
};
DUMPER7_ASSERTS_UCrPlayerStatusIconsPriorityData;

// Class ChimeraUI.CrUIAudioData
// 0x0050 (0x0080 - 0x0030)
class UCrUIAudioData final : public UDataAsset
{
public:
	TMap<EUIAudioSoundType, class USoundBase*>    Sounds;                                            // 0x0030(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	class USoundBase* GetSound(EUIAudioSoundType Type);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrUIAudioData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrUIAudioData")
	}
	static class UCrUIAudioData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrUIAudioData>();
	}
};
DUMPER7_ASSERTS_UCrUIAudioData;

// Class ChimeraUI.CrUIManagerSubsystem
// 0x05C0 (0x0620 - 0x0060)
class UCrUIManagerSubsystem final : public UGameUIManagerSubsystem
{
public:
	uint8                                         Pad_60[0x18];                                      // 0x0060(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCrUW_InventoryScreen>      InventoryScreenClassPtr;                           // 0x0078(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   MapMenuScreenClass;                                // 0x0080(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCrUW_MapMenu>              MapMenuScreenClassPtr;                             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   ObjectivesHUDClass;                                // 0x00B0(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCrUW_ObjectivesHUD>        ObjectivesHUDClassPtr;                             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   EncyclopediaScreenClass;                           // 0x00E0(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCrUW_EncyclopediaMenu>     EncyclopediaScreenClassPtr;                        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DeathScreenClass;                                  // 0x0110(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCrUW_DeathScreen>          DeathScreenClassPtr;                               // 0x0138(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   WeaponWheelClass;                                  // 0x0140(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UCrWeaponWheel>             WeaponWheelClassPtr;                               // 0x0168(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSoftObjectPath                        MainMenuMapPath;                                   // 0x0170(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UBuildingWidgetSettingsData*>    BuildingSettings;                                  // 0x0190(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<TSubclassOf<class UCrUW_ActivatableWidget>> InventoryTabClasses;                          // 0x01A0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FButtonStyle                           TemplateStyle;                                     // 0x01B0(0x0390)(NativeAccessSpecifierPrivate)
