#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContextualDialog

#include "Basic.hpp"

#include "ContextualDialog_structs.hpp"


namespace SDK::Params
{

// Function ContextualDialog.ContextualDialogInterface.CanExecuteAnyContextualResponse
// 0x0002 (0x0002 - 0x0000)
struct ContextualDialogInterface_CanExecuteAnyContextualResponse final
{
public:
	bool                                          bIsImportant;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogInterface_CanExecuteAnyContextualResponse;

// Function ContextualDialog.ContextualDialogInterface.ExecuteContextualResponse
// 0x0128 (0x0128 - 0x0000)
struct ContextualDialogInterface_ExecuteContextualResponse final
{
public:
	struct FContextualResponsePayload             ResponseData;                                      // 0x0000(0x0118)(Parm, NativeAccessSpecifierPublic)
	class FName                                   RuleNameContainingResponseData;                    // 0x0118(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0120(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogInterface_ExecuteContextualResponse;

// Function ContextualDialog.ContextualDialogInterface.IsCharacterTalking
// 0x0001 (0x0001 - 0x0000)
struct ContextualDialogInterface_IsCharacterTalking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogInterface_IsCharacterTalking;

// Function ContextualDialog.ContextualDialogInterface.OnResponseFinished
// 0x0128 (0x0128 - 0x0000)
struct ContextualDialogInterface_OnResponseFinished final
{
public:
	struct FContextualResponsePayload             ResponseData;                                      // 0x0000(0x0118)(Parm, NativeAccessSpecifierPublic)
	class FName                                   RuleNameContainingResponseData;                    // 0x0118(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0120(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogInterface_OnResponseFinished;

// Function ContextualDialog.ContextualDialogLibrary.AddPropertyValue
// 0x0020 (0x0020 - 0x0000)
struct ContextualDialogLibrary_AddPropertyValue final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NumberPropertyValue;                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NamePropertyValue;                                 // 0x0014(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoolPropertyValue;                                 // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PropertyType;                                      // 0x001D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001E(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogLibrary_AddPropertyValue;

// Function ContextualDialog.ContextualDialogLibrary.ExecuteContextualEvent
// 0x0038 (0x0038 - 0x0000)
struct ContextualDialogLibrary_ExecuteContextualEvent final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContextName;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContextValue;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IncreaseCounter;                                   // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipDialoguesRulesCheck;                          // 0x0034(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0035(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogLibrary_ExecuteContextualEvent;

// Function ContextualDialog.ContextualDialogLibrary.GetAllContextsNames
// 0x0058 (0x0058 - 0x0000)
struct ContextualDialogLibrary_GetAllContextsNames final
{
public:
	class UDataTable*                             ObjectsDefinitions;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetAllContextsNames;

// Function ContextualDialog.ContextualDialogLibrary.GetAllDefinedObjectsGroups
// 0x0058 (0x0058 - 0x0000)
struct ContextualDialogLibrary_GetAllDefinedObjectsGroups final
{
public:
	class UDataTable*                             ObjectsDefinitions;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetAllDefinedObjectsGroups;

// Function ContextualDialog.ContextualDialogLibrary.GetAllDefinedObjectsNames
// 0x0058 (0x0058 - 0x0000)
struct ContextualDialogLibrary_GetAllDefinedObjectsNames final
{
public:
	class UDataTable*                             ObjectsDefinitions;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetAllDefinedObjectsNames;

// Function ContextualDialog.ContextualDialogLibrary.GetAllDynamicPropertiesNames
// 0x0018 (0x0018 - 0x0000)
struct ContextualDialogLibrary_GetAllDynamicPropertiesNames final
{
public:
	class UDataTable*                             RulesDataTable;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetAllDynamicPropertiesNames;

// Function ContextualDialog.ContextualDialogLibrary.GetAllObjectsNamesInAGroup
// 0x0060 (0x0060 - 0x0000)
struct ContextualDialogLibrary_GetAllObjectsNamesInAGroup final
{
public:
	class UDataTable*                             ObjectsDefinitions;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GroupName;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0010(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetAllObjectsNamesInAGroup;

// Function ContextualDialog.ContextualDialogLibrary.GetAllPropertiesNames
// 0x0018 (0x0018 - 0x0000)
struct ContextualDialogLibrary_GetAllPropertiesNames final
{
public:
	class UDataTable*                             PropertiesDefinition;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetAllPropertiesNames;

// Function ContextualDialog.ContextualDialogLibrary.GetAllPropertiesNamesSet
// 0x0058 (0x0058 - 0x0000)
struct ContextualDialogLibrary_GetAllPropertiesNamesSet final
{
public:
	class UDataTable*                             PropertiesDefinition;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetAllPropertiesNamesSet;

// Function ContextualDialog.ContextualDialogLibrary.GetAllPropertiesWithDescriptionsMap
// 0x0058 (0x0058 - 0x0000)
struct ContextualDialogLibrary_GetAllPropertiesWithDescriptionsMap final
{
public:
	class UDataTable*                             PropertiesDefinition;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class FText>                ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetAllPropertiesWithDescriptionsMap;

// Function ContextualDialog.ContextualDialogLibrary.GetAllResponsesNames
// 0x0018 (0x0018 - 0x0000)
struct ContextualDialogLibrary_GetAllResponsesNames final
{
public:
	class UDataTable*                             RulesDataTable;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetAllResponsesNames;

// Function ContextualDialog.ContextualDialogLibrary.GetAllRulesNames
// 0x0018 (0x0018 - 0x0000)
struct ContextualDialogLibrary_GetAllRulesNames final
{
public:
	class UDataTable*                             RulesDataTable;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetAllRulesNames;

// Function ContextualDialog.ContextualDialogLibrary.GetConditionFromString
// 0x0048 (0x0048 - 0x0000)
struct ContextualDialogLibrary_GetConditionFromString final
{
public:
	class FString                                 ConditionPhrase;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCondition                             ReturnValue;                                       // 0x0010(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetConditionFromString;

// Function ContextualDialog.ContextualDialogLibrary.GetConditionsFromJson
// 0x0030 (0x0030 - 0x0000)
struct ContextualDialogLibrary_GetConditionsFromJson final
{
public:
	class FString                                 Expression;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         OriginalPhrases;                                   // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCondition>                     ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetConditionsFromJson;

// Function ContextualDialog.ContextualDialogLibrary.GetContextualPropertiesHolderComponent
// 0x0010 (0x0010 - 0x0000)
struct ContextualDialogLibrary_GetContextualPropertiesHolderComponent final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPropertiesHolderComponent*             ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetContextualPropertiesHolderComponent;

// Function ContextualDialog.ContextualDialogLibrary.GetContextualQueryObject
// 0x0010 (0x0010 - 0x0000)
struct ContextualDialogLibrary_GetContextualQueryObject final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UContextualQueryObject*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetContextualQueryObject;

// Function ContextualDialog.ContextualDialogLibrary.GetPropertyDefinitionForPropertyName
// 0x0050 (0x0050 - 0x0000)
struct ContextualDialogLibrary_GetPropertyDefinitionForPropertyName final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             PropertiesDefinition;                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPropertyDefinition                    ReturnValue;                                       // 0x0010(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetPropertyDefinitionForPropertyName;

// Function ContextualDialog.ContextualDialogLibrary.GetPropertyDescription
// 0x0020 (0x0020 - 0x0000)
struct ContextualDialogLibrary_GetPropertyDescription final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             PropertiesDefinition;                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetPropertyDescription;

// Function ContextualDialog.ContextualDialogLibrary.GetPropertyModificationFromString
// 0x0060 (0x0060 - 0x0000)
struct ContextualDialogLibrary_GetPropertyModificationFromString final
{
public:
	class FString                                 PropertyName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Expression;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPropertyModification                  ReturnValue;                                       // 0x0020(0x0040)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_GetPropertyModificationFromString;

// Function ContextualDialog.ContextualDialogLibrary.IsPropertyNameBoolType
// 0x0030 (0x0030 - 0x0000)
struct ContextualDialogLibrary_IsPropertyNameBoolType final
{
public:
	class FString                                 PropertyName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInvertedBool;                                    // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NotInvertedBoolName;                               // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogLibrary_IsPropertyNameBoolType;

// Function ContextualDialog.ContextualDialogLibrary.LogAllProperties
// 0x0008 (0x0008 - 0x0000)
struct ContextualDialogLibrary_LogAllProperties final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogLibrary_LogAllProperties;

// Function ContextualDialog.ContextualDialogLibrary.RemoveProperty
// 0x0020 (0x0020 - 0x0000)
struct ContextualDialogLibrary_RemoveProperty final
{
public:
	class UObject*                                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutValueBeforeRemoving;                            // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogLibrary_RemoveProperty;

// Function ContextualDialog.ContextualDialogLibrary.SetNumberPropertyValueForActors
// 0x0020 (0x0020 - 0x0000)
struct ContextualDialogLibrary_SetNumberPropertyValueForActors final
{
public:
	TArray<class AActor*>                         Targets;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewPropertyValue;                                  // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogLibrary_SetNumberPropertyValueForActors;

// Function ContextualDialog.ContextualDialogSubsystem.AddObjectLookingDurationDelta
// 0x000C (0x000C - 0x0000)
struct ContextualDialogSubsystem_AddObjectLookingDurationDelta final
{
public:
	class FName                                   ObjectName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_AddObjectLookingDurationDelta;

// Function ContextualDialog.ContextualDialogSubsystem.AsyncLoadDialogueWave
// 0x0048 (0x0048 - 0x0000)
struct ContextualDialogSubsystem_AsyncLoadDialogueWave final
{
public:
	class AActor*                                 ActorRequestingLoad;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDialogueWave>           SoftDialogueWave;                                  // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UDialogueWave* DialogueWaveLoaded)> OnLoadDelegate;                         // 0x0030(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_AsyncLoadDialogueWave;

// Function ContextualDialog.ContextualDialogSubsystem.ClearCooldownsData
// 0x0001 (0x0001 - 0x0000)
struct ContextualDialogSubsystem_ClearCooldownsData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_ClearCooldownsData;

// Function ContextualDialog.ContextualDialogSubsystem.ConstructContextualRuleObject
// 0x0058 (0x0058 - 0x0000)
struct ContextualDialogSubsystem_ConstructContextualRuleObject final
{
public:
	class FName                                   InRuleName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuleData                              RuleData;                                          // 0x0008(0x0048)(Parm, NativeAccessSpecifierPublic)
	class UContextualRuleObject*                  ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_ConstructContextualRuleObject;

// Function ContextualDialog.ContextualDialogSubsystem.ExecuteQueuedResponse
// 0x0010 (0x0010 - 0x0000)
struct ContextualDialogSubsystem_ExecuteQueuedResponse final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_ExecuteQueuedResponse;

// Function ContextualDialog.ContextualDialogSubsystem.ExecuteRuleResponseForTargetActor
// 0x0018 (0x0018 - 0x0000)
struct ContextualDialogSubsystem_ExecuteRuleResponseForTargetActor final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UContextualRuleObject*                  RuleObject;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_ExecuteRuleResponseForTargetActor;

// Function ContextualDialog.ContextualDialogSubsystem.FindMatchingRuleForQuery
// 0x0018 (0x0018 - 0x0000)
struct ContextualDialogSubsystem_FindMatchingRuleForQuery final
{
public:
	class UContextualQueryObject*                 QueryObject;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RuleFound;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UContextualRuleObject*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_FindMatchingRuleForQuery;

// Function ContextualDialog.ContextualDialogSubsystem.GetActorsWithContextualDialogInterface
// 0x0010 (0x0010 - 0x0000)
struct ContextualDialogSubsystem_GetActorsWithContextualDialogInterface final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_GetActorsWithContextualDialogInterface;

// Function ContextualDialog.ContextualDialogSubsystem.GetContextualQueryObjectForActor
// 0x0010 (0x0010 - 0x0000)
struct ContextualDialogSubsystem_GetContextualQueryObjectForActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UContextualQueryObject*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_GetContextualQueryObjectForActor;

// Function ContextualDialog.ContextualDialogSubsystem.GetObjectLookingDuration
// 0x000C (0x000C - 0x0000)
struct ContextualDialogSubsystem_GetObjectLookingDuration final
{
public:
	class FName                                   ObjectName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_GetObjectLookingDuration;

// Function ContextualDialog.ContextualDialogSubsystem.GetPawnsWithContextualDialogInterface
// 0x0010 (0x0010 - 0x0000)
struct ContextualDialogSubsystem_GetPawnsWithContextualDialogInterface final
{
public:
	TArray<class APawn*>                          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_GetPawnsWithContextualDialogInterface;

// Function ContextualDialog.ContextualDialogSubsystem.IsResponseQueued
// 0x0018 (0x0018 - 0x0000)
struct ContextualDialogSubsystem_IsResponseQueued final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ResponseName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_IsResponseQueued;

// Function ContextualDialog.ContextualDialogSubsystem.IsRuleAvailable
// 0x0018 (0x0018 - 0x0000)
struct ContextualDialogSubsystem_IsRuleAvailable final
{
public:
	class UContextualRuleObject*                  RuleObject;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_IsRuleAvailable;

// Function ContextualDialog.ContextualDialogSubsystem.LoadRulesFromDataTable
// 0x0010 (0x0010 - 0x0000)
struct ContextualDialogSubsystem_LoadRulesFromDataTable final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_LoadRulesFromDataTable;

// Function ContextualDialog.ContextualDialogSubsystem.LoadRulesFromDataTables
// 0x0018 (0x0018 - 0x0000)
struct ContextualDialogSubsystem_LoadRulesFromDataTables final
{
public:
	TArray<class UDataTable*>                     DataTables;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_LoadRulesFromDataTables;

// Function ContextualDialog.ContextualDialogSubsystem.GetGlobalDynamicPropertyValueByName
// 0x000C (0x000C - 0x0000)
struct ContextualDialogSubsystem_GetGlobalDynamicPropertyValueByName final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_GetGlobalDynamicPropertyValueByName;

// Function ContextualDialog.ContextualDialogSubsystem.GetLocalDynamicPropertyValueByName
// 0x0018 (0x0018 - 0x0000)
struct ContextualDialogSubsystem_GetLocalDynamicPropertyValueByName final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualDialogSubsystem_GetLocalDynamicPropertyValueByName;

// Function ContextualDialog.ContextualQueryObject.GetOwningActor
// 0x0008 (0x0008 - 0x0000)
struct ContextualQueryObject_GetOwningActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualQueryObject_GetOwningActor;

// Function ContextualDialog.ContextualQueryObject.ContainsProperty
// 0x000C (0x000C - 0x0000)
struct ContextualQueryObject_ContainsProperty final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualQueryObject_ContainsProperty;

// Function ContextualDialog.ContextualResponse.ExecuteResponse
// 0x0001 (0x0001 - 0x0000)
struct ContextualResponse_ExecuteResponse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualResponse_ExecuteResponse;

// Function ContextualDialog.ContextualResponse.OnResponseFinished
// 0x0001 (0x0001 - 0x0000)
struct ContextualResponse_OnResponseFinished final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualResponse_OnResponseFinished;

// Function ContextualDialog.ContextualResponse.OnResponseStarted
// 0x0001 (0x0001 - 0x0000)
struct ContextualResponse_OnResponseStarted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualResponse_OnResponseStarted;

// Function ContextualDialog.ContextualRuleObject.DoesQueryPassThisRule
// 0x0010 (0x0010 - 0x0000)
struct ContextualRuleObject_DoesQueryPassThisRule final
{
public:
	class UContextualQueryObject*                 Query;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualRuleObject_DoesQueryPassThisRule;

// Function ContextualDialog.ContextualRuleObject.GetAllResponsesNames
// 0x0010 (0x0010 - 0x0000)
struct ContextualRuleObject_GetAllResponsesNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualRuleObject_GetAllResponsesNames;

// Function ContextualDialog.ContextualRuleObject.GetCurrentResponseDataAndIndex
// 0x0130 (0x0130 - 0x0000)
struct ContextualRuleObject_GetCurrentResponseDataAndIndex final
{
public:
	struct FContextualResponsePayload             CurrentResponsePlayload;                           // 0x0000(0x0118)(Parm, OutParm, NativeAccessSpecifierPublic)
	TArray<class FName>                           CurrentlyFrozenResponses;                          // 0x0118(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0128(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ContextualRuleObject_GetCurrentResponseDataAndIndex;

// Function ContextualDialog.ContextualRuleObject.GetRulePriority
// 0x0004 (0x0004 - 0x0000)
struct ContextualRuleObject_GetRulePriority final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualRuleObject_GetRulePriority;

// Function ContextualDialog.ContextualRuleObject.GetRuleName
// 0x0008 (0x0008 - 0x0000)
struct ContextualRuleObject_GetRuleName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ContextualRuleObject_GetRuleName;

// Function ContextualDialog.ProjectSpecificFunctionLibrary.GetProjectSpecificGroupNames
// 0x0050 (0x0050 - 0x0000)
struct ProjectSpecificFunctionLibrary_GetProjectSpecificGroupNames final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ProjectSpecificFunctionLibrary_GetProjectSpecificGroupNames;

// Function ContextualDialog.ProjectSpecificFunctionLibrary.GetProjectSpecificObjectNames
// 0x0050 (0x0050 - 0x0000)
struct ProjectSpecificFunctionLibrary_GetProjectSpecificObjectNames final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ProjectSpecificFunctionLibrary_GetProjectSpecificObjectNames;

// Function ContextualDialog.ProjectSpecificFunctionLibrary.GetProjectSpecificObjectNamesForAGroup
// 0x0058 (0x0058 - 0x0000)
struct ProjectSpecificFunctionLibrary_GetProjectSpecificObjectNamesForAGroup final
{
public:
	class FName                                   GroupName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ProjectSpecificFunctionLibrary_GetProjectSpecificObjectNamesForAGroup;

// Function ContextualDialog.ProjectSpecificFunctionLibrary.GetProjectSpecificPropertiesNames
// 0x0050 (0x0050 - 0x0000)
struct ProjectSpecificFunctionLibrary_GetProjectSpecificPropertiesNames final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ProjectSpecificFunctionLibrary_GetProjectSpecificPropertiesNames;

// Function ContextualDialog.PropertiesHolderComponent.AddNameProperty
// 0x0014 (0x0014 - 0x0000)
struct PropertiesHolderComponent_AddNameProperty final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyValue;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PropertiesHolderComponent_AddNameProperty;

// Function ContextualDialog.PropertiesHolderComponent.AddNumberProperty
// 0x0010 (0x0010 - 0x0000)
struct PropertiesHolderComponent_AddNumberProperty final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropertyValue;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PropertiesHolderComponent_AddNumberProperty;

// Function ContextualDialog.PropertiesHolderComponent.ContainsProperty
// 0x000C (0x000C - 0x0000)
struct PropertiesHolderComponent_ContainsProperty final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PropertiesHolderComponent_ContainsProperty;

// Function ContextualDialog.PropertiesHolderComponent.GetAllPropertiesWithValuesAsStrings
// 0x0050 (0x0050 - 0x0000)
struct PropertiesHolderComponent_GetAllPropertiesWithValuesAsStrings final
{
public:
	TMap<class FString, class FString>            ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertiesHolderComponent_GetAllPropertiesWithValuesAsStrings;

// Function ContextualDialog.PropertiesHolderComponent.GetContextualEventExecutionAmount
// 0x000C (0x000C - 0x0000)
struct PropertiesHolderComponent_GetContextualEventExecutionAmount final
{
public:
	class FName                                   ContextName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertiesHolderComponent_GetContextualEventExecutionAmount;

// Function ContextualDialog.PropertiesHolderComponent.GetContextualEventExecutionAmountForValue
// 0x0014 (0x0014 - 0x0000)
struct PropertiesHolderComponent_GetContextualEventExecutionAmountForValue final
{
public:
	class FName                                   ContextName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ContextValue;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertiesHolderComponent_GetContextualEventExecutionAmountForValue;

// Function ContextualDialog.PropertiesHolderComponent.GetNamePropertyValue
// 0x0014 (0x0014 - 0x0000)
struct PropertiesHolderComponent_GetNamePropertyValue final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyValue;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PropertiesHolderComponent_GetNamePropertyValue;

// Function ContextualDialog.PropertiesHolderComponent.GetNumberPropertyValue
// 0x0010 (0x0010 - 0x0000)
struct PropertiesHolderComponent_GetNumberPropertyValue final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropertyValue;                                     // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PropertiesHolderComponent_GetNumberPropertyValue;

// Function ContextualDialog.PropertiesHolderComponent.GetUniqueOwnerName
// 0x0008 (0x0008 - 0x0000)
struct PropertiesHolderComponent_GetUniqueOwnerName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertiesHolderComponent_GetUniqueOwnerName;

// Function ContextualDialog.PropertiesHolderComponent.RemoveProperty
// 0x000C (0x000C - 0x0000)
struct PropertiesHolderComponent_RemoveProperty final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PropertiesHolderComponent_RemoveProperty;

// Function ContextualDialog.PropertiesHolderComponent.Server_ExecuteContextualEvent
// 0x0038 (0x0038 - 0x0000)
struct PropertiesHolderComponent_Server_ExecuteContextualEvent final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContextName;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContextValue;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IncreaseCounter;                                   // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PropertiesHolderComponent_Server_ExecuteContextualEvent;

// Function ContextualDialog.PropertiesHolderComponent.SetExecutedContextualEventsArray
// 0x0010 (0x0010 - 0x0000)
struct PropertiesHolderComponent_SetExecutedContextualEventsArray final
{
public:
	TArray<struct FContextualEventCounter>        NewEventsArray;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertiesHolderComponent_SetExecutedContextualEventsArray;

// Function ContextualDialog.PropertiesHolderComponent.GetAllExecutedContextualEventsArray
// 0x0010 (0x0010 - 0x0000)
struct PropertiesHolderComponent_GetAllExecutedContextualEventsArray final
{
public:
	TArray<struct FContextualEventCounter>        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertiesHolderComponent_GetAllExecutedContextualEventsArray;

}

