#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CrAiAnimalPanzerHundRuntime

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "Chimera_structs.hpp"


namespace SDK
{

// Class CrAiAnimalPanzerHundRuntime.BTService_CrAiAnimalPanzerHundUpdateState
// 0x0030 (0x00A0 - 0x0070)
class UBTService_CrAiAnimalPanzerHundUpdateState final : public UBTService
{
public:
	float                                         UpdateInterval;                                    // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 SelfActorKey;                                      // 0x0078(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTService_CrAiAnimalPanzerHundUpdateState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTService_CrAiAnimalPanzerHundUpdateState")
	}
	static class UBTService_CrAiAnimalPanzerHundUpdateState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_CrAiAnimalPanzerHundUpdateState>();
	}
};
DUMPER7_ASSERTS_UBTService_CrAiAnimalPanzerHundUpdateState;

// Class CrAiAnimalPanzerHundRuntime.CrAiAnimalPanzerHundInterface
// 0x0000 (0x0000 - 0x0000)
class ICrAiAnimalPanzerHundInterface final
{
public:
	class UCrAiAnimalPanzerHundUpdateStateComponent* GetPanzerHundUpdateStateComponent();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiAnimalPanzerHundInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiAnimalPanzerHundInterface")
	}
	static class ICrAiAnimalPanzerHundInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICrAiAnimalPanzerHundInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICrAiAnimalPanzerHundInterface;

// Class CrAiAnimalPanzerHundRuntime.CrAiAnimalPanzerHundUpdateStateComponent
// 0x00D8 (0x0190 - 0x00B8)
class UCrAiAnimalPanzerHundUpdateStateComponent final : public UActorComponent
{
public:
	float                                         ConsiderableRadius;                                // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AwarenessRadius;                                   // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DangerRadius;                                      // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsAnyDamageRegistered_BBKeyName;                   // 0x00C4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsAnyoneInDangerZoneDetected_BBKeyName;            // 0x00CC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsShotInAwarenessZoneDetected_BBKeyName;           // 0x00D4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsShotToDangerZoneDetected_BBKeyName;              // 0x00DC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsPlayerInAwarenessZoneDetected_BBKeyName;         // 0x00E4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsWaveStarted_BBKeyName;                           // 0x00EC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   IsWaveFinished_BBKeyName;                          // 0x00F4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   TargetActor_BBKeyName;                             // 0x00FC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMassEnemyCharacterBase*                Panzerhund;                                        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UBlackboardComponent*                   PanzerhundBlackboardComponent;                     // 0x0110(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class ACrCharacterPlayerBase*>         PlayersInConsiderableZone;                         // 0x0118(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class ACrCharacterPlayerBase*>         PlayersInAwarenessZone;                            // 0x0128(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_138[0x58];                                     // 0x0138(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnShotInAwarenessZone(const struct FAuEquippedWeapon& EquippedWeapon);
	void OnShotToDangerZone(const struct FAuEquippedWeapon& EquippedWeapon, const struct FAuTargetData& Hits, const struct FAuCustomTargetHandle& TargetingHandle, const struct FAuCustomTraceDataHandle& CustomData);
	void OnWaveStateChanged(EEnviroWave Wave, EEnviroWaveStage Stage, const struct FCrEnviroWaveSettings& Settings, float Progress);
	void ResetDamageTimestamp();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrAiAnimalPanzerHundUpdateStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrAiAnimalPanzerHundUpdateStateComponent")
	}
	static class UCrAiAnimalPanzerHundUpdateStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCrAiAnimalPanzerHundUpdateStateComponent>();
	}
};
DUMPER7_ASSERTS_UCrAiAnimalPanzerHundUpdateStateComponent;

}

