#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DedicatedServerStart

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function DedicatedServerStart.DedicatedServerStart_C.ExecuteUbergraph_DedicatedServerStart
// 0x0238 (0x0238 - 0x0000)
struct DedicatedServerStart_C_ExecuteUbergraph_DedicatedServerStart final
{
public:
	int32        EntryPoint;       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8    Pad_4[0x4];              // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey           K2Node_InputDebugKeyEvent_Key_1;  // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FInputActionValue      K2Node_InputDebugKeyEvent_ActionValue_1;     // 0x0020(0x0020)(NoDestructor)
	struct FInputActionValue     Temp_struct_Variable;    // 0x0040(0x0020)(NoDestructor)
	struct FKey        Temp_struct_Variable_1;        // 0x0060(0x0018)(HasGetValueTypeHash)
	struct FKey   K2Node_InputDebugKeyEvent_Key;    // 0x0078(0x0018)(HasGetValueTypeHash)
	struct FInputActionValue      K2Node_InputDebugKeyEvent_ActionValue;             // 0x0090(0x0020)(NoDestructor)
	class APlayerController*    CallFunc_GetPlayerController_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool  CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8        Pad_B9[0x7];// 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*            CallFunc_GetHUD_ReturnValue;     // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACrHUD*   K2Node_DynamicCast_AsCr_HUD;   // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool     K2Node_DynamicCast_bSuccess;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool          CallFunc_IsValid_ReturnValue;      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8      Pad_D2[0x6];      // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrUW_CharacterSelectionMenu*      CallFunc_GetProfessionSelectionWidget_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey         K2Node_InputDebugKeyEvent_Key_2; // 0x00E0(0x0018)(HasGetValueTypeHash)
	struct FInputActionValue       K2Node_InputDebugKeyEvent_ActionValue_2;           // 0x00F8(0x0020)(NoDestructor)
	struct FKey           K2Node_InputDebugKeyEvent_Key_3;  // 0x0118(0x0018)(HasGetValueTypeHash)
	struct FInputActionValueK2Node_InputDebugKeyEvent_ActionValue_3;   // 0x0130(0x0020)(NoDestructor)
	struct FKey        K2Node_InputDebugKeyEvent_Key_4;       // 0x0150(0x0018)(HasGetValueTypeHash)
	struct FInputActionValue           K2Node_InputDebugKeyEvent_ActionValue_4;  // 0x0168(0x0020)(NoDestructor)
	struct FKey                K2Node_InputDebugKeyEvent_Key_5;            // 0x0188(0x0018)(HasGetValueTypeHash)
	struct FInputActionValue          K2Node_InputDebugKeyEvent_ActionValue_5;     // 0x01A0(0x0020)(NoDestructor)
	bool            Temp_bool_Variable;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool    CallFunc_Not_PreBool_ReturnValue;        // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8     Pad_1C2[0x6];       // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey K2Node_InputDebugKeyEvent_Key_6;  // 0x01C8(0x0018)(HasGetValueTypeHash)
	struct FInputActionValue     K2Node_InputDebugKeyEvent_ActionValue_6;           // 0x01E0(0x0020)(NoDestructor)
	struct FKey   K2Node_InputDebugKeyEvent_Key_7;             // 0x0200(0x0018)(HasGetValueTypeHash)
	struct FInputActionValue        K2Node_InputDebugKeyEvent_ActionValue_7;           // 0x0218(0x0020)(NoDestructor)
};

// Function DedicatedServerStart.DedicatedServerStart_C.InpActEvt_End_K2Node_InputDebugKeyEvent_6
// 0x0038 (0x0038 - 0x0000)
struct DedicatedServerStart_C_InpActEvt_End_K2Node_InputDebugKeyEvent_6 final
{
public:
	struct FKey       Key;            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FInputActionValue         ActionValue;     // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function DedicatedServerStart.DedicatedServerStart_C.InpActEvt_F6_K2Node_InputDebugKeyEvent_7
// 0x0038 (0x0038 - 0x0000)
struct DedicatedServerStart_C_InpActEvt_F6_K2Node_InputDebugKeyEvent_7 final
{
public:
	struct FKey        Key;         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FInputActionValue        ActionValue;           // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function DedicatedServerStart.DedicatedServerStart_C.InpActEvt_F7_K2Node_InputDebugKeyEvent_4
// 0x0038 (0x0038 - 0x0000)
struct DedicatedServerStart_C_InpActEvt_F7_K2Node_InputDebugKeyEvent_4 final
{
public:
	struct FKey      Key;     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FInputActionValue                ActionValue;// 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function DedicatedServerStart.DedicatedServerStart_C.InpActEvt_F9_K2Node_InputDebugKeyEvent_5
// 0x0038 (0x0038 - 0x0000)
struct DedicatedServerStart_C_InpActEvt_F9_K2Node_InputDebugKeyEvent_5 final
{
public:
	struct FKey    Key;         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FInputActionValue          ActionValue;           // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function DedicatedServerStart.DedicatedServerStart_C.InpActEvt_Insert_K2Node_InputDebugKeyEvent_3
// 0x0038 (0x0038 - 0x0000)
struct DedicatedServerStart_C_InpActEvt_Insert_K2Node_InputDebugKeyEvent_3 final
{
public:
	struct FKey      Key;   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FInputActionValue        ActionValue;             // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function DedicatedServerStart.DedicatedServerStart_C.InpActEvt_NumPadOne_K2Node_InputDebugKeyEvent_0
// 0x0038 (0x0038 - 0x0000)
struct DedicatedServerStart_C_InpActEvt_NumPadOne_K2Node_InputDebugKeyEvent_0 final
{
public:
	struct FKey               Key;             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FInputActionValue      ActionValue;        // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function DedicatedServerStart.DedicatedServerStart_C.InpActEvt_NumPadZero_K2Node_InputDebugKeyEvent_1
// 0x0038 (0x0038 - 0x0000)
struct DedicatedServerStart_C_InpActEvt_NumPadZero_K2Node_InputDebugKeyEvent_1 final
{
public:
	struct FKey         Key;     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FInputActionValue  ActionValue;  // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

// Function DedicatedServerStart.DedicatedServerStart_C.InpActEvt_NumPadZero_K2Node_InputDebugKeyEvent_2
// 0x0038 (0x0038 - 0x0000)
struct DedicatedServerStart_C_InpActEvt_NumPadZero_K2Node_InputDebugKeyEvent_2 final
{
public:
	struct FKey    Key;           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FInputActionValue             ActionValue;  // 0x0018(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};

}

