#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrantBiomesRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum ErrantBiomesRuntime.EBiomesBrushBlendingMode
// NumValues: 0x0006
enum class EBiomesBrushBlendingMode : uint8
{
	Replace                                  = 0,
	Add                                      = 1,
	Subtract                                 = 2,
	Multiply                                 = 3,
	Max                                      = 4,
	Min                                      = 5,
};

// Enum ErrantBiomesRuntime.EBiomesBrushShape
// NumValues: 0x0004
enum class EBiomesBrushShape : uint8
{
	Circle                                   = 0,
	Stamp                                    = 1,
	Tiling                                   = 2,
	Max                                      = 3,
};

// Enum ErrantBiomesRuntime.EBiomesRuntimeSpawning
// NumValues: 0x0004
enum class EBiomesRuntimeSpawning : uint8
{
	Auto                                     = 0,
	Never                                    = 1,
	Always                                   = 2,
	EBiomesRuntimeSpawning_MAX               = 3,
};

// Enum ErrantBiomesRuntime.EBiomesGroupInstances
// NumValues: 0x0004
enum class EBiomesGroupInstances : uint8
{
	Always                                   = 0,
	WhenMoreThenThreshold                    = 1,
	Never                                    = 2,
	EBiomesGroupInstances_MAX                = 3,
};

// Enum ErrantBiomesRuntime.EBiomesRuntimeScalability
// NumValues: 0x0008
enum class EBiomesRuntimeScalability : uint8
{
	None                                     = 0,
	Foliage                                  = 1,
	Grass                                    = 2,
	Custom0                                  = 3,
	Custom1                                  = 4,
	Custom2                                  = 5,
	Custom3                                  = 6,
	EBiomesRuntimeScalability_MAX            = 7,
};

// Enum ErrantBiomesRuntime.EBiomesMaskType
// NumValues: 0x0007
enum class EBiomesMaskType : uint8
{
	Unknown                                  = 0,
	HandPaintedMask                          = 1,
	BiomeMask                                = 2,
	ErrantLandscapeMask                      = 3,
	ErrantPathsMask                          = 4,
	Custom                                   = 5,
	MAX                                      = 6,
};

// Enum ErrantBiomesRuntime.EBiomesMaskSampleResult
// NumValues: 0x0004
enum class EBiomesMaskSampleResult : uint8
{
	Sampled                                  = 0,
	Awaiting                                 = 1,
	NothingFound                             = 2,
	EBiomesMaskSampleResult_MAX              = 3,
};

// Enum ErrantBiomesRuntime.EBiomesMaskSamplingMethod
// NumValues: 0x0003
enum class EBiomesMaskSamplingMethod : uint8
{
	Bilinear                                 = 0,
	NearestPoint                             = 1,
	EBiomesMaskSamplingMethod_MAX            = 2,
};

// Enum ErrantBiomesRuntime.EBiomesSpeciesCompatibility
// NumValues: 0x0006
enum class EBiomesSpeciesCompatibility : uint8
{
	Version0                                 = 0,
	Version1                                 = 1,
	Version2                                 = 2,
	Version3                                 = 3,
	MAX                                      = 4,
	Latest                                   = 3,
};

// ScriptStruct ErrantBiomesRuntime.BiomesComponentGenerateTransformsInfo
// 0x0110 (0x0110 - 0x0000)
struct FBiomesComponentGenerateTransformsInfo final
{
public:
	int32                                         TransformsSize;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PreciseWithNeighboursSize;                         // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ComponentSize;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NeighboursEdgesSize;                               // 0x000C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWorldPrecision;                                 // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WorldScale;                                        // 0x0018(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             WorldToLandscape;                                  // 0x0030(0x0060)(Edit, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatrix                                WorldToComponent;                                  // 0x0090(0x0080)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBiomesComponentGenerateTransformsInfo;

// ScriptStruct ErrantBiomesRuntime.BiomesInstancesSettings
// 0x00A8 (0x00A8 - 0x0000)
struct FBiomesInstancesSettings final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ActorTemplate;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TSubclassOf<class ABiomesRuntimeSpawnerContainer> RuntimeSpawningActorClass;                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABiomesRuntimeSpawnerContainer*         RuntimeSpawningActorTemplate;                      // 0x0018(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UHierarchicalInstancedStaticMeshComponent* InstanceComponentTemplate;                      // 0x0020(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	EBiomesGroupInstances                         GroupInstances;                                    // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinInstancesInGroup;                               // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InstanceGroupSizeMultiplier;                       // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxInstancesPerRuntimeInstanceComponent;           // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBiomesRuntimeScalability                     RuntimeScalability;                                // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBiomesRuntimeSpawning                        RuntimeSpawning;                                   // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             DEPRECATED_DataLayers;                             // 0x0040(0x0050)(NativeAccessSpecifierPrivate)
	bool                                          bCastsShadow;                                      // 0x0090(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasPhysics;                                       // 0x0091(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableDensityScaling;                             // 0x0092(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InstanceStartCullDistance;                         // 0x0094(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         InstanceEndCullDistance;                           // 0x0098(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MinDrawDistance;                                   // 0x009C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         LDMaxDrawDistance;                                 // 0x00A0(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBiomesInstancesSettings;

// ScriptStruct ErrantBiomesRuntime.BiomesMaskAssetInfo
// 0x0014 (0x0014 - 0x0000)
struct alignas(0x04) FBiomesMaskAssetInfo final
{
public:
	uint8                                         Pad_0[0x14];                                       // 0x0000(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBiomesMaskAssetInfo;

// ScriptStruct ErrantBiomesRuntime.BiomesMaskInfo
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x04) FBiomesMaskInfo final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBiomesMaskInfo;

// ScriptStruct ErrantBiomesRuntime.BiomesRandomScale
// 0x0018 (0x0018 - 0x0000)
struct FBiomesRandomScale final
{
public:
	struct FVector3f                              Min;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Max;                                               // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBiomesRandomScale;

// ScriptStruct ErrantBiomesRuntime.BiomesRandomRotation
// 0x0018 (0x0018 - 0x0000)
struct FBiomesRandomRotation final
{
public:
	struct FVector3f                              Min;                                               // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Max;                                               // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBiomesRandomRotation;

// ScriptStruct ErrantBiomesRuntime.BiomesInstanceComponentPartitions
// 0x0040 (0x0040 - 0x0000)
struct FBiomesInstanceComponentPartitions final
{
public:
	TArray<class UHierarchicalInstancedStaticMeshComponent*> RuntimeInstanceComponents;              // 0x0000(0x0010)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<struct FBox2D>                         PartitionBounds;                                   // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UHierarchicalInstancedStaticMeshComponent>> InstanceComponents;      // 0x0030(0x0010)(ExportObject, ZeroConstructor, Deprecated, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBiomesInstanceComponentPartitions;

// ScriptStruct ErrantBiomesRuntime.BiomesSpeciesGenerateTransformsInfo
// 0x0078 (0x0078 - 0x0000)
struct FBiomesSpeciesGenerateTransformsInfo final
{
public:
	struct FVector                                LocationOffset;                                    // 0x0000(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationWithLandscape;                             // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OrientationWithLandscape;                          // 0x001C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBiomesRandomRotation                  RandomRotation;                                    // 0x0020(0x0018)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FBiomesRandomScale                     RandomScale;                                       // 0x0038(0x0018)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint32                                        RandSeed;                                          // 0x0050(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBiomesSpeciesCompatibility                   Compatibility;                                     // 0x0054(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RandomScaleAmount;                                 // 0x0058(0x0018)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RandomRotationYaw;                                 // 0x0070(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RandomRotationRollAndPitch;                        // 0x0074(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBiomesSpeciesGenerateTransformsInfo;

// ScriptStruct ErrantBiomesRuntime.BiomesInstanceableBpAsset
// 0x0028 (0x0028 - 0x0000)
struct FBiomesInstanceableBpAsset final
{
public:
	int32                                         AssetIndex;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     Transforms;                                        // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class FString                                 RuntimeSpawningActorTemplateHash;                  // 0x0018(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBiomesInstanceableBpAsset;

// ScriptStruct ErrantBiomesRuntime.BiomesInstanceableBpInfo
// 0x0010 (0x0010 - 0x0000)
struct FBiomesInstanceableBpInfo final
{
public:
	TArray<struct FBiomesInstanceableBpAsset>     Assets;                                            // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBiomesInstanceableBpInfo;

}

