#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrantLandscapeRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ErrantLandscapeRuntime.ElRtBrushComponent.SetBrushPriority
// 0x0004 (0x0004 - 0x0000)
struct ElRtBrushComponent_SetBrushPriority final
{
public:
	int32                                         InBrushPriority;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtBrushComponent_SetBrushPriority;

// Function ErrantLandscapeRuntime.ElRtBrushComponent.GetBrushPriority
// 0x0004 (0x0004 - 0x0000)
struct ElRtBrushComponent_GetBrushPriority final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtBrushComponent_GetBrushPriority;

// Function ErrantLandscapeRuntime.ElRtDataTransferComponent.ClientEndTransfer
// 0x0008 (0x0008 - 0x0000)
struct ElRtDataTransferComponent_ClientEndTransfer final
{
public:
	struct FIntPoint                              LandscapeCompIdx;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtDataTransferComponent_ClientEndTransfer;

// Function ErrantLandscapeRuntime.ElRtDataTransferComponent.ClientNotifyOfAllTransfers
// 0x0008 (0x0008 - 0x0000)
struct ElRtDataTransferComponent_ClientNotifyOfAllTransfers final
{
public:
	int32                                         TotalDataSize;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TransferCount;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtDataTransferComponent_ClientNotifyOfAllTransfers;

// Function ErrantLandscapeRuntime.ElRtDataTransferComponent.ClientStartTransfer
// 0x0018 (0x0018 - 0x0000)
struct ElRtDataTransferComponent_ClientStartTransfer final
{
public:
	struct FIntPoint                              LandscapeCompIdx;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeightmapName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtDataTransferComponent_ClientStartTransfer;

// Function ErrantLandscapeRuntime.ElRtDataTransferComponent.ClientTransferDataChunk
// 0x0010 (0x0010 - 0x0000)
struct ElRtDataTransferComponent_ClientTransferDataChunk final
{
public:
	TArray<uint8>                                 Data;                                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtDataTransferComponent_ClientTransferDataChunk;

// Function ErrantLandscapeRuntime.ElRtDataTransferComponent.ServerTransferData
// 0x0028 (0x0028 - 0x0000)
struct ElRtDataTransferComponent_ServerTransferData final
{
public:
	struct FIntPoint                              LandscapeCompIdx;                                  // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeightmapName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Data;                                              // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtDataTransferComponent_ServerTransferData;

// Function ErrantLandscapeRuntime.ElRtDataTransferComponent.GetRemainingBytesToTransfer
// 0x0004 (0x0004 - 0x0000)
struct ElRtDataTransferComponent_GetRemainingBytesToTransfer final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtDataTransferComponent_GetRemainingBytesToTransfer;

// Function ErrantLandscapeRuntime.ElRtDataTransferComponent.GetRemainingTransferCount
// 0x0004 (0x0004 - 0x0000)
struct ElRtDataTransferComponent_GetRemainingTransferCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtDataTransferComponent_GetRemainingTransferCount;

// Function ErrantLandscapeRuntime.ElRtDataTransferComponent.GetTotalBytesToTransfer
// 0x0004 (0x0004 - 0x0000)
struct ElRtDataTransferComponent_GetTotalBytesToTransfer final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtDataTransferComponent_GetTotalBytesToTransfer;

// Function ErrantLandscapeRuntime.ElRtDataTransferComponent.GetTotalTransferCount
// 0x0004 (0x0004 - 0x0000)
struct ElRtDataTransferComponent_GetTotalTransferCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtDataTransferComponent_GetTotalTransferCount;

// Function ErrantLandscapeRuntime.ElRtDataTransferComponent.GetTransferProgress
// 0x0004 (0x0004 - 0x0000)
struct ElRtDataTransferComponent_GetTransferProgress final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtDataTransferComponent_GetTransferProgress;

// Function ErrantLandscapeRuntime.ElRtDataTransferComponent.IsTransferInProgress
// 0x0001 (0x0001 - 0x0000)
struct ElRtDataTransferComponent_IsTransferInProgress final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtDataTransferComponent_IsTransferInProgress;

// Function ErrantLandscapeRuntime.ElRtWorldSubsystem.QueueRender
// 0x0028 (0x0028 - 0x0000)
struct ElRtWorldSubsystem_QueueRender final
{
public:
	struct FBox2D                                 InWorldUpdateBounds;                               // 0x0000(0x0028)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtWorldSubsystem_QueueRender;

// Function ErrantLandscapeRuntime.ElRtWorldSubsystem.SetDefaultLandscape
// 0x0008 (0x0008 - 0x0000)
struct ElRtWorldSubsystem_SetDefaultLandscape final
{
public:
	class ALandscape*                             InLandscape;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtWorldSubsystem_SetDefaultLandscape;

// Function ErrantLandscapeRuntime.ElRtWorldSubsystem.GetDefaultLandscape
// 0x0008 (0x0008 - 0x0000)
struct ElRtWorldSubsystem_GetDefaultLandscape final
{
public:
	class ALandscape*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ElRtWorldSubsystem_GetDefaultLandscape;

}

