#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrantBiomesRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "ErrantBiomesRuntime_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class ErrantBiomesRuntime.BiomesMaskBase
// 0x0060 (0x0088 - 0x0028)
class UBiomesMaskBase : public UObject
{
public:
	class FName                                   MaskName;                                          // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  MaskGuid;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Size;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentX;                                        // 0x0044(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentY;                                        // 0x0048(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0050(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_58[0x30];                                      // 0x0058(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesMaskBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesMaskBase")
	}
	static class UBiomesMaskBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesMaskBase>();
	}
};
DUMPER7_ASSERTS_UBiomesMaskBase;

// Class ErrantBiomesRuntime.BiomesHandPaintedMaskBase
// 0x0000 (0x0088 - 0x0088)
class UBiomesHandPaintedMaskBase : public UBiomesMaskBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesHandPaintedMaskBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesHandPaintedMaskBase")
	}
	static class UBiomesHandPaintedMaskBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesHandPaintedMaskBase>();
	}
};
DUMPER7_ASSERTS_UBiomesHandPaintedMaskBase;

// Class ErrantBiomesRuntime.BiomesBiomeMaskTextureData
// 0x0000 (0x0088 - 0x0088)
class UBiomesBiomeMaskTextureData final : public UBiomesHandPaintedMaskBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesBiomeMaskTextureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesBiomeMaskTextureData")
	}
	static class UBiomesBiomeMaskTextureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesBiomeMaskTextureData>();
	}
};
DUMPER7_ASSERTS_UBiomesBiomeMaskTextureData;

// Class ErrantBiomesRuntime.BiomesCustomMask
// 0x0000 (0x0088 - 0x0088)
class UBiomesCustomMask final : public UBiomesMaskBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesCustomMask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesCustomMask")
	}
	static class UBiomesCustomMask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesCustomMask>();
	}
};
DUMPER7_ASSERTS_UBiomesCustomMask;

// Class ErrantBiomesRuntime.BiomesHierarchicalInstancedStaticMeshComponent
// 0x0000 (0x0B40 - 0x0B40)
#pragma pack(push, 0x1)
class alignas(0x10) UBiomesHierarchicalInstancedStaticMeshComponent : public UHierarchicalInstancedStaticMeshComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesHierarchicalInstancedStaticMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesHierarchicalInstancedStaticMeshComponent")
	}
	static class UBiomesHierarchicalInstancedStaticMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesHierarchicalInstancedStaticMeshComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UBiomesHierarchicalInstancedStaticMeshComponent;

// Class ErrantBiomesRuntime.BiomesInteropMask
// 0x0000 (0x0088 - 0x0088)
class UBiomesInteropMask : public UBiomesMaskBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesInteropMask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesInteropMask")
	}
	static class UBiomesInteropMask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesInteropMask>();
	}
};
DUMPER7_ASSERTS_UBiomesInteropMask;

// Class ErrantBiomesRuntime.BiomesErrantLandscapeInteropMask
// 0x0000 (0x0088 - 0x0088)
class UBiomesErrantLandscapeInteropMask final : public UBiomesInteropMask
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesErrantLandscapeInteropMask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesErrantLandscapeInteropMask")
	}
	static class UBiomesErrantLandscapeInteropMask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesErrantLandscapeInteropMask>();
	}
};
DUMPER7_ASSERTS_UBiomesErrantLandscapeInteropMask;

// Class ErrantBiomesRuntime.BiomesErrantPathsInteropMask
// 0x0000 (0x0088 - 0x0088)
class UBiomesErrantPathsInteropMask final : public UBiomesInteropMask
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesErrantPathsInteropMask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesErrantPathsInteropMask")
	}
	static class UBiomesErrantPathsInteropMask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesErrantPathsInteropMask>();
	}
};
DUMPER7_ASSERTS_UBiomesErrantPathsInteropMask;

// Class ErrantBiomesRuntime.BiomesMaskAsset
// 0x0018 (0x0040 - 0x0028)
class UBiomesMaskAsset : public UObject
{
public:
	bool                                          bIsEditorOnly;                                     // 0x0028(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x002C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesMaskAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesMaskAsset")
	}
	static class UBiomesMaskAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesMaskAsset>();
	}
};
DUMPER7_ASSERTS_UBiomesMaskAsset;

// Class ErrantBiomesRuntime.BiomesMaskAssetWithVisualization
// 0x0000 (0x0040 - 0x0040)
class UBiomesMaskAssetWithVisualization : public UBiomesMaskAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesMaskAssetWithVisualization")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesMaskAssetWithVisualization")
	}
	static class UBiomesMaskAssetWithVisualization* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesMaskAssetWithVisualization>();
	}
};
DUMPER7_ASSERTS_UBiomesMaskAssetWithVisualization;

// Class ErrantBiomesRuntime.BiomesHandPaintedMaskAsset
// 0x0000 (0x0040 - 0x0040)
class UBiomesHandPaintedMaskAsset final : public UBiomesMaskAssetWithVisualization
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesHandPaintedMaskAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesHandPaintedMaskAsset")
	}
	static class UBiomesHandPaintedMaskAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesHandPaintedMaskAsset>();
	}
};
DUMPER7_ASSERTS_UBiomesHandPaintedMaskAsset;

// Class ErrantBiomesRuntime.BiomesBiomeMaskAsset
// 0x0000 (0x0040 - 0x0040)
class UBiomesBiomeMaskAsset final : public UBiomesMaskAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesBiomeMaskAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesBiomeMaskAsset")
	}
	static class UBiomesBiomeMaskAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesBiomeMaskAsset>();
	}
};
DUMPER7_ASSERTS_UBiomesBiomeMaskAsset;

// Class ErrantBiomesRuntime.BiomesErrantLandscapeMaskAsset
// 0x0000 (0x0040 - 0x0040)
class UBiomesErrantLandscapeMaskAsset final : public UBiomesMaskAssetWithVisualization
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesErrantLandscapeMaskAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesErrantLandscapeMaskAsset")
	}
	static class UBiomesErrantLandscapeMaskAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesErrantLandscapeMaskAsset>();
	}
};
DUMPER7_ASSERTS_UBiomesErrantLandscapeMaskAsset;

// Class ErrantBiomesRuntime.BiomesErrantPathsMaskAsset
// 0x0000 (0x0040 - 0x0040)
class UBiomesErrantPathsMaskAsset final : public UBiomesMaskAssetWithVisualization
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesErrantPathsMaskAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesErrantPathsMaskAsset")
	}
	static class UBiomesErrantPathsMaskAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesErrantPathsMaskAsset>();
	}
};
DUMPER7_ASSERTS_UBiomesErrantPathsMaskAsset;

// Class ErrantBiomesRuntime.BiomesCustomMaskAsset
// 0x0000 (0x0040 - 0x0040)
class UBiomesCustomMaskAsset final : public UBiomesMaskAssetWithVisualization
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesCustomMaskAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesCustomMaskAsset")
	}
	static class UBiomesCustomMaskAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesCustomMaskAsset>();
	}
};
DUMPER7_ASSERTS_UBiomesCustomMaskAsset;

// Class ErrantBiomesRuntime.BiomesMaskEngineSubsystem
// 0x0070 (0x00A0 - 0x0030)
class UBiomesMaskEngineSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x70];                                      // 0x0030(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesMaskEngineSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesMaskEngineSubsystem")
	}
	static class UBiomesMaskEngineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesMaskEngineSubsystem>();
	}
};
DUMPER7_ASSERTS_UBiomesMaskEngineSubsystem;

// Class ErrantBiomesRuntime.BiomesMaskTextureData
// 0x0000 (0x0088 - 0x0088)
class UBiomesMaskTextureData final : public UBiomesHandPaintedMaskBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesMaskTextureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesMaskTextureData")
	}
	static class UBiomesMaskTextureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesMaskTextureData>();
	}
};
DUMPER7_ASSERTS_UBiomesMaskTextureData;

// Class ErrantBiomesRuntime.BiomesMaskWorldSubsystem
// 0x0490 (0x04D0 - 0x0040)
class UBiomesMaskWorldSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x60];                                      // 0x0040(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UBiomesMaskEngineSubsystem*             MaskEditorSubsystem;                               // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_A8[0x2E0];                                     // 0x00A8(0x02E0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EBiomesMaskType, class UTextureRenderTarget2D*> FallbackRenderTargets;                      // 0x0388(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_3D8[0xF0];                                     // 0x03D8(0x00F0)(Fixing Size After Last Property [ Dumper-7 ])
	class UBiomesWorldInfo*                       BiomesWorldInfo;                                   // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesMaskWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesMaskWorldSubsystem")
	}
	static class UBiomesMaskWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesMaskWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_UBiomesMaskWorldSubsystem;

// Class ErrantBiomesRuntime.BiomesPartitionActor
// 0x00D8 (0x0380 - 0x02A8)
class ABiomesPartitionActor : public APartitionActor
{
public:
	TSet<struct FIntPoint>                        ComponentXYs;                                      // 0x02A8(0x0050)(NativeAccessSpecifierPublic)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatrix                                WorldToComponentTransform;                         // 0x0300(0x0080)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesPartitionActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesPartitionActor")
	}
	static class ABiomesPartitionActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABiomesPartitionActor>();
	}
};
DUMPER7_ASSERTS_ABiomesPartitionActor;

// Class ErrantBiomesRuntime.BiomesRuntimeData
// 0x0010 (0x02B8 - 0x02A8)
class ABiomesRuntimeData final : public AActor
{
public:
	TArray<class UObject*>                        Objects;                                           // 0x02A8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesRuntimeData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesRuntimeData")
	}
	static class ABiomesRuntimeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABiomesRuntimeData>();
	}
};
DUMPER7_ASSERTS_ABiomesRuntimeData;

// Class ErrantBiomesRuntime.BiomesRuntimeProjectSettings
// 0x0008 (0x0040 - 0x0038)
class UBiomesRuntimeProjectSettings final : public UDeveloperSettings
{
public:
	bool                                          bEditorOnlyBiomeMasks;                             // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesRuntimeProjectSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesRuntimeProjectSettings")
	}
	static class UBiomesRuntimeProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesRuntimeProjectSettings>();
	}
};
DUMPER7_ASSERTS_UBiomesRuntimeProjectSettings;

// Class ErrantBiomesRuntime.BiomesRuntimeSpawnerComponent
// 0x0158 (0x0210 - 0x00B8)
class UBiomesRuntimeSpawnerComponent final : public UActorComponent
{
public:
	double                                        MaxSpawningDistanceSquared;                        // 0x00B8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<double>                                AssetMaxSpawningDistanceSquared;                   // 0x00C0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x40];                                      // 0x00D0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UBiomesSpeciesInfo*                     SpeciesInfo;                                       // 0x0110(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	int32                                         SpawnPointsGridIndex;                              // 0x0118(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ComponentXY;                                       // 0x011C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ULandscapeComponent>     LandscapeComponent;                                // 0x0128(0x0028)(Edit, ExportObject, EditConst, InstancedReference, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBiomesInstanceComponentPartitions> InstanceComponentPartitions;                   // 0x0150(0x0010)(Edit, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FBox2D                                 WorldBounds2D;                                     // 0x0160(0x0028)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 AssetNumPartitions;                                // 0x0188(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FVector                                LocalInstancesLocationOffset;                      // 0x0198(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorTemplateHash;                                 // 0x01B0(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UHierarchicalInstancedStaticMeshComponent>> InstanceComponents;      // 0x01C0(0x0010)(ExportObject, ZeroConstructor, Deprecated, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	float                                         MaxSpawningDistance;                               // 0x01D0(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   WorldBounds;                                       // 0x01D8(0x0038)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesRuntimeSpawnerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesRuntimeSpawnerComponent")
	}
	static class UBiomesRuntimeSpawnerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesRuntimeSpawnerComponent>();
	}
};
DUMPER7_ASSERTS_UBiomesRuntimeSpawnerComponent;

// Class ErrantBiomesRuntime.BiomesRuntimeSpawnerContainer
// 0x0050 (0x03D0 - 0x0380)
class ABiomesRuntimeSpawnerContainer final : public ABiomesPartitionActor
{
public:
	TArray<class UBiomesRuntimeSpawnerComponent*> SpawnerComponents;                                 // 0x0380(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	struct FBox                                   FullySpawnedWorldBounds;                           // 0x0390(0x0038)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesRuntimeSpawnerContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesRuntimeSpawnerContainer")
	}
	static class ABiomesRuntimeSpawnerContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABiomesRuntimeSpawnerContainer>();
	}
};
DUMPER7_ASSERTS_ABiomesRuntimeSpawnerContainer;

// Class ErrantBiomesRuntime.BiomesRuntimeSpawner
// 0x00B8 (0x0360 - 0x02A8)
class ABiomesRuntimeSpawner final : public AActor
{
public:
	TSoftObjectPtr<class UBiomesSpeciesInfo>      SpeciesInfo;                                       // 0x02A8(0x0028)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpawnPointsGridIndex;                              // 0x02D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ComponentXY;                                       // 0x02D4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ULandscapeComponent>     LandscapeComponent;                                // 0x02E0(0x0028)(Edit, ExportObject, EditConst, InstancedReference, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> InstancedStaticMeshComponents;          // 0x0308(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         MaxSpawningDistance;                               // 0x0318(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31C[0x44];                                     // 0x031C(0x0044)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesRuntimeSpawner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesRuntimeSpawner")
	}
	static class ABiomesRuntimeSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABiomesRuntimeSpawner>();
	}
};
DUMPER7_ASSERTS_ABiomesRuntimeSpawner;

// Class ErrantBiomesRuntime.BiomesRuntimeSpawningSubsystem
// 0x06C0 (0x06F0 - 0x0030)
class UBiomesRuntimeSpawningSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x6C0];                                     // 0x0030(0x06C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesRuntimeSpawningSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesRuntimeSpawningSubsystem")
	}
	static class UBiomesRuntimeSpawningSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesRuntimeSpawningSubsystem>();
	}
};
DUMPER7_ASSERTS_UBiomesRuntimeSpawningSubsystem;

// Class ErrantBiomesRuntime.BiomesSpawnPointsGrid
// 0x0020 (0x0050 - 0x0030)
class UBiomesSpawnPointsGrid final : public UDataAsset
{
public:
	float                                         NoCollisionRadius;                                 // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CellSize;                                          // 0x0034(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CellEdgeSize;                                      // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Seed;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesSpawnPointsGrid")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesSpawnPointsGrid")
	}
	static class UBiomesSpawnPointsGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesSpawnPointsGrid>();
	}
};
DUMPER7_ASSERTS_UBiomesSpawnPointsGrid;

// Class ErrantBiomesRuntime.BiomesSpeciesInfo
// 0x01B8 (0x01E8 - 0x0030)
class UBiomesSpeciesInfo final : public UDataAsset
{
public:
	struct FSoftObjectPath                        SourceSpeciesAsset;                                // 0x0030(0x0020)(Edit, ZeroConstructor, EditConst, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        Assets;                                            // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<bool>                                  AssetCanUsePrebuiltTree;                           // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FBox>                           AssetBounds;                                       // 0x0070(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<bool>                                  AssetNeedsInstanceBufferCPUAccess;                 // 0x0080(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<int32>                                 AssetDesiredInstancesPerLeaf;                      // 0x0090(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class UBiomesSpawnPointsGrid*                 SpawnPointsGrid;                                   // 0x00A0(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<struct FBiomesInstancesSettings>       AssetInstancesSettings;                            // 0x00A8(0x0010)(Edit, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FBiomesSpeciesGenerateTransformsInfo   SpeciesGenerationInfo;                             // 0x00B8(0x0078)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FBiomesInstanceableBpInfo>      InstanceableBpInfos;                               // 0x0130(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FBiomesInstancesSettings               InstancesSettings;                                 // 0x0140(0x00A8)(Deprecated, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesSpeciesInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesSpeciesInfo")
	}
	static class UBiomesSpeciesInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesSpeciesInfo>();
	}
};
DUMPER7_ASSERTS_UBiomesSpeciesInfo;

// Class ErrantBiomesRuntime.BiomesWorldInfo
// 0x0110 (0x0140 - 0x0030)
class UBiomesWorldInfo final : public UDataAsset
{
public:
	struct FBiomesComponentGenerateTransformsInfo ComponentGenerateTransformsInfo;                   // 0x0030(0x0110)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BiomesWorldInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BiomesWorldInfo")
	}
	static class UBiomesWorldInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBiomesWorldInfo>();
	}
};
DUMPER7_ASSERTS_UBiomesWorldInfo;

}

