#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_MiningToolPassiveCooling

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_MiningToolPassiveCooling.GA_MiningToolPassiveCooling_C
// 0x0040 (0x0548 - 0x0508)
class UGA_MiningToolPassiveCooling_C final : public UCrGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            ActiveHeatStackEffect;                             // 0x0510(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentStackCount;                                 // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SingleStackDuration;                               // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_Repeat*                    RepeatTaskHandle;                                  // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultStartDelayDuration;                         // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 PassiveStartDelayTask;                             // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         OverheatStartDelayDuration;                        // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOverheat;                                        // 0x0544(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_MiningToolPassiveCooling(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnFinish_2FE61E1646A131976853EC9555B454A4();
	void OnFinished_6A05B7EC444B9F45205F41900B8FE392(int32 ActionNumber);
	void OnPerformAction_6A05B7EC444B9F45205F41900B8FE392(int32 ActionNumber);
	void OnSync_103EAFE346A5B9623DDF109C27FDEB74();
	void OnSync_EE69512141AAD78978DD38B58E109ECC();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_MiningToolPassiveCooling_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_MiningToolPassiveCooling_C")
	}
	static class UGA_MiningToolPassiveCooling_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_MiningToolPassiveCooling_C>();
	}
};
DUMPER7_ASSERTS_UGA_MiningToolPassiveCooling_C;

}

