#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_UseWeapon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_UseWeapon.GA_UseWeapon_C
// 0x0040 (0x0548 - 0x0508)
class UGA_UseWeapon_C : public UCrGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           TppMontage;                                        // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FppMontage;                                        // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   MontageEndSectionName;                             // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MontageTargetDuration;                             // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 WeaponItemData;                                    // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        PlayAnimDelay;                                     // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayedAnimAfterDelay;                             // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_UseWeapon(int32 EntryPoint);
	void Get_Equipped_Weapon(class ACrWeaponActor** WeaponActor);
	void Get_Player_Character(class ABP_PlayerCharacter_C** Player_Character);
	int32 GetAmmoCount();
	void GetAmmoItem(class UAuItemDataBase** AmmoItem);
	class USkeletalMeshComponent* GetFPPMesh();
	void GetMontageRate(class UAnimMontage* Montage, double* Rate);
	void HasAmmo(bool* Result);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendedIn_299903364319C69A33F5CF86925FB566();
	void OnBlendedIn_C92242D6446017A92B10179D2C43ECF9();
	void OnBlendOut_16F116464DCB5469B6CA7D8262F631A4(class FName NotifyName);
	void OnBlendOut_299903364319C69A33F5CF86925FB566();
	void OnBlendOut_C92242D6446017A92B10179D2C43ECF9();
	void OnBlendOut_CA747CB14ECBF6EC734C72B933946D45(class FName NotifyName);
	void OnCancelled_299903364319C69A33F5CF86925FB566();
	void OnCancelled_C92242D6446017A92B10179D2C43ECF9();
	void OnCompleted_16F116464DCB5469B6CA7D8262F631A4(class FName NotifyName);
	void OnCompleted_299903364319C69A33F5CF86925FB566();
	void OnCompleted_C92242D6446017A92B10179D2C43ECF9();
	void OnCompleted_CA747CB14ECBF6EC734C72B933946D45(class FName NotifyName);
	void OnFinish_C0C3ECC9479514A19F613F8A54BA04AF();
	void OnInterrupted_16F116464DCB5469B6CA7D8262F631A4(class FName NotifyName);
	void OnInterrupted_299903364319C69A33F5CF86925FB566();
	void OnInterrupted_C92242D6446017A92B10179D2C43ECF9();
	void OnInterrupted_CA747CB14ECBF6EC734C72B933946D45(class FName NotifyName);
	void OnNotifyBegin_16F116464DCB5469B6CA7D8262F631A4(class FName NotifyName);
	void OnNotifyBegin_CA747CB14ECBF6EC734C72B933946D45(class FName NotifyName);
	void OnNotifyEnd_16F116464DCB5469B6CA7D8262F631A4(class FName NotifyName);
	void OnNotifyEnd_CA747CB14ECBF6EC734C72B933946D45(class FName NotifyName);
	void UseAmmo();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_UseWeapon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_UseWeapon_C")
	}
	static class UGA_UseWeapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_UseWeapon_C>();
	}
};
DUMPER7_ASSERTS_UGA_UseWeapon_C;

}

