#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassAIPrototypeEnemyRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Chimera_structs.hpp"
#include "MassReplication_structs.hpp"
#include "ChimeraMassCommon_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "MassEntity_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "MassAIBehavior_structs.hpp"
#include "MassLOD_structs.hpp"
#include "MassRepresentation_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Enum MassAIPrototypeEnemyRuntime.EMassEnemySpawnerState
// NumValues: 0x000C
enum class EMassEnemySpawnerState : uint8
{
	Unknown                                  = 0,
	Disabled                                 = 1,
	WaitingForPlayer                         = 2,
	WaitingForNavmesh                        = 3,
	WaitingForEnviroWave                     = 4,
	Spawning                                 = 5,
	SpawningWaitingForNextBurst              = 6,
	SpawningFinishedAiActive                 = 7,
	FinishedReusable                         = 8,
	FinishedTerminated                       = 9,
	FinishedSpawnedMassSpawner               = 10,
	EMassEnemySpawnerState_MAX               = 11,
};

// Enum MassAIPrototypeEnemyRuntime.EMassEnemyBaseAttackState
// NumValues: 0x0008
enum class EMassEnemyBaseAttackState : uint8
{
	NoAttack                                 = 0,
	PreparingAttack                          = 1,
	ObeliskVisualizationAttackEffect         = 2,
	MovingTowardsBase                        = 3,
	AttackInProgress                         = 4,
	SpawningFinishedAiActive                 = 5,
	CooldownAfterAttack                      = 6,
	EMassEnemyBaseAttackState_MAX            = 7,
};

// Enum MassAIPrototypeEnemyRuntime.EMovementAttackStage
// NumValues: 0x0006
enum class EMovementAttackStage : uint8
{
	Start                                    = 0,
	Mid                                      = 1,
	End_Standard                             = 2,
	End_WallHit                              = 3,
	End_Instant                              = 4,
	EMovementAttackStage_MAX                 = 5,
};

// Enum MassAIPrototypeEnemyRuntime.EMovementTraceResult
// NumValues: 0x0004
enum class EMovementTraceResult : uint8
{
	Valid                                    = 0,
	CollisionBlocked                         = 1,
	NoNavmesh                                = 2,
	EMovementTraceResult_MAX                 = 3,
};

// Enum MassAIPrototypeEnemyRuntime.ECrNavmeshMovementState
// NumValues: 0x0007
enum class ECrNavmeshMovementState : uint8
{
	NoMovement                               = 0,
	ActorLogicHandlesMovment                 = 1,
	Moving                                   = 2,
	Jump                                     = 3,
	Stuck                                    = 4,
	Recovering                               = 5,
	ECrNavmeshMovementState_MAX              = 6,
};

// Enum MassAIPrototypeEnemyRuntime.ECrMassJumpState
// NumValues: 0x0004
enum class ECrMassJumpState : uint8
{
	TakeOff                                  = 0,
	Fly                                      = 1,
	Land                                     = 2,
	ECrMassJumpState_MAX                     = 3,
};

// Enum MassAIPrototypeEnemyRuntime.ECrAttackSlotType
// NumValues: 0x0007
enum class ECrAttackSlotType : uint8
{
	Melee                                    = 0,
	Ranged                                   = 1,
	Taunt                                    = 2,
	GapAttack                                = 3,
	Building_Melee                           = 4,
	Building_Ranged                          = 5,
	ECrAttackSlotType_MAX                    = 6,
};

// Enum MassAIPrototypeEnemyRuntime.ECrEnemyLocomotionType
// NumValues: 0x000F
enum class ECrEnemyLocomotionType : uint8
{
	Stopped                                  = 0,
	Walk                                     = 1,
	AggroWalk                                = 2,
	Turret                                   = 3,
	Retreat                                  = 4,
	WalkBack                                 = 5,
	Strafe                                   = 6,
	Taunt                                    = 7,
	Default                                  = 8,
	Jump                                     = 9,
	Dead                                     = 10,
	Spawn                                    = 11,
	AttackTaunt                              = 12,
	Invalid                                  = 255,
	ECrEnemyLocomotionType_MAX               = 256,
};

// Enum MassAIPrototypeEnemyRuntime.ECrEnemyJumpState
// NumValues: 0x0005
enum class ECrEnemyJumpState : uint8
{
	NoJump                                   = 0,
	ShouldJump                               = 1,
	Falling                                  = 2,
	ShouldLand                               = 3,
	ECrEnemyJumpState_MAX                    = 4,
};

// Enum MassAIPrototypeEnemyRuntime.ECrEnemyHitDirection
// NumValues: 0x0006
enum class ECrEnemyHitDirection : uint8
{
	None                                     = 0,
	Front                                    = 1,
	Right                                    = 2,
	Back                                     = 3,
	Left                                     = 4,
	ECrEnemyHitDirection_MAX                 = 5,
};

// Enum MassAIPrototypeEnemyRuntime.ECrEnemyDeathDirection
// NumValues: 0x0008
enum class ECrEnemyDeathDirection : uint8
{
	None                                     = 0,
	RightFront                               = 1,
	Right                                    = 2,
	RightBack                                = 3,
	LeftBack                                 = 4,
	Left                                     = 5,
	LeftFront                                = 6,
	ECrEnemyDeathDirection_MAX               = 7,
};

// Enum MassAIPrototypeEnemyRuntime.ECrEnemyAttackType
// NumValues: 0x000B
enum class ECrEnemyAttackType : uint8
{
	NoAttack                                 = 0,
	Melee_1                                  = 1,
	Melee_2                                  = 2,
	Melee_3                                  = 3,
	Special_1                                = 4,
	Special_2                                = 5,
	Special_3                                = 6,
	Ranged_1                                 = 7,
	Ranged_2                                 = 8,
	Ranged_3                                 = 9,
	ECrEnemyAttackType_MAX                   = 10,
};

// Enum MassAIPrototypeEnemyRuntime.ECrEnemySpawnType
// NumValues: 0x0004
enum class ECrEnemySpawnType : uint8
{
	None                                     = 0,
	Spawn_1                                  = 1,
	Spawn_2                                  = 2,
	ECrEnemySpawnType_MAX                    = 3,
};

// Enum MassAIPrototypeEnemyRuntime.ECrEnemyTauntType
// NumValues: 0x0008
enum class ECrEnemyTauntType : uint8
{
	None                                     = 0,
	TauntA                                   = 1,
	TauntB                                   = 2,
	TauntC                                   = 3,
	TauntD                                   = 4,
	TauntE                                   = 5,
	Count                                    = 6,
	ECrEnemyTauntType_MAX                    = 7,
};

// Enum MassAIPrototypeEnemyRuntime.EMassEnemySpawnerActivationState
// NumValues: 0x0004
enum class EMassEnemySpawnerActivationState : uint8
{
	Not_Initialized                          = 0,
	Disabled                                 = 1,
	Enabled                                  = 2,
	EMassEnemySpawnerActivationState_MAX     = 3,
};

// Enum MassAIPrototypeEnemyRuntime.ECrEnemyType
// NumValues: 0x0004
enum class ECrEnemyType : uint8
{
	Normal                                   = 0,
	ForgottenEngine                          = 1,
	BaseAttack                               = 2,
	ECrEnemyType_MAX                         = 3,
};

// Enum MassAIPrototypeEnemyRuntime.EMassEnemyInitializationState
// NumValues: 0x0009
enum class EMassEnemyInitializationState : uint8
{
	Not_Initialized                          = 0,
	Spawned                                  = 1,
	Initial_LOD_Assigned                     = 2,
	Spawn_Animation_Started                  = 3,
	Active                                   = 4,
	Dead                                     = 5,
	Dead_PlayingDeadAnim                     = 6,
	Dead_Ragdoll                             = 7,
	EMassEnemyInitializationState_MAX        = 8,
};

// Enum MassAIPrototypeEnemyRuntime.ENavlinkGenerationStage
// NumValues: 0x0006
enum class ENavlinkGenerationStage : uint8
{
	NotGenerating                            = 0,
	CollectingTileNavmeshPoints              = 1,
	GeneratingStandardNavlinks               = 2,
	CollectingNavmeshIslands                 = 3,
	GeneratingNavmeshIslandsNavlinks         = 4,
	ENavlinkGenerationStage_MAX              = 5,
};

// Enum MassAIPrototypeEnemyRuntime.EMassEnemyVertexAnimState
// NumValues: 0x002B
enum class EMassEnemyVertexAnimState : uint8
{
	IdleA                                    = 0,
	IdleB                                    = 1,
	IdleBStart                               = 2,
	IdleBLoop                                = 3,
	IdleBEnd                                 = 4,
	IdleC                                    = 5,
	IdleCStart                               = 6,
	IdleCLoop                                = 7,
	IdleCEnd                                 = 8,
	Walk                                     = 9,
	WalkForwardLeft                          = 10,
	WalkForwardRight                         = 11,
	AttackA                                  = 12,
	AttackB                                  = 13,
	DigOut                                   = 14,
	HitA                                     = 15,
	HitB                                     = 16,
	Death                                    = 17,
	DeathLeft                                = 18,
	DeathRight                               = 19,
	DeathBackLeft                            = 20,
	DeathBackRight                           = 21,
	DeathFrontLeft                           = 22,
	DeathFrontRight                          = 23,
	Jump                                     = 24,
	TauntA                                   = 25,
	TauntB                                   = 26,
	TauntC                                   = 27,
	TauntD                                   = 28,
	TauntE                                   = 29,
	SitDown                                  = 30,
	StandUp                                  = 31,
	Activate                                 = 32,
	Explode                                  = 33,
	StrafeLeft                               = 34,
	StrafeRight                              = 35,
	RotateLeft                               = 36,
	RotateRight                              = 37,
	Bubble                                   = 38,
	Vents                                    = 39,
	IdleALoop                                = 40,
	Undefined                                = 41,
	EMassEnemyVertexAnimState_MAX            = 42,
};

// Enum MassAIPrototypeEnemyRuntime.ECrBurstSpawnPolicy
// NumValues: 0x0003
enum class ECrBurstSpawnPolicy : uint8
{
	ENTITIES_KILLED                          = 0,
	ALL_ENTITIES_SPAWNED                     = 1,
	ECrBurstSpawnPolicy_MAX                  = 2,
};

// ScriptStruct MassAIPrototypeEnemyRuntime.MassEnemyAggroQuery
// 0x00A8 (0x00A8 - 0x0000)
struct FMassEnemyAggroQuery final
{
public:
	struct FVector                                QueryCenter;                                       // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         QueryRadius;                                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinAggro;                                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChangeAggroTargetMultiplier;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECrEnemyType                                  QueryType;                                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEntityHandle                      QuerierEntity;                                     // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassEntityHandle                      CurrentTarget;                                     // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMassEntityHandle>              BannedTargets;                                     // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	ECrSpawnFenceType                             FenceType;                                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeSinceLastUpdate;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsNonBuildingQuery;                               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCrAggroTargetData                     CurrentAggroTargetData;                            // 0x0058(0x0050)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMassEnemyAggroQuery;

// ScriptStruct MassAIPrototypeEnemyRuntime.DonutFloatingTrailData
// 0x0060 (0x0060 - 0x0000)
struct FDonutFloatingTrailData final
{
public:
	class UNiagaraComponent*                      TrailParticleSystem;                               // 0x0000(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FVector                                TargetLocation;                                    // 0x0008(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LastLocation;                                      // 0x0020(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFalling;                                          // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FallProgress;                                      // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0040(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       Spline;                                            // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FDonutFloatingTrailData;

// ScriptStruct MassAIPrototypeEnemyRuntime.BaseSiteAttackSubsystemTickFunction
// 0x0008 (0x0030 - 0x0028)
struct FBaseSiteAttackSubsystemTickFunction final : public FTickFunction
{
public:
	class UBaseSiteAttackSubsystem*               BaseSiteAttackSubsystem;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
};
DUMPER7_ASSERTS_FBaseSiteAttackSubsystemTickFunction;

// ScriptStruct MassAIPrototypeEnemyRuntime.MassEnemyBaseAttackSpawnPosition
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FMassEnemyBaseAttackSpawnPosition final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassEnemyBaseAttackSpawnPosition;

// ScriptStruct MassAIPrototypeEnemyRuntime.MassEnemyBaseAttackData
// 0x0168 (0x0168 - 0x0000)
struct FMassEnemyBaseAttackData final
{
public:
	uint8                                         Pad_0[0xE0];                                       // 0x0000(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMassEntityHandle>              AllSpawnedEntites;                                 // 0x00E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x78];                                      // 0x00F0(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassEnemyBaseAttackData;

// ScriptStruct MassAIPrototypeEnemyRuntime.BaseSiteAttackSaveAIData
// 0x0038 (0x0038 - 0x0000)
struct FBaseSiteAttackSaveAIData final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AiType;                                            // 0x0018(0x0020)(SaveGame, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBaseSiteAttackSaveAIData;

// ScriptStruct MassAIPrototypeEnemyRuntime.BaseSiteAttackSubsystemSaveData
// 0x00E0 (0x00E0 - 0x0000)
struct FBaseSiteAttackSubsystemSaveData final
{
public:
	float                                         LastBaseAttackEvaluationTimestamp;                 // 0x0000(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassEnemyBaseAttackState                     BaseAttackState;                                   // 0x0004(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentAttackMaxWaves;                             // 0x0008(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentAttackWave;                                 // 0x000C(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MovingTowardsBaseActorAvailable;                   // 0x0010(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AttackStartTimestamp;                              // 0x0014(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AttackSimulatedPosition;                           // 0x0018(0x0018)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InitialTargetPosition;                             // 0x0030(0x0018)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AlienObeliskPosition;                              // 0x0048(0x0018)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCrMassPersistentEntityID              AttackedBaseCoreHandlePersistent;                  // 0x0060(0x0010)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   AttackedBaseBounds;                                // 0x0070(0x0038)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCrMassPersistentEntityID              InitialTargetEntity;                               // 0x00A8(0x0010)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCrMassPersistentEntityID              SpawnerEntity;                                     // 0x00B8(0x0010)(SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialTargetArriveDistance;                       // 0x00C8(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastAttackedCoreLevel;                             // 0x00CC(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBaseSiteAttackSaveAIData>      BaseSiteAttackSaveAIData;                          // 0x00D0(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBaseSiteAttackSubsystemSaveData;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiBtDistanceCheckBoolCondition
// 0x0038 (0x0038 - 0x0000)
struct FCrAiBtDistanceCheckBoolCondition final
{
public:
	EGenericAICheck                               ConditionType;                                     // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceToCompareTo;                               // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDivideProvidedDistanceByScale;                    // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFAIDistanceType                              DistanceComparisionType;                           // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 ResultKey;                                         // 0x0010(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiBtDistanceCheckBoolCondition;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiBtVelocityCheckBoolCondition
// 0x0038 (0x0038 - 0x0000)
struct FCrAiBtVelocityCheckBoolCondition final
{
public:
	EGenericAICheck                               ConditionType;                                     // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VelocityToCompareTo;                               // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFAIDistanceType                              VelocityComparisionType;                           // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 ResultKey;                                         // 0x0010(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiBtVelocityCheckBoolCondition;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiBtConeCheckBoolCondition
// 0x0030 (0x0030 - 0x0000)
struct FCrAiBtConeCheckBoolCondition final
{
public:
	EGenericAICheck                               ConditionType;                                     // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAbsoluteAngle;                                 // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AngleToCompareTo;                                  // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 ResultKey;                                         // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiBtConeCheckBoolCondition;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiBtResultCheckBoolCondition
// 0x0030 (0x0030 - 0x0000)
struct FCrAiBtResultCheckBoolCondition final
{
public:
	bool                                          bDesiredResult;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 ResultKey;                                         // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiBtResultCheckBoolCondition;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiTimeCheckBoolCondition
// 0x0058 (0x0058 - 0x0000)
struct FCrAiTimeCheckBoolCondition final
{
public:
	bool                                          DesiredBoolValue;                                  // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeToCompareTo;                                   // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 ResultKey;                                         // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 TempBoolConditionMemoryVectorKey;                  // 0x0030(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiTimeCheckBoolCondition;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiTimestampCheckBoolCondition
// 0x0030 (0x0030 - 0x0000)
struct FCrAiTimestampCheckBoolCondition final
{
public:
	float                                         TimeToCompareTo;                                   // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenericAICheck                               ConditionType;                                     // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 ResultKey;                                         // 0x0008(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiTimestampCheckBoolCondition;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiBtCheckBase
// 0x0038 (0x0038 - 0x0000)
struct FCrAiBtCheckBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseCustomUpdatePeriod;                            // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpdatePeriodOverrideS;                             // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 TempLastUpdateTimestampKey;                        // 0x0010(0x0028)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiBtCheckBase;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiBtDistanceCheck
// 0x00C0 (0x00F8 - 0x0038)
struct FCrAiBtDistanceCheck final : public FCrAiBtCheckBase
{
public:
	struct FBlackboardKeySelector                 CheckStartKey;                                     // 0x0038(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 CheckEndKey;                                       // 0x0060(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 AiScaleKey;                                        // 0x0088(0x0028)(Edit, NativeAccessSpecifierPublic)
	bool                                          bSaveDistanceToBBKey;                              // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 KeyToSaveDistanceTo;                               // 0x00B8(0x0028)(Edit, NativeAccessSpecifierPublic)
	EFAIDistanceType                              SavedDistanceType;                                 // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCrAiBtDistanceCheckBoolCondition> BooleanConditions;                              // 0x00E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiBtDistanceCheck;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiBtAngleCheck
// 0x0098 (0x00D0 - 0x0038)
struct FCrAiBtAngleCheck final : public FCrAiBtCheckBase
{
public:
	struct FBlackboardKeySelector                 ConeBaseActorKey;                                  // 0x0038(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 ConeCheckLocationKey;                              // 0x0060(0x0028)(Edit, NativeAccessSpecifierPublic)
	bool                                          bSaveAngleToBBKey;                                 // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 KeyToSaveAngleTo;                                  // 0x0090(0x0028)(Edit, NativeAccessSpecifierPublic)
	bool                                          bSaveAbsoluteAngle;                                // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCrAiBtConeCheckBoolCondition>  BooleanConditions;                                 // 0x00C0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiBtAngleCheck;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiBtPathCheck
// 0x00A8 (0x00E0 - 0x0038)
struct FCrAiBtPathCheck final : public FCrAiBtCheckBase
{
public:
	struct FBlackboardKeySelector                 PathStartLocationKey;                              // 0x0038(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 PathEndLocationKey;                                // 0x0060(0x0028)(Edit, NativeAccessSpecifierPublic)
	bool                                          bSaveHasPathToBBKey;                               // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 KeyToSaveHasPathTo;                                // 0x0090(0x0028)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavigationQueryFilter>     FilterClass;                                       // 0x00B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPathExistanceQueryType                       PathQueryType;                                     // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCrAiTimeCheckBoolCondition>    TimeConditions;                                    // 0x00C8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   NavAgentName;                                      // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiBtPathCheck;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiBtLineOfSightCheck
// 0x00F8 (0x0130 - 0x0038)
struct FCrAiBtLineOfSightCheck final : public FCrAiBtCheckBase
{
public:
	struct FBlackboardKeySelector                 SourceKey;                                         // 0x0038(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 TargetKey;                                         // 0x0060(0x0028)(Edit, NativeAccessSpecifierPublic)
	bool                                          bDrawDebug;                                        // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveExtents;                                    // 0x0089(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 TargetExtentsKey;                                  // 0x0090(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 TargetRotatorKey;                                  // 0x00B8(0x0028)(Edit, NativeAccessSpecifierPublic)
	bool                                          bSaveHasLosToBBKey;                                // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 KeyToSaveHasLosTo;                                 // 0x00E8(0x0028)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FCrAiBtResultCheckBoolCondition> BooleanConditions;                                // 0x0110(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCrAiTimeCheckBoolCondition>    TimeConditions;                                    // 0x0120(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiBtLineOfSightCheck;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiBtSweepCheck
// 0x0098 (0x00D0 - 0x0038)
struct FCrAiBtSweepCheck final : public FCrAiBtCheckBase
{
public:
	struct FBlackboardKeySelector                 SourceKey;                                         // 0x0038(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 TargetKey;                                         // 0x0060(0x0028)(Edit, NativeAccessSpecifierPublic)
	bool                                          bUseCapsuleHalfHeight;                             // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SweepSphereRadius;                                 // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowSweepTestDebug;                               // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSaveSweepIsTestCleanToBBKey;                      // 0x0091(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 KeyToSaveIsSweepTestCleanTo;                       // 0x0098(0x0028)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FCrAiTimeCheckBoolCondition>    TimeConditions;                                    // 0x00C0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiBtSweepCheck;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiBtTrajectoryCheck
// 0x00D8 (0x0110 - 0x0038)
struct FCrAiBtTrajectoryCheck final : public FCrAiBtCheckBase
{
public:
	float                                         ArcParam;                                          // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProjectileRadius;                                  // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawDebug;                                        // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 SourcePositionKey;                                 // 0x0048(0x0028)(Edit, NativeAccessSpecifierPublic)
	bool                                          bForceUsingTargetLocation;                         // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTryToUseLocationWhenActorIsNull;                  // 0x0071(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 TargetActorKey;                                    // 0x0078(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 TargetLocationKey;                                 // 0x00A0(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 TargetExtentsKey;                                  // 0x00C8(0x0028)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FCrAiBtResultCheckBoolCondition> BooleanConditions;                                // 0x00F0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCrAiTimeCheckBoolCondition>    TimeConditions;                                    // 0x0100(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiBtTrajectoryCheck;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiBtVelocityCheck
// 0x0070 (0x00A8 - 0x0038)
struct FCrAiBtVelocityCheck final : public FCrAiBtCheckBase
{
public:
	struct FBlackboardKeySelector                 CheckActorKey;                                     // 0x0038(0x0028)(Edit, NativeAccessSpecifierPublic)
	bool                                          bSaveVelocityToBBKey;                              // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 KeyToSaveVelocityTo;                               // 0x0068(0x0028)(Edit, NativeAccessSpecifierPublic)
	EFAIDistanceType                              SavedVelocityType;                                 // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCrAiBtVelocityCheckBoolCondition> BooleanConditions;                              // 0x0098(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiBtVelocityCheck;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiBtTimestampCheck
// 0x0038 (0x0070 - 0x0038)
struct FCrAiBtTimestampCheck final : public FCrAiBtCheckBase
{
public:
	struct FBlackboardKeySelector                 TimestampToCheckKey;                               // 0x0038(0x0028)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FCrAiTimestampCheckBoolCondition> BooleanConditions;                               // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAiBtTimestampCheck;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrAiActionDataMovement
// 0x0050 (0x0050 - 0x0000)
struct FCrAiActionDataMovement final
{
public:
	class AActor*                                 ActorDestination;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FVector                                MoveDestination;                                   // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AcceptanceRadius;                                  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopOnOverlap;                                    // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         YawRotationRate;                                   // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOrientRotationToMovement;                         // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchTargetSpeed;                                 // 0x002D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetMaxSpeed;                                      // 0x002E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxSpeed;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinSpeed;                                          // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetSpeedMultiplier;                             // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopMovementOnActionFinished;                     // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UNavigationQueryFilter>     NavFilterClass;                                    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowPartialPath;                                 // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableRootMotionOnMovement;                      // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrAiActionDataMovement;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrUseNavLinkActionConfiguration
// 0x0030 (0x0030 - 0x0000)
struct FCrUseNavLinkActionConfiguration final
{
public:
	float                                         DestinationRandomizeRadius;                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NavlinkDistanceErrorThreshold;                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         JumpFocusPriority;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RestoreCollisionTimeMod;                           // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinJumpArc;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxJumpArc;                                        // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JumpArcModifierStep;                               // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JumpSimFrequency;                                  // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultGravityScale;                               // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultLandTime;                                   // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultLandSpeed;                                  // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JumpTimePredictionSimFrequency;                    // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrUseNavLinkActionConfiguration;

// ScriptStruct MassAIPrototypeEnemyRuntime.NavlinkCrowdData
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FNavlinkCrowdData final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNavlinkCrowdData;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrMassAvoidanceFragment
// 0x0098 (0x0098 - 0x0000)
struct alignas(0x08) FCrMassAvoidanceFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x98];                                       // 0x0000(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrMassAvoidanceFragment;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrBaseAttackSpawnIndicatorTag
// 0x0000 (0x0001 - 0x0001)
struct FCrBaseAttackSpawnIndicatorTag final : public FMassTag
{
};
DUMPER7_ASSERTS_FCrBaseAttackSpawnIndicatorTag;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrMassEnemyReplicatedAgentPositionYawData
// 0x0020 (0x0020 - 0x0000)
struct FCrMassEnemyReplicatedAgentPositionYawData final
{
public:
	struct FVector_NetQuantize                    Position;                                          // 0x0000(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int8                                          Yaw;                                               // 0x0018(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrMassEnemyReplicatedAgentPositionYawData;

// ScriptStruct MassAIPrototypeEnemyRuntime.MassEnemyCommonReplicationData
// 0x0050 (0x0050 - 0x0000)
struct FMassEnemyCommonReplicationData final
{
public:
	bool                                          bHasActor;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsSpawnAnimationInitialized;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SecondsSinceSpawn;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	float                                         UniformWorldScale;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         HismScale;                                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Height;                                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ZOffset;                                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMassEntityHandle                      TargetEntity;                                      // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMassEnemyInitializationState                 MassEnemyState;                                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SecondsSinceMassEnemyStateChange;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector_NetQuantize                    JumpDestination;                                   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         JumpTimestamp;                                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         LOD;                                               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassEnemyCommonReplicationData;

// ScriptStruct MassAIPrototypeEnemyRuntime.MassEnemyRagdollReplicationData
// 0x0040 (0x0040 - 0x0000)
struct FMassEnemyRagdollReplicationData final
{
public:
	struct FVector_NetQuantize                    ForceImpulseLocation;                              // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector_NetQuantize                    ForceImpulseNormal;                                // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ForceImpulseDistance;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           DamageTag;                                         // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMassEnemyRagdollReplicationData;

// ScriptStruct MassAIPrototypeEnemyRuntime.MassEnemyFrequentlyReplicatedData
// 0x0018 (0x0018 - 0x0000)
struct FMassEnemyFrequentlyReplicatedData final
{
public:
	struct FVector_NetQuantize                    Velocity;                                          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FMassEnemyFrequentlyReplicatedData;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrReplicatedAiAgent
// 0x00C8 (0x00F0 - 0x0028)
struct FCrReplicatedAiAgent final : public FReplicatedAgentBase
{
public:
	struct FCrMassEnemyReplicatedAgentPositionYawData PositionYaw;                                   // 0x0028(0x0020)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	struct FMassEnemyCommonReplicationData        CommonReplicationData;                             // 0x0048(0x0050)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	struct FMassEnemyRagdollReplicationData       RagdollReplicationData;                            // 0x0098(0x0040)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	struct FMassEnemyFrequentlyReplicatedData     FrequentlyReplicatedData;                          // 0x00D8(0x0018)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCrReplicatedAiAgent;

// ScriptStruct MassAIPrototypeEnemyRuntime.CrMassEnemyFastArrayItem
// 0x00F0 (0x0100 - 0x0010)
