#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PopupInfoWindow

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PopupInfoWindow.WBP_PopupInfoWindow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PopupInfoWindow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PopupInfoWindow_C_PreConstruct;

// Function WBP_PopupInfoWindow.WBP_PopupInfoWindow_C.ExecuteUbergraph_WBP_PopupInfoWindow
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) WBP_PopupInfoWindow_C_ExecuteUbergraph_WBP_PopupInfoWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PopupInfoWindow_C_ExecuteUbergraph_WBP_PopupInfoWindow;

// Function WBP_PopupInfoWindow.WBP_PopupInfoWindow_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_PopupInfoWindow_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_PopupInfoWindow_C_BP_GetDesiredFocusTarget;

}

