#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActionButton

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "ChimeraUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ActionButton.WBP_ActionButton_C
// 0x0768 (0x0B80 - 0x0418)
class UWBP_ActionButton_C final : public UCrUW_ActionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsDefault;                                        // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBlack;                                          // 0x0429(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42A[0x6];                                      // 0x042A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           ButtonStyle;                                       // 0x0430(0x0390)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UObject*                                ButtonImage;                                       // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ShowButton;                                        // 0x07C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C9[0x7];                                      // 0x07C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           DisabledButtonStyle;                               // 0x07D0(0x0390)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           HighlightColor;                                    // 0x0B60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabled;                                         // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x0B71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetTextStyle(int32 FontSize, bool ToUpper, bool BlackFont, const struct FLinearColor& FontColor);
	void SetTextMaxWidth(int32 Size);
	void SetText(const class FText& InText);
	void SetSize(int32 Width, int32 Height);
	void SetFontSize(int32 FontSize, bool BoldFont);
	void SetDefault(bool bInDefault);
	void SetColors(const class UCrCommonUIColorsDevSettings* Settings);
	void SetButtonEnabled(bool bEnabled);
	void SetAlignment(EHorizontalAlignment Alignment);
	void SetActionNamePadding(bool bSet);
	void PreConstruct(bool IsDesignTime);
	void GetHeightSize(double* Height);
	void ExecuteUbergraph_WBP_ActionButton(int32 EntryPoint);
	void Construct();
	void BndEvt__WBP_ActionButton_OverlayButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_ActionButton_OverlayButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_ActionButton_InputActionWidget_K2Node_ComponentBoundEvent_2_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ActionButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ActionButton_C")
	}
	static class UWBP_ActionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ActionButton_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ActionButton_C;

}

