#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Melee_Tier0_Ragdoll

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_Melee_Tier0_Ragdoll_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Melee_Tier0_Ragdoll.ABP_Melee_Tier0_Ragdoll_C
// 0x0120 (0x0540 - 0x0420)
class UABP_Melee_Tier0_Ragdoll_C final : public UCrDeathActorAnimInstance
{
public:
	struct ABP_Melee_Tier0_Ragdoll::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;      // 0x0420(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_422[0x6];                                      // 0x0422(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0428(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0430(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0438(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0458(0x0050)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x04A8(0x0090)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Melee_Tier0_Ragdoll_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Melee_Tier0_Ragdoll_C")
	}
	static class UABP_Melee_Tier0_Ragdoll_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Melee_Tier0_Ragdoll_C>();
	}
};
DUMPER7_ASSERTS_UABP_Melee_Tier0_Ragdoll_C;

}

