#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PanzerHund

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "ABP_PanzerHund_structs.hpp"
#include "MassAIPrototypeEnemyRuntime_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PanzerHund.ABP_PanzerHund_C
// 0x0A10 (0x0FB0 - 0x05A0)
class UABP_PanzerHund_C final : public UMassEnemyAnimationInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_PanzerHund::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;               // 0x05A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x05B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x05C0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05C8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x05E8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0618(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0648(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0678(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x06A8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x06D8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0708(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0738(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0768(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0798(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x07C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x07F8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0828(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x0870(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0890(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x08D8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x08F8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0940(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0960(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x09A8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x09C8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0A10(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0A30(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0A78(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0A98(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0B08(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0B78(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0C40(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0C60(0x00C8)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer_1;                      // 0x0D28(0x0078)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer;                        // 0x0DA0(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0E18(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0E68(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0EB0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0ED0(0x00C8)()
	bool                                          IsMovementBlockedFromAnim;                         // 0x0F98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F99[0x3];                                      // 0x0F99(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AccumulatedTime;                                   // 0x0F9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetVar;                                         // 0x0FA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentVar;                                        // 0x0FA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_EndAnim();
	void AnimNotify_EndAnimAction();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PanzerHund_AnimGraphNode_BlendListByBool_02AE2C514348813F632D369ADA908DBF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PanzerHund_AnimGraphNode_TransitionResult_27F76AF94367732BF993B6A30F87DE58();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PanzerHund_AnimGraphNode_TransitionResult_359A59E542F2562DBDE186B92E55F8AF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PanzerHund_AnimGraphNode_TransitionResult_5326C34B4A66B352494F2CB0ADF7C38A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PanzerHund_AnimGraphNode_TransitionResult_90CD82ED49415B8A4DEFA186CB86A8E8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PanzerHund_AnimGraphNode_TransitionResult_9903681940ED80EA8C5AEB81918B1CA2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PanzerHund_AnimGraphNode_TransitionResult_9A404664478112ED230BF8A28C3BA19D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PanzerHund_AnimGraphNode_TransitionResult_B3512C734A4CA868589A3FBA9029C5D0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PanzerHund_AnimGraphNode_TransitionResult_B98D7E1049D3D4B2EB89119440EB9691();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PanzerHund_AnimGraphNode_TransitionResult_BB26A058460D440C220A39A576A45AF9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_PanzerHund_AnimGraphNode_TransitionResult_FB8492694E4AD31DAC9BAFBE3ACB0BA7();
	void ExecuteUbergraph_ABP_PanzerHund(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_PanzerHund_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_PanzerHund_C")
	}
	static class UABP_PanzerHund_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PanzerHund_C>();
	}
};
DUMPER7_ASSERTS_UABP_PanzerHund_C;

}

