#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Crab

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "ABP_Crab_structs.hpp"
#include "MassAIPrototypeEnemyRuntime_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Crab.ABP_Crab_C
// 0x07A0 (0x0D40 - 0x05A0)
class UABP_Crab_C final : public UMassEnemyAnimationInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Crab::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                     // 0x05A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x05B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x05C0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05C8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x05E8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0618(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0648(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x06B8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x06D8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0708(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0738(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0768(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0798(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x07C8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x07F8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0828(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0858(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0888(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x08B8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x0900(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0920(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0968(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0988(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x09D0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x09F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0A38(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0A58(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0AA0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0AC0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0B08(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0B28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0B70(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0B90(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0C58(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0C78(0x00C8)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Crab_AnimGraphNode_TransitionResult_2495E587484B66035345C7AC5EAA4F74();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Crab_AnimGraphNode_TransitionResult_2698D1E144DB7D6840F34883A3156DEC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Crab_AnimGraphNode_TransitionResult_4A5AC1544A98FB586DBB42A51278C2C7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Crab_AnimGraphNode_TransitionResult_72B162C84ECE46E70D9FE588B6A895FC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Crab_AnimGraphNode_TransitionResult_7E2D042C4E7C7DB1048695B879644912();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Crab_AnimGraphNode_TransitionResult_8458F6C544DBBA59ED07DA9D15FB85AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Crab_AnimGraphNode_TransitionResult_B2351E1A43B9D50EFC128D913BB8394F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Crab_AnimGraphNode_TransitionResult_D67F807E4D33B7DFAE83C6A19BB2CED7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Crab_AnimGraphNode_TransitionResult_D6FE547C421C0BA5A4047297F8FFBFBB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Crab_AnimGraphNode_TransitionResult_F0852B29432567011AA1F48ECBC2C008();
	void ExecuteUbergraph_ABP_Crab(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Crab_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Crab_C")
	}
	static class UABP_Crab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Crab_C>();
	}
};
DUMPER7_ASSERTS_UABP_Crab_C;

}

