#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SuitWorkshop

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ABP_SuitWorkshop_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_SuitWorkshop.ABP_SuitWorkshop_C
// 0x00C0 (0x04E0 - 0x0420)
class UABP_SuitWorkshop_C final : public UAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_SuitWorkshop::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;             // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0430(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0438(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0440(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0460(0x0070)()
	float                                         Alpha;                                             // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SuitWorkshop_C*                     BP_SuitWorkshop_reference;                         // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_A_arm_laser_1();
	void AnimNotify_A_arm_laser_2();
	void AnimNotify_A_arm_laser_3();
	void AnimNotify_A_arm_laser_4();
	void AnimNotify_B_arm_laser_1();
	void AnimNotify_B_arm_laser_2();
	void AnimNotify_B_arm_laser_3();
	void AnimNotify_B_arm_laser_4();
	void AnimNotify_C_arm_laser_1();
	void AnimNotify_C_arm_laser_2();
	void AnimNotify_C_arm_laser_3();
	void AnimNotify_C_arm_laser_4();
	void AnimNotify_D_arm_laser_1();
	void AnimNotify_D_arm_laser_2();
	void AnimNotify_D_arm_laser_3();
	void AnimNotify_D_arm_laser_4();
	void BlueprintBeginPlay();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SuitWorkshop_AnimGraphNode_BlendSpacePlayer_42EF01434F2AB123C96389A2D4555290();
	void ExecuteUbergraph_ABP_SuitWorkshop(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_SuitWorkshop_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_SuitWorkshop_C")
	}
	static class UABP_SuitWorkshop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_SuitWorkshop_C>();
	}
};
DUMPER7_ASSERTS_UABP_SuitWorkshop_C;

}

