#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuActorWidgets

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AuActorWidgets_structs.hpp"
#include "Engine_classes.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// Class AuActorWidgets.AuActorWidgetSetting
// 0x0040 (0x0070 - 0x0030)
class UAuActorWidgetSetting final : public UDataAsset
{
public:
	TArray<TSubclassOf<class AActor>>             ActorClasses;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         WidgetClass;                                       // 0x0040(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ContextName;                                       // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAuActorWidgetHideMode                        HideMode;                                          // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuActorWidgetSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuActorWidgetSetting")
	}
	static class UAuActorWidgetSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuActorWidgetSetting>();
	}
};
DUMPER7_ASSERTS_UAuActorWidgetSetting;

// Class AuActorWidgets.AuWidgetInputsInterface
// 0x0000 (0x0000 - 0x0000)
class IAuWidgetInputsInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuWidgetInputsInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuWidgetInputsInterface")
	}
	static class IAuWidgetInputsInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAuWidgetInputsInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAuWidgetInputsInterface;

// Class AuActorWidgets.AuActorWidgetBase
// 0x0050 (0x0588 - 0x0538)
class UAuActorWidgetBase : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_538[0x40];                                     // 0x0538(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	EAuWidgetInputMode                            InputConfig;                                       // 0x0578(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowCursor;                                       // 0x0579(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_57A[0x6];                                      // 0x057A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InteractingActor;                                  // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	void BP_OnHideWidget();
	void BP_OnShowForActor(class AActor* InActor, class APlayerController* InPc);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuActorWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuActorWidgetBase")
	}
	static class UAuActorWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuActorWidgetBase>();
	}
};
DUMPER7_ASSERTS_UAuActorWidgetBase;

// Class AuActorWidgets.AuActorWidgetsSubsystem
// 0x0088 (0x00B8 - 0x0030)
class UAuActorWidgetsSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAuActorWidgetSetting*>          AllSettings;                                       // 0x0058(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_68[0x50];                                      // 0x0068(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HideWidgetsByContext(class FName InContextName);
	void HideWidgetsByContexts(const TArray<class FName>& InContextNames);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuActorWidgetsSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuActorWidgetsSubsystem")
	}
	static class UAuActorWidgetsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuActorWidgetsSubsystem>();
	}
};
DUMPER7_ASSERTS_UAuActorWidgetsSubsystem;

}

