#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuGameplayTests

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "Engine_classes.hpp"
#include "AuItems_classes.hpp"


namespace SDK
{

// Class AuGameplayTests.AuTestAttributeSet
// 0x0030 (0x0060 - 0x0030)
class UAuTestAttributeSet final : public UAttributeSet
{
public:
	struct FGameplayAttributeData                 Damage;                                            // 0x0030(0x0010)(NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Health;                                            // 0x0040(0x0010)(NativeAccessSpecifierPublic)
	struct FGameplayAttributeData                 Stamina;                                           // 0x0050(0x0010)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuTestAttributeSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuTestAttributeSet")
	}
	static class UAuTestAttributeSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuTestAttributeSet>();
	}
};
DUMPER7_ASSERTS_UAuTestAttributeSet;

// Class AuGameplayTests.AuItemsActorBaseTest
// 0x0030 (0x02D8 - 0x02A8)
class AAuItemsActorBaseTest final : public AActor
{
public:
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuTestAttributeSet*                    Attributes;                                        // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAbilitySystemComponent*                ASC;                                               // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAuItemsComponent*                      ItemsA;                                            // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAuItemsComponent*                      ItemsB;                                            // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAuItemsStoreComponent*                 ItemsStore;                                        // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemsActorBaseTest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemsActorBaseTest")
	}
	static class AAuItemsActorBaseTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAuItemsActorBaseTest>();
	}
};
DUMPER7_ASSERTS_AAuItemsActorBaseTest;

// Class AuGameplayTests.AuItemTest01DataBase
// 0x0000 (0x0400 - 0x0400)
class UAuItemTest01DataBase final : public UAuItemData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemTest01DataBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemTest01DataBase")
	}
	static class UAuItemTest01DataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemTest01DataBase>();
	}
};
DUMPER7_ASSERTS_UAuItemTest01DataBase;

// Class AuGameplayTests.AuItemGrantedGameplayEffect
// 0x0000 (0x0A90 - 0x0A90)
class UAuItemGrantedGameplayEffect final : public UGameplayEffect
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemGrantedGameplayEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemGrantedGameplayEffect")
	}
	static class UAuItemGrantedGameplayEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemGrantedGameplayEffect>();
	}
};
DUMPER7_ASSERTS_UAuItemGrantedGameplayEffect;

// Class AuGameplayTests.AuItemTest01EffectDataBase
// 0x0000 (0x0400 - 0x0400)
class UAuItemTest01EffectDataBase final : public UAuItemData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemTest01EffectDataBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemTest01EffectDataBase")
	}
	static class UAuItemTest01EffectDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemTest01EffectDataBase>();
	}
};
DUMPER7_ASSERTS_UAuItemTest01EffectDataBase;

// Class AuGameplayTests.AuItemTest01AbilityDataBase
// 0x0000 (0x0400 - 0x0400)
class UAuItemTest01AbilityDataBase final : public UAuItemData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemTest01AbilityDataBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemTest01AbilityDataBase")
	}
	static class UAuItemTest01AbilityDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemTest01AbilityDataBase>();
	}
};
DUMPER7_ASSERTS_UAuItemTest01AbilityDataBase;

// Class AuGameplayTests.AuItemTest02DataBase
// 0x0000 (0x0400 - 0x0400)
class UAuItemTest02DataBase final : public UAuItemData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemTest02DataBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemTest02DataBase")
	}
	static class UAuItemTest02DataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemTest02DataBase>();
	}
};
DUMPER7_ASSERTS_UAuItemTest02DataBase;

// Class AuGameplayTests.AuItemTest01ComponentDataBase
// 0x0000 (0x0400 - 0x0400)
class UAuItemTest01ComponentDataBase final : public UAuItemComponentData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemTest01ComponentDataBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemTest01ComponentDataBase")
	}
	static class UAuItemTest01ComponentDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemTest01ComponentDataBase>();
	}
};
DUMPER7_ASSERTS_UAuItemTest01ComponentDataBase;

// Class AuGameplayTests.AuItemTest01EffectComponentDataBase
// 0x0000 (0x0400 - 0x0400)
class UAuItemTest01EffectComponentDataBase final : public UAuItemComponentData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemTest01EffectComponentDataBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemTest01EffectComponentDataBase")
	}
	static class UAuItemTest01EffectComponentDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemTest01EffectComponentDataBase>();
	}
};
DUMPER7_ASSERTS_UAuItemTest01EffectComponentDataBase;

// Class AuGameplayTests.AuItemTest01AbilityComponentDataBase
// 0x0000 (0x0400 - 0x0400)
class UAuItemTest01AbilityComponentDataBase final : public UAuItemComponentData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemTest01AbilityComponentDataBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemTest01AbilityComponentDataBase")
	}
	static class UAuItemTest01AbilityComponentDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemTest01AbilityComponentDataBase>();
	}
};
DUMPER7_ASSERTS_UAuItemTest01AbilityComponentDataBase;

// Class AuGameplayTests.AuItemTest02ComponentDataBase
// 0x0000 (0x0400 - 0x0400)
class UAuItemTest02ComponentDataBase final : public UAuItemComponentData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuItemTest02ComponentDataBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuItemTest02ComponentDataBase")
	}
	static class UAuItemTest02ComponentDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuItemTest02ComponentDataBase>();
	}
};
DUMPER7_ASSERTS_UAuItemTest02ComponentDataBase;

}

