#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AuNotification

#include "Basic.hpp"


namespace SDK
{

// Enum AuNotification.FAuNotificationType
// NumValues: 0x000E
enum class EFAuNotificationType : uint32
{
	NONE                                     = 18446744073709551615,
	Item                                     = 0,
	Building                                 = 1,
	BuildingCollection                       = 2,
	Recipe                                   = 3,
	PlayerSkillLevelUp                       = 4,
	GemSlotUnlocked                          = 5,
	BaseUnderAttack                          = 6,
	EncyclopediaEntryUnlocked                = 7,
	InventoryFull                            = 8,
	ItemDropped                              = 9,
	FeatureUnlocked                          = 10,
	BlueprintUnlocked                        = 11,
	FAuNotificationType_MAX                  = 12,
};

// ScriptStruct AuNotification.AuNotificationSetting
// 0x0030 (0x0030 - 0x0000)
struct FAuNotificationSetting final
{
public:
	TSoftClassPtr<class UClass>                   WidgetClass;                                       // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisplayMinInterval;                                // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuNotificationSetting;

// ScriptStruct AuNotification.AuNotificationContext
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FAuNotificationContext
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAuNotificationContext;

// ScriptStruct AuNotification.AuNotifyItem
// 0x0010 (0x0010 - 0x0000)
struct FAuNotifyItem final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuUW_NotificationBase*                 Notification;                                      // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FAuNotifyItem;

}

