#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Foundable_FE_ControllStation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Foundable_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Foundable_FE_ControllStation.BP_Foundable_FE_ControllStation_C
// 0x0038 (0x0340 - 0x0308)
class ABP_Foundable_FE_ControllStation_C final : public ABP_Foundable_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Foundable_FE_ControllStation_C;  // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ControlStationKey;                              // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_t_21E2803240F8B3B6E7C07493743C9542;     // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_21E2803240F8B3B6E7C07493743C9542; // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_t_E75A4F9D44E27F51DBB8FB94C43D2212;       // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_E75A4F9D44E27F51DBB8FB94C43D2212; // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Foundable_FE_ControllStation(int32 EntryPoint);
	void OnStarageEmpriedEvent();
	bool OnStorageEmptied();
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Foundable_FE_ControllStation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Foundable_FE_ControllStation_C")
	}
	static class ABP_Foundable_FE_ControllStation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Foundable_FE_ControllStation_C>();
	}
};
DUMPER7_ASSERTS_ABP_Foundable_FE_ControllStation_C;

}

