#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HabitatPostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HabitatPostProcess.BP_HabitatPostProcess_C
// 0x0080 (0x0328 - 0x02A8)
class ABP_HabitatPostProcess_C final : public ACrEnviroWaveVisualsActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcessWave;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PostProcess;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        Blend_Radius;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMap<EEnviroWave, struct FCrEnviroWaveCurveFloatMap> VolumeBlendingCurves;                       // 0x02D8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)

public:
	void UserConstructionScript();
	void OnEnviroWaveTick(EEnviroWave WaveType, EEnviroWaveStage WaveStage, const struct FCrEnviroWaveSettings& WaveSettings, float WaveProgress);
	void ExecuteUbergraph_BP_HabitatPostProcess(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_HabitatPostProcess_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_HabitatPostProcess_C")
	}
	static class ABP_HabitatPostProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HabitatPostProcess_C>();
	}
};
DUMPER7_ASSERTS_ABP_HabitatPostProcess_C;

}

