#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MiningToolActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Chimera_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MiningToolActor.BP_MiningToolActor_C
// 0x0188 (0x0500 - 0x0378)
class ABP_MiningToolActor_C final : public ACrWeaponActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Harvester;                                      // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ForcedCooldownLoopAudio;                           // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MainLaserEnemyHitContinuousAudio;                  // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MainLaserOreMiningContinuousAudio;                 // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MainLaserContinuousAudioStop;                      // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MainLaserContinuousAudioStart;                     // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        WeakSpotLaserAudio;                                // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MainLaserContinuousAudio;                          // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BeamEndPoint;                                      // 0x03C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CurrentHits;                                       // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UCrMiningLockingComponent*              MiningLockingComponent;                            // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Vector4Beam;                                       // 0x03F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCrAsyncTaskEffectStackChanged*         GEStackChangeTaskHandle;                           // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           HeatStackGETag;                                    // 0x0418(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerForStackChangeTaskHandling;                   // 0x0420(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         StackChangeTaskEndingDelay;                        // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               HarvesterDynamicMaterial;                          // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentStackCount;                                 // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HarvesterInputPowerParameter;                      // 0x043C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Stack_Limit;                               // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           OverheatTag;                                       // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OverheatFireRejectSound;                           // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         OldStackCount;                                     // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             OverheatFireRejectSoundTPP;                        // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             BestMomentForReloadBonusSound;                     // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               LEDDynamicMaterial;                                // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bAimingAtHarvestable;                              // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x3];                                      // 0x0479(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   HarvesterPowerFlowParamter;                        // 0x047C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            CurveHeatingUpLEDMaterial;                         // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CurveCoolingDownLEDMaterial;                       // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NewVar;                                            // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCrAsyncTaskGameplayTag*                ListenForBarrelRotatingCosmeticTag;                // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCrAsyncTaskGameplayTag*                ListenForForcedCooldownTag;                        // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCrAsyncTaskGameplayTag*                ListenToAimingAtHarvestableTag;                    // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCrAsyncTaskGameplayTag*                Listen_For_Overheat_Tag;                           // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOverheated;                                      // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFiring;                                          // 0x04C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C2[0x6];                                      // 0x04C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrAsyncTaskGameplayTag*                MiningActiveTask;                                  // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCrAsyncTaskGameplayTag*                IsReloadingTask;                                   // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReloading;                                       // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowCosmeticEffects;                               // 0x04D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA[0x6];                                      // 0x04DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             WeakSpotDepletedMiningBoostGrantedSound;           // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_ListenForGameplayMessage*  ListenForMiningBoostAsyncAction;                   // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_WeaponHeatStack;                                // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  WeaponOwner;                                       // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Activate_NS_Harvester();
	void EmptyHit();
	void ExecuteUbergraph_BP_MiningToolActor(int32 EntryPoint);
	void HittingEnemy();
	void HittingLandscape();
	void HittingNonMineableObject();
	void HittingOre();
	void IsLocallyFPPControlled(bool* bIsLocallyFPPControlled);
	void IsOverheatStackLimitReached(bool* bLimitReached);
	void OnAimingAtHarvestable();
	void OnBarrelRotatingCosmeticTagAdded();
	void OnBarrelRotatingCosmeticTagRemoved();
	void OnBPCameraChanged(bool bIsFirstPersonView);
	void OnBPWeaponPostEquip();
	void OnBPWeaponPreUnequip();
	void OnForcedCooldownEnded();
	void OnForcedCooldownStarted();
	void OnGameplayEffectStackChange_789621C0434093352B54EEB33F956A65(const struct FGameplayTag& EffectGameplayTag, const struct FActiveGameplayEffectHandle& Handle, int32 NewStackCount, int32 OldStackCount_0);
	void OnGameplayEffectStackChange_EAF05B83CE4C1F8287808ABFA3578A9F(const struct FGameplayTag& EffectGameplayTag, const struct FActiveGameplayEffectHandle& Handle, int32 NewStackCount, int32 OldStackCount_0);
	void OnHeatStackChanged(int32 NewStackCount, int32 OldStackCount_0, int32 StackLimit);
	void OnMiningAbilityEnded();
	void OnOwningWeaponItemLoadData();
	void OnSpawnCosmeticEffectsOnFireEnd();
	void OnSpawnCosmeticEffectsOnFireStart();
	void OnSpawnCosmeticEffectsWhileFire(const TArray<struct FHitResult>& Hits);
	void OnTagAdded_31F7E6BC46AB7D9405D41AACAC4260EB(const struct FGameplayTag& Tag);
	void OnTagAdded_5737D9664C9A21CE923F009D2D34FCD7(const struct FGameplayTag& Tag);
	void OnTagAdded_BA0E5E614824F3B67C200C919A766682(const struct FGameplayTag& Tag);
	void OnTagAdded_BA8FAB2B40E07AE362B789A1FB8C5A93(const struct FGameplayTag& Tag);
	void OnTagAdded_CA1E3B4E40A739C944885BB2257B37FF(const struct FGameplayTag& Tag);
	void OnTagAdded_CF8C75C94946EC1AB86D13B6AA01098A(const struct FGameplayTag& Tag);
	void OnTagRemoved_31F7E6BC46AB7D9405D41AACAC4260EB(const struct FGameplayTag& Tag);
	void OnTagRemoved_5737D9664C9A21CE923F009D2D34FCD7(const struct FGameplayTag& Tag);
	void OnTagRemoved_BA0E5E614824F3B67C200C919A766682(const struct FGameplayTag& Tag);
	void OnTagRemoved_BA8FAB2B40E07AE362B789A1FB8C5A93(const struct FGameplayTag& Tag);
	void OnTagRemoved_CA1E3B4E40A739C944885BB2257B37FF(const struct FGameplayTag& Tag);
	void OnTagRemoved_CF8C75C94946EC1AB86D13B6AA01098A(const struct FGameplayTag& Tag);
	void OnWeakSpotDepletedMiningBoostGranted();
	void OnWeaponInstanceDataReplicated();
	void PlayAudioComponentSound(class UAudioComponent*& InAudioComponent, class USoundBase*& InFPPSample, class USoundBase*& InTPPSample);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MiningToolActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MiningToolActor_C")
	}
	static class ABP_MiningToolActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MiningToolActor_C>();
	}
};
DUMPER7_ASSERTS_ABP_MiningToolActor_C;

}

