#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Walkway

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Walkway.BP_Walkway_C
// 0x0080 (0x0708 - 0x0688)
class ABP_Walkway_C final : public ACrModularRampWalkway
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        LadderAngle_0;                                     // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StairsAngle_0;                                     // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class AActor*, double>                   WalkableAnglePerCharacter;                         // 0x06A0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          IsNarrow;                                          // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F1[0x7];                                      // 0x06F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DesiredSectionLength_0;                            // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SectionLength_0;                                   // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool CanBePooled();
	void ExecuteUbergraph_BP_Walkway(int32 EntryPoint);
	double GetRampAngle();
	bool IsLadder();
	bool IsRamp();
	void OnSplineReady(class USplineComponent* InSpline);
	void PrepareForGame();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Walkway_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Walkway_C")
	}
	static class ABP_Walkway_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Walkway_C>();
	}
};
DUMPER7_ASSERTS_ABP_Walkway_C;

}

