#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_Checkbox

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPW_Checkbox.BPW_Checkbox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPW_Checkbox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPW_Checkbox_C_PreConstruct;

// Function BPW_Checkbox.BPW_Checkbox_C.ExecuteUbergraph_BPW_Checkbox
// 0x0008 (0x0008 - 0x0000)
struct BPW_Checkbox_C_ExecuteUbergraph_BPW_Checkbox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPW_Checkbox_C_ExecuteUbergraph_BPW_Checkbox;

// Function BPW_Checkbox.BPW_Checkbox_C.BndEvt__BPW_Checkbox_chk_val_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BPW_Checkbox_C_BndEvt__BPW_Checkbox_chk_val_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPW_Checkbox_C_BndEvt__BPW_Checkbox_chk_val_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature;

}

