#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChimeraUI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Chimera_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum ChimeraUI.ECrWidgetInputMode
// NumValues: 0x0005
enum class ECrWidgetInputMode : uint8
{
	Default                                  = 0,
	GameAndMenu                              = 1,
	Game                                     = 2,
	Menu                                     = 3,
	ECrWidgetInputMode_MAX                   = 4,
};

// Enum ChimeraUI.EServerManagementState
// NumValues: 0x0012
enum class EServerManagementState : uint8
{
	Disconnected                             = 0,
	WaitingForConnection                     = 1,
	WaitingForPassword                       = 2,
	EnterPassword                            = 3,
	Connected                                = 4,
	SelectNewOrLoadGame                      = 5,
	NewGame                                  = 6,
	StartingNewSession                       = 7,
	LoadGame                                 = 8,
	WaitingForSessions                       = 9,
	WaitingForPlayerPasswordPresent          = 10,
	WaitingForSessionsNewGame                = 11,
	WaitingForSessionSaves                   = 12,
	LoadingSavedSession                      = 13,
	WaitingForResponse                       = 14,
	Initial                                  = 15,
	ErrorTimeout                             = 16,
	EServerManagementState_MAX               = 17,
};

// Enum ChimeraUI.EUIAction
// NumValues: 0x0005
enum class EUIAction : uint8
{
	LoadGame                                 = 0,
	NewGame                                  = 1,
	IPTyped                                  = 2,
	SetPlayerPassword                        = 3,
	EUIAction_MAX                            = 4,
};

// Enum ChimeraUI.ECrStorageLevel
// NumValues: 0x0005
enum class ECrStorageLevel : uint8
{
	StorageLvl1                              = 0,
	StorageLvl2                              = 1,
	StorageAdjustableSize                    = 2,
	None                                     = 3,
	ECrStorageLevel_MAX                      = 4,
};

// Enum ChimeraUI.EUIAudioSoundType
// NumValues: 0x0029
enum class EUIAudioSoundType : uint8
{
	CommonAccept                             = 0,
	CommonHover                              = 1,
	CommonPick                               = 2,
	CommonPlace                              = 3,
	CommonOpen                               = 4,
	CommonClose                              = 5,
	CommonAcceptHardCue                      = 6,
	AnalyzerClaim                            = 7,
	AnalyzerInsert                           = 8,
	RecyclerClaim                            = 9,
	RTAddPointsLvlUp                         = 10,
	RTAddPoints                              = 11,
	RTClaimReward                            = 12,
	SuitWorkshopChangeLEM                    = 13,
	RecipeTableUnlock                        = 14,
	ExporterRecipeChosen                     = 15,
	ExporterSendItem                         = 16,
	ExporterExpAdded                         = 17,
	ExporterInsertItem                       = 18,
	ArmoryUnlockingLoop                      = 19,
	ArmoryUnlock                             = 20,
	ArmoryChoose                             = 21,
	ArmoryConfirm                            = 22,
	ArmoryClicked                            = 23,
	ArmoryHovered                            = 24,
	CorpLevelUp                              = 25,
	SliderValueChanged                       = 26,
	BaseCoreDeconstructionProgress           = 27,
	DatapadEnter                             = 28,
	DatapadQuit                              = 29,
	DatapadComputerEnter                     = 30,
	DatapadComputerQuit                      = 31,
	CrafterInteriorCreatedItem               = 32,
	InventoryDropIeam                        = 33,
	MainMenuHover                            = 34,
	MainMenuAccept                           = 35,
	MainMenuCancel                           = 36,
	SessionBoxExpand                         = 37,
	FoodProcessorRecipeCrafted               = 38,
	None                                     = 39,
	EUIAudioSoundType_MAX                    = 40,
};

// Enum ChimeraUI.EUIWidgetType
// NumValues: 0x0026
enum class EUIWidgetType : uint8
{
	Crafting                                 = 0,
	CrafterInterior                          = 1,
	Analyzing                                = 2,
	RecipeList                               = 3,
	BuildingDetails                          = 4,
	Extracting                               = 5,
	Storing                                  = 6,
	Inventory                                = 7,
	Story                                    = 8,
	Skills                                   = 9,
	Weapons                                  = 10,
	GeneratingPower                          = 11,
	Turrent                                  = 12,
	BaseCoreDeconstruction                   = 13,
	BaseCoreUpgrade                          = 14,
	BaseCoreBaseInfo                         = 15,
	Recycling                                = 16,
	Exporting                                = 17,
	ExportingSelection                       = 18,
	FEDoors                                  = 19,
	SuitWorkshop                             = 20,
	UniversalStorage                         = 21,
	Distributing                             = 22,
	ItemsList                                = 23,
	PackageSender                            = 24,
	PackageReceiver                          = 25,
	ReceiversList                            = 26,
	PauseMenuMain                            = 27,
	MenuMap                                  = 28,
	MenuCodex                                = 29,
	MenuOptions                              = 30,
	MainMenu                                 = 31,
	PauseMenu                                = 32,
	PlaytestEndVideo                         = 33,
	TeleportersList                          = 34,
	Cooler                                   = 35,
	None                                     = 36,
	EUIWidgetType_MAX                        = 37,
};

// Enum ChimeraUI.ECrUIInputActionType
// NumValues: 0x0010
enum class ECrUIInputActionType : uint8
{
	Sorting                                  = 0,
	PickAll                                  = 1,
	Split                                    = 2,
	TransferAll                              = 3,
	Info                                     = 4,
	ToggleTurnOn                             = 5,
	Consume                                  = 6,
	Drop                                     = 7,
	ResizeStack                              = 8,
	ResizeStackSender                        = 9,
	Apply                                    = 10,
	Back                                     = 11,
	BackConfirmation                         = 12,
	Cancel                                   = 13,
	RestoreDefaults                          = 14,
	ECrUIInputActionType_MAX                 = 15,
};

// Enum ChimeraUI.ECrMenuType
// NumValues: 0x0014
enum class ECrMenuType : uint8
{
	Continue                                 = 0,
	PauseMenu                                = 1,
	Map                                      = 2,
	Codex                                    = 3,
	Save                                     = 4,
	Load                                     = 5,
	Options                                  = 6,
	QuitToMainMenu                           = 7,
	Quit                                     = 8,
	None                                     = 9,
	OptionsChanged                           = 10,
	OptionsUnchanged                         = 11,
	ContinueGame                             = 12,
	JoinGame                                 = 13,
	Credits                                  = 14,
	NewGame                                  = 15,
	ManageServer                             = 16,
	MainMenu                                 = 17,
	JoinMenuClose                            = 18,
	ECrMenuType_MAX                          = 19,
};

// Enum ChimeraUI.EArmoryWidgetTab
// NumValues: 0x0006
enum class EArmoryWidgetTab : uint8
{
	WeaponSlot1                              = 0,
	WeaponSlot2                              = 1,
	MiningTool                               = 2,
	Grenade                                  = 3,
	Medtool                                  = 4,
	EArmoryWidgetTab_MAX                     = 5,
};

// Enum ChimeraUI.ECrBaseCoreCostRequirementInsertState
// NumValues: 0x0005
enum class ECrBaseCoreCostRequirementInsertState : uint8
{
	Hidden                                   = 0,
	Colapsed                                 = 1,
	InsertEnabled                            = 2,
	InsertDisabled                           = 3,
	ECrBaseCoreCostRequirementInsertState_MAX = 4,
};

// Enum ChimeraUI.ECrBaseCoreCostRequirementState
// NumValues: 0x0004
enum class ECrBaseCoreCostRequirementState : uint8
{
	ItemsAvailable                           = 0,
	ItemsUnavailable                         = 1,
	CostFulfilled                            = 2,
	ECrBaseCoreCostRequirementState_MAX      = 3,
};

// Enum ChimeraUI.EChoosingLevelButtonState
// NumValues: 0x0004
enum class EChoosingLevelButtonState : uint8
{
	Normal                                   = 0,
	EnableActivated                          = 1,
	LevelSelected                            = 2,
	EChoosingLevelButtonState_MAX            = 3,
};

// Enum ChimeraUI.ECrChatHudState
// NumValues: 0x0007
enum class ECrChatHudState : uint8
{
	Showing                                  = 0,
	Visible                                  = 1,
	Typing                                   = 2,
	WaitingForHide                           = 3,
	Hiding                                   = 4,
	Hidden                                   = 5,
	ECrChatHudState_MAX                      = 6,
};

// Enum ChimeraUI.ECrDeathScreenCloningBedState
// NumValues: 0x0004
enum class ECrDeathScreenCloningBedState : uint8
{
	Normal                                   = 0,
	NotSet                                   = 1,
	Infected                                 = 2,
	ECrDeathScreenCloningBedState_MAX        = 3,
};

// Enum ChimeraUI.ECrEffectHudType
// NumValues: 0x0008
enum class ECrEffectHudType : uint64
{
	Unknown                                  = 18446744073709551615,
	Hydration                                = 0,
	Toxicity                                 = 1,
	Calories                                 = 2,
	Temperature                              = 3,
	Radiation                                = 4,
	_Count                                   = 5,
	ECrEffectHudType_MAX                     = 6,
};

// Enum ChimeraUI.ECrEffectHudLevel
// NumValues: 0x0004
enum class ECrEffectHudLevel : uint8
{
	Low                                      = 0,
	Medium                                   = 1,
	High                                     = 2,
	ECrEffectHudLevel_MAX                    = 3,
};

// Enum ChimeraUI.EArmorySlotState
// NumValues: 0x0009
enum class EArmorySlotState : uint8
{
	Locked                                   = 0,
	LockedAffordable                         = 1,
	Unlocked                                 = 2,
	UnlockedAffordable                       = 3,
	Used                                     = 4,
	Main                                     = 5,
	MainChanged                              = 6,
	MainSelected                             = 7,
	EArmorySlotState_MAX                     = 8,
};

// Enum ChimeraUI.ETabIcon
// NumValues: 0x0004
enum class ETabIcon : uint8
{
	Inventory                                = 0,
	Skills                                   = 1,
	Other                                    = 2,
	ETabIcon_MAX                             = 3,
};

// Enum ChimeraUI.ECrUIWindowMode
// NumValues: 0x0006
enum class ECrUIWindowMode : uint8
{
	Split                                    = 0,
	ResizeStack                              = 1,
	ResizeStackSender                        = 2,
	Default                                  = 3,
	None                                     = 4,
	ECrUIWindowMode_MAX                      = 5,
};

// Enum ChimeraUI.ECrMapMenuMarkerType
// NumValues: 0x0012
enum class ECrMapMenuMarkerType : uint8
{
	Quest                                    = 0,
	Player                                   = 1,
	Coop                                     = 2,
	Building                                 = 3,
	Enemy                                    = 4,
	Resource                                 = 5,
	AbandonedBase                            = 6,
	PointOfInterst                           = 7,
	Tample                                   = 8,
	Crypt                                    = 9,
	PlayerDeathSpot                          = 10,
	Other                                    = 11,
	PlayerPersonalMarker                     = 12,
	PlayerSharedMarker                       = 13,
	Footstep                                 = 14,
	AttackSpawner                            = 15,
	AttackWave                               = 16,
	ECrMapMenuMarkerType_MAX                 = 17,
};

// Enum ChimeraUI.EMessageState
// NumValues: 0x0005
enum class EMessageState : uint8
{
	Unread                                   = 0,
	Hovered                                  = 1,
	CurrentlyReading                         = 2,
	Read                                     = 3,
	EMessageState_MAX                        = 4,
};

// Enum ChimeraUI.ECrMessageHudType
// NumValues: 0x000E
enum class ECrMessageHudType : uint64
{
	Unknown                                  = 18446744073709551615,
	Hydration                                = 0,
	Toxicity                                 = 1,
	Calories                                 = 2,
	Temperature                              = 3,
	NextWave                                 = 4,
	WaveWarning                              = 5,
	BaseUnderAttack                          = 6,
	BaseAttackBaseCoreLost                   = 7,
	BaseAttackBaseCoreSecured                = 8,
	RadiationLevelChanged                    = 9,
	BuildingDroneWarning                     = 10,
	_Count                                   = 11,
	ECrMessageHudType_MAX                    = 12,
};

// Enum ChimeraUI.ECrMessageHudImportance
// NumValues: 0x0006
enum class ECrMessageHudImportance : uint32
{
	Base                                     = 0,
	Normal                                   = 1,
	High                                     = 2,
	Critical                                 = 3,
	Highlight                                = 4,
	ECrMessageHudImportance_MAX              = 5,
};

// Enum ChimeraUI.ECrPlayerParamsHudType
// NumValues: 0x0004
enum class ECrPlayerParamsHudType : uint8
{
	Hydration                                = 0,
	Toxicity                                 = 1,
	Calories                                 = 2,
	ECrPlayerParamsHudType_MAX               = 3,
};

// Enum ChimeraUI.ECrSlotType
// NumValues: 0x0006
enum class ECrSlotType : uint8
{
	None                                     = 0,
	Occupied                                 = 1,
	Add                                      = 2,
	Empty                                    = 3,
	Autosave                                 = 4,
	ECrSlotType_MAX                          = 5,
};

// Enum ChimeraUI.ECrToolPanelState
// NumValues: 0x0005
enum class ECrToolPanelState : uint8
{
	Tool                                     = 0,
	Grenage                                  = 1,
	Health                                   = 2,
	BuildingTool                             = 3,
	ECrToolPanelState_MAX                    = 4,
};

// Enum ChimeraUI.EWeaponWheelSlotInfoType
// NumValues: 0x0006
enum class EWeaponWheelSlotInfoType : uint8
{
	Empty                                    = 0,
	Infinite                                 = 1,
	AmmoCount                                = 2,
	Granade                                  = 3,
	MedTool                                  = 4,
	EWeaponWheelSlotInfoType_MAX             = 5,
};

// Enum ChimeraUI.EAttributeType
// NumValues: 0x0008
enum class EAttributeType : uint8
{
	Health                                   = 0,
	Shield                                   = 1,
	Hydration                                = 2,
	Toxicity                                 = 3,
	Calories                                 = 4,
	Oxygen                                   = 5,
	Energy                                   = 6,
	EAttributeType_MAX                       = 7,
};

// Enum ChimeraUI.SoundToPlay
// NumValues: 0x0006
enum class ESoundToPlay : uint8
{
	Back                                     = 0,
	Apply                                    = 1,
	Cancel                                   = 2,
	ConfirmYes                               = 3,
	ConfirmNo                                = 4,
	SoundToPlay_MAX                          = 5,
};

// ScriptStruct ChimeraUI.CrTerrainSegmentData
// 0x00C0 (0x00C0 - 0x0000)
struct FCrTerrainSegmentData final
{
public:
	struct FIntPoint                              TerrainSegmentGridIndex;                           // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            TerrainSegmentTexture;                             // 0x0010(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrTerrainSegmentData;

// ScriptStruct ChimeraUI.CrMenuConfig
// 0x0040 (0x0040 - 0x0000)
struct FCrMenuConfig final
{
public:
	ECrMenuType                                   MenuType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         WidgetClass;                                       // 0x0008(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0028(0x0010)(Edit, NativeAccessSpecifierPublic)
	bool                                          bOverridesBehaviour;                               // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrMenuConfig;

// ScriptStruct ChimeraUI.CrTabDescriptor
// 0x00F0 (0x00F0 - 0x0000)
struct FCrTabDescriptor final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   TabText;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            IconBrush;                                         // 0x0020(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bHidden;                                           // 0x00D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonButtonBase>          TabButtonType;                                     // 0x00D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonUserWidget>          TabContentType;                                    // 0x00E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                CreatedTabContentWidget;                           // 0x00E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FCrTabDescriptor;

// ScriptStruct ChimeraUI.CrWidgetData
// 0x0058 (0x0058 - 0x0000)
struct FCrWidgetData final
{
public:
	EUIWidgetType                                 WidgetType;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ECrBuildingState, class FText>           BuildingStatus;                                    // 0x0008(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrWidgetData;

// ScriptStruct ChimeraUI.CrCraftingRecipeContentForUI
// 0x00D0 (0x00D0 - 0x0000)
struct FCrCraftingRecipeContentForUI final
{
public:
	struct FSlateBrush                            ItemIcon;                                          // 0x0000(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   ItemName;                                          // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         ItemAmount;                                        // 0x00C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrCraftingRecipeContentForUI;

// ScriptStruct ChimeraUI.CrCorporationContentForUI
// 0x00D0 (0x00D0 - 0x0000)
struct FCrCorporationContentForUI final
{
public:
	struct FSlateBrush                            CorporationIcon;                                   // 0x0000(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   CorporationName;                                   // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         NextLevel;                                         // 0x00C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LevelProgress;                                     // 0x00C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrCorporationContentForUI;

// ScriptStruct ChimeraUI.CrMarkerFilterApperance
// 0x0120 (0x0120 - 0x0000)
struct FCrMarkerFilterApperance final
{
public:
	ECrMapMenuMarkerFilter                        Filter;                                            // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<ECrMapMenuMarkerFilter>                  SubFilters;                                        // 0x0008(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          PlayerAvailable;                                   // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RightShift;                                        // 0x0059(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TopSpace;                                          // 0x005A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FilterName;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FilterIcon;                                        // 0x0070(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrMarkerFilterApperance;

// ScriptStruct ChimeraUI.CrTerrainMipMapByZoomValueData
// 0x0008 (0x0008 - 0x0000)
struct FCrTerrainMipMapByZoomValueData final
{
public:
	float                                         MaximalZoomValue;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MipMap;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrTerrainMipMapByZoomValueData;

// ScriptStruct ChimeraUI.CrStatusIconData
// 0x00C0 (0x00C0 - 0x0000)
struct FCrStatusIconData final
{
public:
	struct FGameplayTag                           StatusTag;                                         // 0x0000(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            StatusIcon;                                        // 0x0010(0x00B0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrStatusIconData;

// ScriptStruct ChimeraUI.CrAlienObeliskWarningTickFunction
// 0x0008 (0x0030 - 0x0028)
struct FCrAlienObeliskWarningTickFunction final : public FTickFunction
{
public:
	class UCrUW_AlienObeliskWarning*              AlienObeliskWarning;                               // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
};
DUMPER7_ASSERTS_FCrAlienObeliskWarningTickFunction;

// ScriptStruct ChimeraUI.CrAttrWarningIconPreset
// 0x00C0 (0x00C0 - 0x0000)
struct FCrAttrWarningIconPreset final
{
public:
	struct FSlateBrush                            IconBrush;                                         // 0x0000(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	ESlateVisibility                              Visibility;                                        // 0x00B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0xF];                                       // 0x00B1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrAttrWarningIconPreset;

// ScriptStruct ChimeraUI.CrAttrWarningIconTagPresetPair
// 0x00D0 (0x00D0 - 0x0000)
struct FCrAttrWarningIconTagPresetPair final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCrAttrWarningIconPreset               Preset;                                            // 0x0010(0x00C0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAttrWarningIconTagPresetPair;

// ScriptStruct ChimeraUI.BarChildData
// 0x0020 (0x0020 - 0x0000)
struct FBarChildData final
{
public:
	class UCrUW_ParamBarHud*                      Bar;                                               // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UCanvasPanelSlot*                       PanelSlot;                                         // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBarChildData;

// ScriptStruct ChimeraUI.CrCheatTabWidgetDef
// 0x0048 (0x0048 - 0x0000)
struct FCrCheatTabWidgetDef final
{
public:
	TSoftClassPtr<class UClass>                   CategoryClass;                                     // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CategoryName;                                      // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrCheatTabWidgetDef;

// ScriptStruct ChimeraUI.NameContextPair
// 0x0020 (0x0020 - 0x0000)
struct FNameContextPair final
{
public:
	class FText                                   Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class UInputMappingContext*>           Contexts;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FNameContextPair;

// ScriptStruct ChimeraUI.EffectHudData
// 0x0010 (0x0010 - 0x0000)
struct FEffectHudData final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FEffectHudData;

// ScriptStruct ChimeraUI.FoodEffectData
// 0x00E0 (0x00E0 - 0x0000)
struct FFoodEffectData final
{
public:
	TSubclassOf<class UCrGameplayEffect>          GameplayEffect;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Icon;                                              // 0x0010(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x00C0(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x00D0(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFoodEffectData;

// ScriptStruct ChimeraUI.FoodActiveEffect
// 0x00F0 (0x00F0 - 0x0000)
struct alignas(0x10) FFoodActiveEffect final
{
public:
	uint8                                         Pad_0[0xF0];                                       // 0x0000(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFoodActiveEffect;

// ScriptStruct ChimeraUI.CrHitReactionData
// 0x0010 (0x0010 - 0x0000)
struct FCrHitReactionData final
{
public:
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 Color;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrHitReactionData;

// ScriptStruct ChimeraUI.CrHitIndicatorObject
// 0x0058 (0x0058 - 0x0000)
struct FCrHitIndicatorObject final
{
public:
	class UUserWidget*                            HitObject;                                         // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	struct FVector2D                              Direction;                                         // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x38];                                      // 0x0018(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       HitCanvasSlot;                                     // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FCrHitIndicatorObject;

// ScriptStruct ChimeraUI.InfectionMarkerUIRepresentation
// 0x0018 (0x0018 - 0x0000)
struct FInfectionMarkerUIRepresentation final
{
public:
	class UCrUW_MapMenuMarker*                    Marker;                                            // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FInfectionMarkerUIRepresentation;

// ScriptStruct ChimeraUI.EntityMarkerUIRepresentation
// 0x0008 (0x0008 - 0x0000)
struct FEntityMarkerUIRepresentation final
{
public:
	class UCrUW_MapMenuMarker*                    Marker;                                            // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FEntityMarkerUIRepresentation;

// ScriptStruct ChimeraUI.CoopMarkerUIRepresentation
// 0x0008 (0x0008 - 0x0000)
struct FCoopMarkerUIRepresentation final
{
public:
	class UCrUW_MapMenuMarker*                    Marker;                                            // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FCoopMarkerUIRepresentation;

// ScriptStruct ChimeraUI.POIMarkerUIRepresentation
// 0x0010 (0x0010 - 0x0000)
struct FPOIMarkerUIRepresentation final
{
public:
	class UCrUW_MapMenuMarker*                    Marker;                                            // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TWeakObjectPtr<class AActor>                  POIActor;                                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPOIMarkerUIRepresentation;

// ScriptStruct ChimeraUI.PersonalMarkerUIRepresentation
// 0x0018 (0x0018 - 0x0000)
struct FPersonalMarkerUIRepresentation final
{
public:
	class UCrUW_MapMenuMarker*                    Marker;                                            // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class FString                                 PlayerName;                                        // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPersonalMarkerUIRepresentation;

// ScriptStruct ChimeraUI.AttackWaveMarkerUIRepresentation
// 0x0010 (0x0010 - 0x0000)
struct FAttackWaveMarkerUIRepresentation final
{
public:
	class UCrUW_MapMenuMarker*                    Marker;                                            // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAttackWaveMarkerUIRepresentation;

// ScriptStruct ChimeraUI.CrMarkerMalfunctionIcon
// 0x00D0 (0x00D0 - 0x0000)
struct FCrMarkerMalfunctionIcon final
{
public:
	ECrBuildingMalfunctionFlags                   MalfunctionFlag;                                   // 0x0000(0x0002)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 MarkerColor;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            FilterIcon;                                        // 0x0010(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         MalfunctionAdditionalPriority;                     // 0x00C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrMarkerMalfunctionIcon;

// ScriptStruct ChimeraUI.CrMessageHUDImportance
// 0x0038 (0x0038 - 0x0000)
struct FCrMessageHUDImportance final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECrMessageHudImportance                       Importance;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           IconColor;                                         // 0x000C(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HudWarningMessageText;                             // 0x0020(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bIconBlink;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrMessageHUDImportance;

// ScriptStruct ChimeraUI.MessageData
// 0x0050 (0x0050 - 0x0000)
struct FMessageData final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrUW_MessageHud*                       Message;                                           // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UCanvasPanelSlot*                       CanvasPanelSlot;                                   // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMessageData;

// ScriptStruct ChimeraUI.NotificationData
// 0x0030 (0x0030 - 0x0000)
struct FNotificationData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrUW_NotificationHud*                  Notification;                                      // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UCanvasPanelSlot*                       CanvasPanelSlot;                                   // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNotificationData;

// ScriptStruct ChimeraUI.CrSubObjectiveUIData
// 0x0030 (0x0030 - 0x0000)
struct FCrSubObjectiveUIData final
{
public:
	bool                                          bCompleted;                                        // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name;                                              // 0x0008(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         CurrentValue;                                      // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConditionalValue;                                  // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldShowCounter;                                // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrUW_SubObjectiveEntry*                SubObjectiveWidget;                                // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FCrSubObjectiveUIData;

// ScriptStruct ChimeraUI.CrObjectiveUIData
// 0x0078 (0x0078 - 0x0000)
struct FCrObjectiveUIData final
{
public:
	class FText                                   ObjectiveName;                                     // 0x0000(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bObjectiveCompleted;                               // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCrSubObjectiveUIData>          SubObjectives;                                     // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class FText>                           Tips;                                              // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UTexture2D*                             Image;                                             // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          bShowCounter;                                      // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x37];                                      // 0x0041(0x0037)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrObjectiveUIData;

// ScriptStruct ChimeraUI.PlayerParamHudData
// 0x0038 (0x0038 - 0x0000)
struct FPlayerParamHudData final
{
public:
	class UCrPlayerParamHudData*                  ParamData;                                         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UImage*                                 Icon;                                              // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_10[0x28];                                      // 0x0010(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPlayerParamHudData;

// ScriptStruct ChimeraUI.CrMinimalSaveData
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FCrMinimalSaveData final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCrMinimalSaveData;

// ScriptStruct ChimeraUI.CrItemDataForUI
// 0x0008 (0x0008 - 0x0000)
struct FCrItemDataForUI final
{
public:
	class UAuItemDataBase*                        Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FCrItemDataForUI;

// ScriptStruct ChimeraUI.CrItemGroupForUI
// 0x0020 (0x0020 - 0x0000)
struct FCrItemGroupForUI final
{
public:
	class FText                                   Name;                                              // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	TArray<struct FCrItemDataForUI>               Items;                                             // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrItemGroupForUI;

// ScriptStruct ChimeraUI.CrAllItemsForUI
// 0x0010 (0x0010 - 0x0000)
struct FCrAllItemsForUI final
{
public:
	TArray<struct FCrItemGroupForUI>              Groups;                                            // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrAllItemsForUI;

// ScriptStruct ChimeraUI.CrSurvivalStat
// 0x0028 (0x0028 - 0x0000)
struct FCrSurvivalStat final
{
public:
	EAttributeType                                Attribute;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrSurvivalStat;

// ScriptStruct ChimeraUI.CrHUDLayoutRequest
// 0x0030 (0x0030 - 0x0000)
struct FCrHUDLayoutRequest final
{
public:
	TSoftClassPtr<class UClass>                   LayoutClass;                                       // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           LayerID;                                           // 0x0028(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrHUDLayoutRequest;

// ScriptStruct ChimeraUI.CrHUDElementEntry
// 0x0030 (0x0030 - 0x0000)
struct FCrHUDElementEntry final
{
public:
	TSoftClassPtr<class UClass>                   WidgetClass;                                       // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SlotID;                                            // 0x0028(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrHUDElementEntry;

}

