#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BuildingRotatedChanged

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.ExecuteUbergraph_GA_BuildingRotatedChanged
// 0x02C0 (0x02C0 - 0x0000)
struct GA_BuildingRotatedChanged_C_ExecuteUbergraph_GA_BuildingRotatedChanged final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0090(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCrAbilityTask_PlayMontage*             CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00E8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x0108(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x0128(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0148(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0168(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0188(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x01A8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCrAbilityTask_PlayMontage*             CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x01D8(0x00B0)(ConstParm)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_293[0x5];                                      // 0x0293(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x0298(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_ExecuteUbergraph_GA_BuildingRotatedChanged;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_BuildingRotatedChanged_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_K2_ActivateAbilityFromEvent;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnCancelled_86085C444B12C5366ABBCFB0B501941C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnCancelled_86085C444B12C5366ABBCFB0B501941C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnCancelled_86085C444B12C5366ABBCFB0B501941C;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnCancelled_DF949AEA4A3B633918EEA8A773F045A1
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnCancelled_DF949AEA4A3B633918EEA8A773F045A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnCancelled_DF949AEA4A3B633918EEA8A773F045A1;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnFppMontageBlendOut_86085C444B12C5366ABBCFB0B501941C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnFppMontageBlendOut_86085C444B12C5366ABBCFB0B501941C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnFppMontageBlendOut_86085C444B12C5366ABBCFB0B501941C;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnFppMontageBlendOut_DF949AEA4A3B633918EEA8A773F045A1
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnFppMontageBlendOut_DF949AEA4A3B633918EEA8A773F045A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnFppMontageBlendOut_DF949AEA4A3B633918EEA8A773F045A1;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnFppMontageEnded_86085C444B12C5366ABBCFB0B501941C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnFppMontageEnded_86085C444B12C5366ABBCFB0B501941C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnFppMontageEnded_86085C444B12C5366ABBCFB0B501941C;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnFppMontageEnded_DF949AEA4A3B633918EEA8A773F045A1
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnFppMontageEnded_DF949AEA4A3B633918EEA8A773F045A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnFppMontageEnded_DF949AEA4A3B633918EEA8A773F045A1;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnFppMontageNotifyBegin_86085C444B12C5366ABBCFB0B501941C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnFppMontageNotifyBegin_86085C444B12C5366ABBCFB0B501941C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnFppMontageNotifyBegin_86085C444B12C5366ABBCFB0B501941C;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnFppMontageNotifyBegin_DF949AEA4A3B633918EEA8A773F045A1
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnFppMontageNotifyBegin_DF949AEA4A3B633918EEA8A773F045A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnFppMontageNotifyBegin_DF949AEA4A3B633918EEA8A773F045A1;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnFppMontageNotifyEnd_86085C444B12C5366ABBCFB0B501941C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnFppMontageNotifyEnd_86085C444B12C5366ABBCFB0B501941C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnFppMontageNotifyEnd_86085C444B12C5366ABBCFB0B501941C;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnFppMontageNotifyEnd_DF949AEA4A3B633918EEA8A773F045A1
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnFppMontageNotifyEnd_DF949AEA4A3B633918EEA8A773F045A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnFppMontageNotifyEnd_DF949AEA4A3B633918EEA8A773F045A1;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnInterrupted_86085C444B12C5366ABBCFB0B501941C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnInterrupted_86085C444B12C5366ABBCFB0B501941C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnInterrupted_86085C444B12C5366ABBCFB0B501941C;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnInterrupted_DF949AEA4A3B633918EEA8A773F045A1
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnInterrupted_DF949AEA4A3B633918EEA8A773F045A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnInterrupted_DF949AEA4A3B633918EEA8A773F045A1;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnNotLocallyControlledTppMontageBlendOut_86085C444B12C5366ABBCFB0B501941C
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnNotLocallyControlledTppMontageBlendOut_86085C444B12C5366ABBCFB0B501941C final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnNotLocallyControlledTppMontageBlendOut_86085C444B12C5366ABBCFB0B501941C;

// Function GA_BuildingRotatedChanged.GA_BuildingRotatedChanged_C.OnNotLocallyControlledTppMontageBlendOut_DF949AEA4A3B633918EEA8A773F045A1
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingRotatedChanged_C_OnNotLocallyControlledTppMontageBlendOut_DF949AEA4A3B633918EEA8A773F045A1 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingRotatedChanged_C_OnNotLocallyControlledTppMontageBlendOut_DF949AEA4A3B633918EEA8A773F045A1;

}

