#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BuildingToolTryDestruct

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AuAbilities_structs.hpp"
#include "Chimera_structs.hpp"
#include "Chimera_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_BuildingToolTryDestruct.GA_BuildingToolTryDestruct_C
// 0x0170 (0x0678 - 0x0508)
class UGA_BuildingToolTryDestruct_C final : public UCrGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ACrBuildingActorBase*                   CurrentBuilding;                                   // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAuCustomTraceDataHandle               LineTraceData;                                     // 0x0518(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAuCustomTargetHandle                  LineTraceHandle;                                   // 0x0530(0x0001)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAuTraceDebugParams                    DebugParams;                                       // 0x0534(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentTimer;                                      // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DestructionTime;                                   // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bActorUnchanged;                                   // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DeltaTime;                                         // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastTime;                                          // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BuildingHitTag;                                    // 0x0568(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 HitActor;                                          // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DefaultDeconstructionTime;                         // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DeconstructionTimeMultiplier;                      // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACrBuildingActorBase*                   LastBuilding;                                      // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ContinuousTag;                                     // 0x05A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  AcceleratedTag;                                    // 0x05C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  AccelerationRequiredTags;                          // 0x05E8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        AcceleratedDeconstructionTime;                     // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  SimulatingTag;                                     // 0x0610(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  ActiveTag;                                         // 0x0630(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAuAT_WaitWeaponAutoFire*               WaitWeaponAutoFireTask;                            // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  SwitchingTag;                                      // 0x0658(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CheckCurrentDeconstructible();
	void ExecuteUbergraph_GA_BuildingToolTryDestruct(int32 EntryPoint);
	void HandleWaitWeaponAutoFire();
	void IsDeconstructing(bool* bIsDestructing);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnCancelled_4FFC720C47262CC8D8ADA2BDC5215533(class FName NotifyName);
	void OnCancelled_96F23B314B5A61A0E88807A9E9DA9C03(class FName NotifyName);
	void OnCancelled_F21EFFC44529F02450B4DE9156EE9A49(class FName NotifyName);
	void OnCostCheckFailed_D8AF7A034B4750C921EA778EFD08A258(float TimeHeld, bool bEnded);
	void OnEnded_D8AF7A034B4750C921EA778EFD08A258(float TimeHeld, bool bEnded);
	void OnFppMontageBlendOut_4FFC720C47262CC8D8ADA2BDC5215533(class FName NotifyName);
	void OnFppMontageBlendOut_96F23B314B5A61A0E88807A9E9DA9C03(class FName NotifyName);
	void OnFppMontageBlendOut_F21EFFC44529F02450B4DE9156EE9A49(class FName NotifyName);
	void OnFppMontageEnded_4FFC720C47262CC8D8ADA2BDC5215533(class FName NotifyName);
	void OnFppMontageEnded_96F23B314B5A61A0E88807A9E9DA9C03(class FName NotifyName);
	void OnFppMontageEnded_F21EFFC44529F02450B4DE9156EE9A49(class FName NotifyName);
	void OnFppMontageNotifyBegin_4FFC720C47262CC8D8ADA2BDC5215533(class FName NotifyName);
	void OnFppMontageNotifyBegin_96F23B314B5A61A0E88807A9E9DA9C03(class FName NotifyName);
	void OnFppMontageNotifyBegin_F21EFFC44529F02450B4DE9156EE9A49(class FName NotifyName);
	void OnFppMontageNotifyEnd_4FFC720C47262CC8D8ADA2BDC5215533(class FName NotifyName);
	void OnFppMontageNotifyEnd_96F23B314B5A61A0E88807A9E9DA9C03(class FName NotifyName);
	void OnFppMontageNotifyEnd_F21EFFC44529F02450B4DE9156EE9A49(class FName NotifyName);
	void OnInterrupted_4FFC720C47262CC8D8ADA2BDC5215533(class FName NotifyName);
	void OnInterrupted_96F23B314B5A61A0E88807A9E9DA9C03(class FName NotifyName);
	void OnInterrupted_F21EFFC44529F02450B4DE9156EE9A49(class FName NotifyName);
	void OnNotLocallyControlledTppMontageBlendOut_4FFC720C47262CC8D8ADA2BDC5215533(class FName NotifyName);
	void OnNotLocallyControlledTppMontageBlendOut_96F23B314B5A61A0E88807A9E9DA9C03(class FName NotifyName);
	void OnNotLocallyControlledTppMontageBlendOut_F21EFFC44529F02450B4DE9156EE9A49(class FName NotifyName);
	void OnRelease_D8AF7A034B4750C921EA778EFD08A258(float TimeHeld, bool bEnded);
	void OnTagAdded_9B2ED9024EE16E51685A32BC28A7B623(const struct FGameplayTag& Tag);
	void OnTagAdded_A27610AE4D5F8DBE31556889BB073A43(const struct FGameplayTag& Tag);
	void OnTagRemoved_9B2ED9024EE16E51685A32BC28A7B623(const struct FGameplayTag& Tag);
	void OnTagRemoved_A27610AE4D5F8DBE31556889BB073A43(const struct FGameplayTag& Tag);
	void OnTick_D8AF7A034B4750C921EA778EFD08A258(float TimeHeld, bool bEnded);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_BuildingToolTryDestruct_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_BuildingToolTryDestruct_C")
	}
	static class UGA_BuildingToolTryDestruct_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_BuildingToolTryDestruct_C>();
	}
};
DUMPER7_ASSERTS_UGA_BuildingToolTryDestruct_C;

}

