#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BuildingLiftChanged

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.ExecuteUbergraph_GA_BuildingLiftChanged
// 0x02B8 (0x02B8 - 0x0000)
struct GA_BuildingLiftChanged_C_ExecuteUbergraph_GA_BuildingLiftChanged final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0090(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00D0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCrAbilityTask_PlayMontage*             CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x0108(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x0128(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0148(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0168(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0188(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x01A8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x01C8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCrAbilityTask_PlayMontage*             CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x01F8(0x00B0)(ConstParm)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_ExecuteUbergraph_GA_BuildingLiftChanged;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_BuildingLiftChanged_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_K2_ActivateAbilityFromEvent;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnCancelled_0BE8CA634A3EB5144B0B1F88A3140ABF
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnCancelled_0BE8CA634A3EB5144B0B1F88A3140ABF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnCancelled_0BE8CA634A3EB5144B0B1F88A3140ABF;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnCancelled_9625B61D4587934D5D54539B279CFBCE
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnCancelled_9625B61D4587934D5D54539B279CFBCE final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnCancelled_9625B61D4587934D5D54539B279CFBCE;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnFppMontageBlendOut_0BE8CA634A3EB5144B0B1F88A3140ABF
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnFppMontageBlendOut_0BE8CA634A3EB5144B0B1F88A3140ABF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnFppMontageBlendOut_0BE8CA634A3EB5144B0B1F88A3140ABF;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnFppMontageBlendOut_9625B61D4587934D5D54539B279CFBCE
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnFppMontageBlendOut_9625B61D4587934D5D54539B279CFBCE final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnFppMontageBlendOut_9625B61D4587934D5D54539B279CFBCE;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnFppMontageEnded_0BE8CA634A3EB5144B0B1F88A3140ABF
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnFppMontageEnded_0BE8CA634A3EB5144B0B1F88A3140ABF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnFppMontageEnded_0BE8CA634A3EB5144B0B1F88A3140ABF;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnFppMontageEnded_9625B61D4587934D5D54539B279CFBCE
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnFppMontageEnded_9625B61D4587934D5D54539B279CFBCE final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnFppMontageEnded_9625B61D4587934D5D54539B279CFBCE;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnFppMontageNotifyBegin_0BE8CA634A3EB5144B0B1F88A3140ABF
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnFppMontageNotifyBegin_0BE8CA634A3EB5144B0B1F88A3140ABF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnFppMontageNotifyBegin_0BE8CA634A3EB5144B0B1F88A3140ABF;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnFppMontageNotifyBegin_9625B61D4587934D5D54539B279CFBCE
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnFppMontageNotifyBegin_9625B61D4587934D5D54539B279CFBCE final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnFppMontageNotifyBegin_9625B61D4587934D5D54539B279CFBCE;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnFppMontageNotifyEnd_0BE8CA634A3EB5144B0B1F88A3140ABF
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnFppMontageNotifyEnd_0BE8CA634A3EB5144B0B1F88A3140ABF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnFppMontageNotifyEnd_0BE8CA634A3EB5144B0B1F88A3140ABF;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnFppMontageNotifyEnd_9625B61D4587934D5D54539B279CFBCE
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnFppMontageNotifyEnd_9625B61D4587934D5D54539B279CFBCE final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnFppMontageNotifyEnd_9625B61D4587934D5D54539B279CFBCE;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnInterrupted_0BE8CA634A3EB5144B0B1F88A3140ABF
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnInterrupted_0BE8CA634A3EB5144B0B1F88A3140ABF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnInterrupted_0BE8CA634A3EB5144B0B1F88A3140ABF;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnInterrupted_9625B61D4587934D5D54539B279CFBCE
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnInterrupted_9625B61D4587934D5D54539B279CFBCE final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnInterrupted_9625B61D4587934D5D54539B279CFBCE;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnNotLocallyControlledTppMontageBlendOut_0BE8CA634A3EB5144B0B1F88A3140ABF
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnNotLocallyControlledTppMontageBlendOut_0BE8CA634A3EB5144B0B1F88A3140ABF final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnNotLocallyControlledTppMontageBlendOut_0BE8CA634A3EB5144B0B1F88A3140ABF;

// Function GA_BuildingLiftChanged.GA_BuildingLiftChanged_C.OnNotLocallyControlledTppMontageBlendOut_9625B61D4587934D5D54539B279CFBCE
// 0x0008 (0x0008 - 0x0000)
struct GA_BuildingLiftChanged_C_OnNotLocallyControlledTppMontageBlendOut_9625B61D4587934D5D54539B279CFBCE final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_BuildingLiftChanged_C_OnNotLocallyControlledTppMontageBlendOut_9625B61D4587934D5D54539B279CFBCE;

}

