#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_GenericSingleFire

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AuAbilities_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_GenericSingleFire.GA_GenericSingleFire_C
// 0x0050 (0x0558 - 0x0508)
class UGA_GenericSingleFire_C final : public UCrGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAuCustomTraceDataHandle               LineTraceData;                                     // 0x0510(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAuTraceDebugParams                    TraceDebugParams;                                  // 0x0528(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bDrawDebug;                                        // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDrawServerDebug;                                  // 0x0531(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532[0x6];                                      // 0x0532(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  PlayerCharRef;                                     // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAuAT_WaitSingleShot*                   SingleFireTask;                                    // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCrWeaponItemDataBase*                  EquippedWeaponItem;                                // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAuCustomTargetHandle                  CurrentlyUsedTraceConfig;                          // 0x0550(0x0001)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_GenericSingleFire(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnCancelled_B1E1E9F340FBFC71E52E289425F5E751(class FName NotifyName);
	void OnCancelled_FDDBB4E34BD7FC4A4E8DF4933B401C9F(class FName NotifyName);
	void OnClientTraceResult(const struct FAuTargetData& OutHits, const TArray<struct FHitResult>& RawHits, bool bServerConfirmed);
	void OnCostCheckFailed_2220CBB047BB92D4524E8D950865484A(float TimeHeld, bool bEnded);
	void OnFinish_034E95FB421434F06CDA9A89213525F9();
	void OnFinish_CBFA205B42B565A5FB1AC9AEC2BFB0A9();
	void OnFppMontageBlendOut_B1E1E9F340FBFC71E52E289425F5E751(class FName NotifyName);
	void OnFppMontageBlendOut_FDDBB4E34BD7FC4A4E8DF4933B401C9F(class FName NotifyName);
	void OnFppMontageEnded_B1E1E9F340FBFC71E52E289425F5E751(class FName NotifyName);
	void OnFppMontageEnded_FDDBB4E34BD7FC4A4E8DF4933B401C9F(class FName NotifyName);
	void OnFppMontageNotifyBegin_B1E1E9F340FBFC71E52E289425F5E751(class FName NotifyName);
	void OnFppMontageNotifyBegin_FDDBB4E34BD7FC4A4E8DF4933B401C9F(class FName NotifyName);
	void OnFppMontageNotifyEnd_B1E1E9F340FBFC71E52E289425F5E751(class FName NotifyName);
	void OnFppMontageNotifyEnd_FDDBB4E34BD7FC4A4E8DF4933B401C9F(class FName NotifyName);
	void OnInterrupted_B1E1E9F340FBFC71E52E289425F5E751(class FName NotifyName);
	void OnInterrupted_FDDBB4E34BD7FC4A4E8DF4933B401C9F(class FName NotifyName);
	void OnNotLocallyControlledTppMontageBlendOut_B1E1E9F340FBFC71E52E289425F5E751(class FName NotifyName);
	void OnNotLocallyControlledTppMontageBlendOut_FDDBB4E34BD7FC4A4E8DF4933B401C9F(class FName NotifyName);
	void OnPressed_2220CBB047BB92D4524E8D950865484A(float TimeHeld, bool bEnded);
	void OnRelease_2220CBB047BB92D4524E8D950865484A(float TimeHeld, bool bEnded);
	void OnServerTraceResult(const struct FAuTargetData& OutHits, const TArray<struct FHitResult>& RawHits, bool bServerConfirmed);
	void ShootCooldownEnd_2220CBB047BB92D4524E8D950865484A(float TimeHeld, bool bEnded);

	void CreateTraceDataBasedOnConfig(const struct FAuCustomTargetHandle& InCustomTargetHandle, struct FAuCustomTraceDataHandle* OutTraceData) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_GenericSingleFire_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_GenericSingleFire_C")
	}
	static class UGA_GenericSingleFire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_GenericSingleFire_C>();
	}
};
DUMPER7_ASSERTS_UGA_GenericSingleFire_C;

}

