#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_MiningToolForcedCooldown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GA_UseWeapon_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_MiningToolForcedCooldown.GA_MiningToolForcedCooldown_C
// 0x0080 (0x05C8 - 0x0548)
class UGA_MiningToolForcedCooldown_C final : public UGA_UseWeapon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_MiningToolForcedCooldown_C;      // 0x0548(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DefaultCooldownDuration;                           // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentCooldownDuration;                           // 0x0554(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentStackLimit;                                 // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentStackCount;                                 // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Weapon_Mesh;                                       // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         SingleStackDuration;                               // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        StackLimitExpirationDuration;                      // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ActiveHeatStackEffect;                             // 0x0578(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        PenaltyDuration;                                   // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_Repeat*                    RepeatActionTask;                                  // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOverheat;                                        // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AutoReloadTag;                                     // 0x0598(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAbilityTask_WaitGameplayEvent*         InterruptionTagEventTagAsyncTask;                  // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bDidTriggerInterruptReloadEndMontage;              // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EventReceived_4DB26DED4D4BCCD96C3337AF1D250FC6(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_MiningToolForcedCooldown(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnCancelled_AF4A7AB9401331F9F07B1790DDC60914(class FName NotifyName);
	void OnCancelled_E73B851749958BF69487D5B29B5715AE(class FName NotifyName);
	void OnCancelled_F091E1784CC1609DA6F8E3892574F3BC(class FName NotifyName);
	void OnCancelled_FA82E1814C383B005FB78E8FD1DBD790(class FName NotifyName);
	void OnFinished_0790ED414BD17BED3CE5D083AD73E6FD(int32 ActionNumber);
	void OnFppMontageBlendOut_AF4A7AB9401331F9F07B1790DDC60914(class FName NotifyName);
	void OnFppMontageBlendOut_E73B851749958BF69487D5B29B5715AE(class FName NotifyName);
	void OnFppMontageBlendOut_F091E1784CC1609DA6F8E3892574F3BC(class FName NotifyName);
	void OnFppMontageBlendOut_FA82E1814C383B005FB78E8FD1DBD790(class FName NotifyName);
	void OnFppMontageEnded_AF4A7AB9401331F9F07B1790DDC60914(class FName NotifyName);
	void OnFppMontageEnded_E73B851749958BF69487D5B29B5715AE(class FName NotifyName);
	void OnFppMontageEnded_F091E1784CC1609DA6F8E3892574F3BC(class FName NotifyName);
	void OnFppMontageEnded_FA82E1814C383B005FB78E8FD1DBD790(class FName NotifyName);
	void OnFppMontageNotifyBegin_AF4A7AB9401331F9F07B1790DDC60914(class FName NotifyName);
	void OnFppMontageNotifyBegin_E73B851749958BF69487D5B29B5715AE(class FName NotifyName);
	void OnFppMontageNotifyBegin_F091E1784CC1609DA6F8E3892574F3BC(class FName NotifyName);
	void OnFppMontageNotifyBegin_FA82E1814C383B005FB78E8FD1DBD790(class FName NotifyName);
	void OnFppMontageNotifyEnd_AF4A7AB9401331F9F07B1790DDC60914(class FName NotifyName);
	void OnFppMontageNotifyEnd_E73B851749958BF69487D5B29B5715AE(class FName NotifyName);
	void OnFppMontageNotifyEnd_F091E1784CC1609DA6F8E3892574F3BC(class FName NotifyName);
	void OnFppMontageNotifyEnd_FA82E1814C383B005FB78E8FD1DBD790(class FName NotifyName);
	void OnInterrupted_AF4A7AB9401331F9F07B1790DDC60914(class FName NotifyName);
	void OnInterrupted_E73B851749958BF69487D5B29B5715AE(class FName NotifyName);
	void OnInterrupted_F091E1784CC1609DA6F8E3892574F3BC(class FName NotifyName);
	void OnInterrupted_FA82E1814C383B005FB78E8FD1DBD790(class FName NotifyName);
	void OnNotLocallyControlledTppMontageBlendOut_AF4A7AB9401331F9F07B1790DDC60914(class FName NotifyName);
	void OnNotLocallyControlledTppMontageBlendOut_E73B851749958BF69487D5B29B5715AE(class FName NotifyName);
	void OnNotLocallyControlledTppMontageBlendOut_F091E1784CC1609DA6F8E3892574F3BC(class FName NotifyName);
	void OnNotLocallyControlledTppMontageBlendOut_FA82E1814C383B005FB78E8FD1DBD790(class FName NotifyName);
	void OnPerformAction_0790ED414BD17BED3CE5D083AD73E6FD(int32 ActionNumber);
	void OnSync_655A35EA4A00670848CC0596755559BE();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_MiningToolForcedCooldown_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_MiningToolForcedCooldown_C")
	}
	static class UGA_MiningToolForcedCooldown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_MiningToolForcedCooldown_C>();
	}
};
DUMPER7_ASSERTS_UGA_MiningToolForcedCooldown_C;

}

