#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_UnequipWeapon

#include "Basic.hpp"

#include "Chimera_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_UnequipWeapon.GA_UnequipWeapon_C.ExecuteUbergraph_GA_UnequipWeapon
// 0x01B0 (0x01B0 - 0x0000)
struct GA_UnequipWeapon_C_ExecuteUbergraph_GA_UnequipWeapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0078(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0098(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x00D8(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerCharacter_C*                  K2Node_DynamicCast_AsBP_Player_Character;          // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x0118(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUnequipWeapon_ReturnValue;             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ACrWeaponActor*                         CallFunc_GetEquippedWeaponActor_ReturnValue;       // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_BP_GetOwnedGameplayTags_self_CastInput; // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BP_GetOwnedGameplayTags_ReturnValue;      // 0x0158(0x0020)()
	class UCrWeaponComponent*                     CallFunc_BP_GetWeaponComponent_ReturnValue;        // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetFppUnEquipMontage_ReturnValue;         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetTppUnEquipMontage_ReturnValue;         // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCrMontagePair                         K2Node_MakeStruct_CrMontagePair;                   // 0x0190(0x0010)(NoDestructor)
	class UCrAbilityTask_PlayMontage*             CallFunc_CreatePlayMontagePairAndWaitProxy_ReturnValue; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_UnequipWeapon_C_ExecuteUbergraph_GA_UnequipWeapon;

// Function GA_UnequipWeapon.GA_UnequipWeapon_C.OnCancelled_B1E48B95BB4A687A3BDA18AC4CA072FD
// 0x0008 (0x0008 - 0x0000)
struct GA_UnequipWeapon_C_OnCancelled_B1E48B95BB4A687A3BDA18AC4CA072FD final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_UnequipWeapon_C_OnCancelled_B1E48B95BB4A687A3BDA18AC4CA072FD;

// Function GA_UnequipWeapon.GA_UnequipWeapon_C.OnFppMontageBlendOut_B1E48B95BB4A687A3BDA18AC4CA072FD
// 0x0008 (0x0008 - 0x0000)
struct GA_UnequipWeapon_C_OnFppMontageBlendOut_B1E48B95BB4A687A3BDA18AC4CA072FD final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_UnequipWeapon_C_OnFppMontageBlendOut_B1E48B95BB4A687A3BDA18AC4CA072FD;

// Function GA_UnequipWeapon.GA_UnequipWeapon_C.OnFppMontageEnded_B1E48B95BB4A687A3BDA18AC4CA072FD
// 0x0008 (0x0008 - 0x0000)
struct GA_UnequipWeapon_C_OnFppMontageEnded_B1E48B95BB4A687A3BDA18AC4CA072FD final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_UnequipWeapon_C_OnFppMontageEnded_B1E48B95BB4A687A3BDA18AC4CA072FD;

// Function GA_UnequipWeapon.GA_UnequipWeapon_C.OnFppMontageNotifyBegin_B1E48B95BB4A687A3BDA18AC4CA072FD
// 0x0008 (0x0008 - 0x0000)
struct GA_UnequipWeapon_C_OnFppMontageNotifyBegin_B1E48B95BB4A687A3BDA18AC4CA072FD final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_UnequipWeapon_C_OnFppMontageNotifyBegin_B1E48B95BB4A687A3BDA18AC4CA072FD;

// Function GA_UnequipWeapon.GA_UnequipWeapon_C.OnFppMontageNotifyEnd_B1E48B95BB4A687A3BDA18AC4CA072FD
// 0x0008 (0x0008 - 0x0000)
struct GA_UnequipWeapon_C_OnFppMontageNotifyEnd_B1E48B95BB4A687A3BDA18AC4CA072FD final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_UnequipWeapon_C_OnFppMontageNotifyEnd_B1E48B95BB4A687A3BDA18AC4CA072FD;

// Function GA_UnequipWeapon.GA_UnequipWeapon_C.OnInterrupted_B1E48B95BB4A687A3BDA18AC4CA072FD
// 0x0008 (0x0008 - 0x0000)
struct GA_UnequipWeapon_C_OnInterrupted_B1E48B95BB4A687A3BDA18AC4CA072FD final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_UnequipWeapon_C_OnInterrupted_B1E48B95BB4A687A3BDA18AC4CA072FD;

// Function GA_UnequipWeapon.GA_UnequipWeapon_C.OnNotLocallyControlledTppMontageBlendOut_B1E48B95BB4A687A3BDA18AC4CA072FD
// 0x0008 (0x0008 - 0x0000)
struct GA_UnequipWeapon_C_OnNotLocallyControlledTppMontageBlendOut_B1E48B95BB4A687A3BDA18AC4CA072FD final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_UnequipWeapon_C_OnNotLocallyControlledTppMontageBlendOut_B1E48B95BB4A687A3BDA18AC4CA072FD;

}

