#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameSettings

#include "Basic.hpp"

#include "GameSettings_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GameSettings.GameSettingHeader
// 0x0020 (0x03E8 - 0x03C8)
class UGameSettingHeader final : public UCommonUserWidget
{
public:
	TMulticastInlineDelegate<void(class FName TabId)> OnSelectTabEvent;                              // 0x03C8(0x0018)(ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPublic)
	class UGameSettingRegistry*                   Registry;                                          // 0x03E0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	void RegisterTab(class FName TabCollection, class FName TabName);
	void SelectTabByID(class FName TabId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingHeader")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingHeader")
	}
	static class UGameSettingHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingHeader>();
	}
};
DUMPER7_ASSERTS_UGameSettingHeader;

// Class GameSettings.GameSettingListEntryBase
// 0x0028 (0x03F0 - 0x03C8)
class UGameSettingListEntryBase : public UCommonUserWidget
{
public:
	uint8                                         Pad_3C8[0x10];                                     // 0x03C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSetting*                           Setting;                                           // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_3E0[0x10];                                     // 0x03E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UWidget* GetPrimaryGamepadFocusWidget();
	void SetWidgetStyle(bool bIsFocused);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntryBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntryBase")
	}
	static class UGameSettingListEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntryBase>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntryBase;

// Class GameSettings.GameSettingListEntry_Setting
// 0x0020 (0x0410 - 0x03F0)
class UGameSettingListEntry_Setting : public UGameSettingListEntryBase
{
public:
	class UCommonTextBlock*                       Text_SettingName;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TSubclassOf<class UCommonTextStyle>           SelectedStyle;                                     // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonTextStyle>           NormalStyle;                                       // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddSlashToHeader();
	void EventPlaySound();
	void PlayHoverSound();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntry_Setting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntry_Setting")
	}
	static class UGameSettingListEntry_Setting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntry_Setting>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntry_Setting;

// Class GameSettings.GameSettingListEntrySetting_Action
// 0x0018 (0x0428 - 0x0410)
class UGameSettingListEntrySetting_Action final : public UGameSettingListEntry_Setting
{
public:
	class UCommonButtonBase*                      Button_Action;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonUserWidget*                      BottomLine;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UGameSettingAction*                     ActionSetting;                                     // 0x0420(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void OnSettingAssigned(const class FText& ActionText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Action")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Action")
	}
	static class UGameSettingListEntrySetting_Action* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Action>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Action;

// Class GameSettings.GameSettingListEntrySetting_Discrete
// 0x0040 (0x0450 - 0x0410)
class UGameSettingListEntrySetting_Discrete final : public UGameSettingListEntry_Setting
{
public:
	class UGameSettingRotator*                    Rotator_SettingValue;                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonButtonBase*                      Button_Decrease;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonButtonBase*                      Button_Increase;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UWidgetSwitcher*                        OptionsSets;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonButtonBase*                      Button_FirstOption;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonButtonBase*                      Button_SecondOption;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonUserWidget*                      BottomLine;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UGameSettingValueDiscrete*              DiscreteSetting;                                   // 0x0448(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void SetUpButtonText(class UCommonButtonBase* Button, const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Discrete")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Discrete")
	}
	static class UGameSettingListEntrySetting_Discrete* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Discrete>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Discrete;

// Class GameSettings.GameSettingListEntrySetting_Navigation
// 0x0018 (0x0428 - 0x0410)
class UGameSettingListEntrySetting_Navigation final : public UGameSettingListEntry_Setting
{
public:
	class UCommonButtonBase*                      Button_Navigate;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonUserWidget*                      BottomLine;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UGameSettingCollectionPage*             CollectionSetting;                                 // 0x0420(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void OnSettingAssigned(const class FText& ActionText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Navigation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Navigation")
	}
	static class UGameSettingListEntrySetting_Navigation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Navigation>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Navigation;

// Class GameSettings.GameSettingListEntrySetting_Scalar
// 0x0038 (0x0448 - 0x0410)
class UGameSettingListEntrySetting_Scalar final : public UGameSettingListEntry_Setting
{
public:
	class UPanelWidget*                           Panel_Value;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UAnalogSlider*                          Slider_SettingValue;                               // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonTextBlock*                       Text_SettingValue;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UProgressBar*                           ProgressBar;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UBorder*                                ProgressBorder;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonUserWidget*                      BottomLine;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UGameSettingValueScalar*                ScalarSetting;                                     // 0x0440(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void HandleSliderCaptureEnded();
	void HandleSliderValueChanged(float Value);
	void OnDefaultValueChanged(float DefaultValue);
	void OnValueChanged(float Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Scalar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Scalar")
	}
	static class UGameSettingListEntrySetting_Scalar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Scalar>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Scalar;

// Class GameSettings.GameSettingPressAnyKey
// 0x00C8 (0x0600 - 0x0538)
class UGameSettingPressAnyKey : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_538[0x60];                                     // 0x0538(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UButton*                                ConfirmButton;                                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UButton*                                CancelButton;                                      // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonTextBlock*                       KeyText;                                           // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UCommonTextBlock*                       ActionName;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_5B8[0x48];                                     // 0x05B8(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InputCanceled();
	void InputConfirm();
	void SetNormalText();
	void SetWarningText(const class FText& InWarning);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingPressAnyKey")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingPressAnyKey")
	}
	static class UGameSettingPressAnyKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingPressAnyKey>();
	}
};
DUMPER7_ASSERTS_UGameSettingPressAnyKey;

// Class GameSettings.KeyAlreadyBoundWarning
// 0x0010 (0x0610 - 0x0600)
class UKeyAlreadyBoundWarning final : public UGameSettingPressAnyKey
{
public:
	class UTextBlock*                             WarningText;                                       // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UTextBlock*                             CancelText;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KeyAlreadyBoundWarning")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KeyAlreadyBoundWarning")
	}
	static class UKeyAlreadyBoundWarning* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeyAlreadyBoundWarning>();
	}
};
DUMPER7_ASSERTS_UKeyAlreadyBoundWarning;

// Class GameSettings.GameSetting
// 0x0150 (0x0178 - 0x0028)
class UGameSetting : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           LocalPlayer;                                       // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UGameSetting*                           SettingParent;                                     // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UGameSettingRegistry*                   OwningRegistry;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_A0[0xD8];                                      // 0x00A0(0x00D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	ESlateVisibility GetDisplayNameVisibility();

	class FText GetDescriptionRichText() const;
	class FName GetDevName() const;
	class FText GetDisplayName() const;
	class FText GetDynamicDetails() const;
	const struct FGameplayTagContainer GetTags() const;
	class FText GetWarningRichText() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSetting")
	}
	static class UGameSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSetting>();
	}
};
DUMPER7_ASSERTS_UGameSetting;

// Class GameSettings.GameSettingAction
// 0x0058 (0x01D0 - 0x0178)
class UGameSettingAction : public UGameSetting
{
public:
	uint8                                         Pad_178[0x58];                                     // 0x0178(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingAction")
	}
	static class UGameSettingAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingAction>();
	}
};
DUMPER7_ASSERTS_UGameSettingAction;

// Class GameSettings.GameSettingCollection
// 0x0010 (0x0188 - 0x0178)
class UGameSettingCollection : public UGameSetting
{
public:
	TArray<class UGameSetting*>                   Settings;                                          // 0x0178(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingCollection")
	}
	static class UGameSettingCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingCollection>();
	}
};
DUMPER7_ASSERTS_UGameSettingCollection;

// Class GameSettings.GameSettingCollectionPage
// 0x0030 (0x01B8 - 0x0188)
class UGameSettingCollectionPage final : public UGameSettingCollection
{
public:
	uint8                                         Pad_188[0x30];                                     // 0x0188(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingCollectionPage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingCollectionPage")
	}
	static class UGameSettingCollectionPage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingCollectionPage>();
	}
};
DUMPER7_ASSERTS_UGameSettingCollectionPage;

// Class GameSettings.GameSettingValue
// 0x0000 (0x0178 - 0x0178)
class UGameSettingValue : public UGameSetting
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValue")
	}
	static class UGameSettingValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValue>();
	}
};
DUMPER7_ASSERTS_UGameSettingValue;

// Class GameSettings.GameSettingValueDiscrete
// 0x0008 (0x0180 - 0x0178)
class UGameSettingValueDiscrete : public UGameSettingValue
{
public:
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetDiscreteOptionDefaultIndex() const;
	int32 GetDiscreteOptionIndex() const;
	TArray<class FText> GetDiscreteOptions() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscrete")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscrete")
	}
	static class UGameSettingValueDiscrete* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscrete>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscrete;

// Class GameSettings.GameSettingValueDiscreteDynamic
// 0x0060 (0x01E0 - 0x0180)
class UGameSettingValueDiscreteDynamic : public UGameSettingValueDiscrete
{
public:
	uint8                                         Pad_180[0x60];                                     // 0x0180(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic")
	}
	static class UGameSettingValueDiscreteDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic;

// Class GameSettings.GameSettingValueDiscreteDynamic_Bool
// 0x0000 (0x01E0 - 0x01E0)
class UGameSettingValueDiscreteDynamic_Bool final : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Bool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Bool")
	}
	static class UGameSettingValueDiscreteDynamic_Bool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Bool>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Bool;

// Class GameSettings.GameSettingValueDiscreteDynamic_Number
// 0x0000 (0x01E0 - 0x01E0)
class UGameSettingValueDiscreteDynamic_Number final : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Number")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Number")
	}
	static class UGameSettingValueDiscreteDynamic_Number* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Number>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Number;

// Class GameSettings.GameSettingValueDiscreteDynamic_Enum
// 0x0000 (0x01E0 - 0x01E0)
class UGameSettingValueDiscreteDynamic_Enum final : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Enum")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Enum")
	}
	static class UGameSettingValueDiscreteDynamic_Enum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Enum>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Enum;

// Class GameSettings.GameSettingValueDiscreteDynamic_Color
// 0x0000 (0x01E0 - 0x01E0)
class UGameSettingValueDiscreteDynamic_Color final : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Color")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Color")
	}
	static class UGameSettingValueDiscreteDynamic_Color* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Color>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Color;

// Class GameSettings.GameSettingValueDiscreteDynamic_Vector2D
// 0x0000 (0x01E0 - 0x01E0)
class UGameSettingValueDiscreteDynamic_Vector2D final : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Vector2D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Vector2D")
	}
	static class UGameSettingValueDiscreteDynamic_Vector2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Vector2D>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Vector2D;

// Class GameSettings.GameSettingValueScalar
// 0x0000 (0x0178 - 0x0178)
class UGameSettingValueScalar : public UGameSettingValue
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueScalar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueScalar")
	}
	static class UGameSettingValueScalar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueScalar>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueScalar;

// Class GameSettings.GameSettingValueScalarDynamic
// 0x00B8 (0x0230 - 0x0178)
class UGameSettingValueScalarDynamic : public UGameSettingValueScalar
{
public:
	uint8                                         Pad_178[0xB8];                                     // 0x0178(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueScalarDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueScalarDynamic")
	}
	static class UGameSettingValueScalarDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueScalarDynamic>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueScalarDynamic;

// Class GameSettings.GameSettingRegistry
// 0x00A8 (0x00D0 - 0x0028)
class UGameSettingRegistry : public UObject
{
public:
	uint8                                         Pad_28[0x80];                                      // 0x0028(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameSetting*>                   TopLevelSettings;                                  // 0x00A8(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class UGameSetting*>                   RegisteredSettings;                                // 0x00B8(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	class ULocalPlayer*                           OwningLocalPlayer;                                 // 0x00C8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingRegistry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingRegistry")
	}
	static class UGameSettingRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingRegistry>();
	}
};
DUMPER7_ASSERTS_UGameSettingRegistry;

// Class GameSettings.GameSettingDetailExtension
// 0x0008 (0x03A8 - 0x03A0)
class UGameSettingDetailExtension final : public UUserWidget
{
public:
	class UGameSetting*                           Setting;                                           // 0x03A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void OnSettingAssigned(class UGameSetting* InSetting);
	void OnSettingValueChanged(class UGameSetting* InSetting);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingDetailExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingDetailExtension")
	}
	static class UGameSettingDetailExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingDetailExtension>();
	}
};
DUMPER7_ASSERTS_UGameSettingDetailExtension;

// Class GameSettings.GameSettingDetailView
// 0x00D8 (0x0478 - 0x03A0)
class UGameSettingDetailView final : public UUserWidget
{
public:
	class UGameSettingVisualData*                 VisualData;                                        // 0x03A0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	struct FUserWidgetPool                        ExtensionWidgetPool;                               // 0x03A8(0x0088)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UGameSetting*                           CurrentSetting;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_438[0x10];                                     // 0x0438(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingListEntry_Setting*          SettingTitle;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UCommonRichTextBlock*                   RichText_Description;                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UCommonRichTextBlock*                   RichText_DynamicDetails;                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UCommonRichTextBlock*                   RichText_WarningDetails;                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UCommonRichTextBlock*                   RichText_DisabledDetails;                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UVerticalBox*                           Box_DetailsExtension;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingDetailView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingDetailView")
	}
	static class UGameSettingDetailView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingDetailView>();
	}
};
DUMPER7_ASSERTS_UGameSettingDetailView;

// Class GameSettings.GameSettingListView
// 0x0050 (0x0CB0 - 0x0C60)
class UGameSettingListView final : public UListView
{
public:
	class UGameSettingVisualData*                 VisualData;                                        // 0x0C58(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_C60[0x50];                                     // 0x0C60(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListView")
	}
	static class UGameSettingListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListView>();
	}
};
DUMPER7_ASSERTS_UGameSettingListView;

// Class GameSettings.GameSettingPanel
// 0x0438 (0x0800 - 0x03C8)
class UGameSettingPanel final : public UCommonUserWidget
{
public:
	uint8                                         Pad_3C8[0x20];                                     // 0x03C8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingRegistry*                   Registry;                                          // 0x03E8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<class UGameSetting*>                   VisibleSettings;                                   // 0x03F0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	class UGameSetting*                           LastHoveredOrSelectedSetting;                      // 0x0400(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	struct FGameSettingFilterState                FilterState;                                       // 0x0408(0x03A0)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FGameSettingFilterState>        FilterNavigationStack;                             // 0x07A8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7B8[0x10];                                     // 0x07B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingListView*                   ListView_Settings;                                 // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UGameSettingDetailView*                 Details_Settings;                                  // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TMulticastInlineDelegate<void(class UGameSetting* Setting, const struct FGameplayTag& Action)> BP_OnExecuteNamedAction; // 0x07D8(0x0018)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7F0[0x10];                                     // 0x07F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingPanel")
	}
	static class UGameSettingPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingPanel>();
	}
};
DUMPER7_ASSERTS_UGameSettingPanel;

// Class GameSettings.GameSettingScreen
// 0x0078 (0x05B0 - 0x0538)
class UGameSettingScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_538[0x60];                                     // 0x0538(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingPanel*                      Settings_Panel;                                    // 0x0598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UGameSettingHeader*                     SettingHeader;                                     // 0x05A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class UGameSettingRegistry*                   Registry;                                          // 0x05A8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	void ApplyChanges();
	bool AttemptToPopNavigation();
	void CancelChanges();
	class UGameSettingCollection* GetSettingCollection(class FName SettingDevName, bool* HasAnySettings);
	void NavigateToSetting(class FName SettingDevName);
	void NavigateToSettings(const TArray<class FName>& SettingDevNames);
	void OnSelectedTabEvent(class FName TabId);
	void OnSettingsDirtyStateChanged(bool bSettingsDirty);

	bool HaveSettingsBeenChanged() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingScreen")
	}
	static class UGameSettingScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingScreen>();
	}
};
DUMPER7_ASSERTS_UGameSettingScreen;

// Class GameSettings.GameSettingVisualData
// 0x0140 (0x0170 - 0x0030)
class UGameSettingVisualData final : public UDataAsset
{
public:
	TMap<TSubclassOf<class UGameSetting>, TSubclassOf<class UGameSettingListEntryBase>> EntryWidgetForClass; // 0x0030(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<class FName, TSubclassOf<class UGameSettingListEntryBase>> EntryWidgetForName;              // 0x0080(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UGameSetting>, struct FGameSettingClassExtensions> ExtensionsForClasses;  // 0x00D0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FGameSettingNameExtensions> ExtensionsForName;                          // 0x0120(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingVisualData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingVisualData")
	}
	static class UGameSettingVisualData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingVisualData>();
	}
};
DUMPER7_ASSERTS_UGameSettingVisualData;

// Class GameSettings.GameSettingActionInterface
// 0x0000 (0x0000 - 0x0000)
class IGameSettingActionInterface final
{
public:
	bool ExecuteActionForSetting(const struct FGameplayTag& ActionTag, class UGameSetting* InSetting);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingActionInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingActionInterface")
	}
	static class IGameSettingActionInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGameSettingActionInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGameSettingActionInterface;

// Class GameSettings.GameSettingRotator
// 0x0020 (0x16F0 - 0x16D0)
class UGameSettingRotator final : public UCommonRotator
{
public:
	class USizeBox*                               OptionTextSizeBox;                                 // 0x16D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class USizeBox*                               OptionsScalingSizeBox;                             // 0x16D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UImage*                                 OptionsPips;                                       // 0x16E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_16E8[0x8];                                     // 0x16E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnDefaultOptionSpecified(int32 DefaultOptionIndex);
	void Init(int32 Num);
	void SetSelectedColor(const struct FColor& InColor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingRotator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingRotator")
	}
	static class UGameSettingRotator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingRotator>();
	}
};
DUMPER7_ASSERTS_UGameSettingRotator;

// Class GameSettings.GameResponsivePanel
// 0x0018 (0x01C0 - 0x01A8)
class UGameResponsivePanel final : public UPanelWidget
{
public:
	bool                                          bCanStackVertically;                               // 0x01A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A9[0x17];                                     // 0x01A9(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UGameResponsivePanelSlot* AddChildToGameResponsivePanel(class UWidget* Content);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameResponsivePanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameResponsivePanel")
	}
	static class UGameResponsivePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameResponsivePanel>();
	}
};
DUMPER7_ASSERTS_UGameResponsivePanel;

// Class GameSettings.GameResponsivePanelSlot
// 0x0008 (0x0040 - 0x0038)
class UGameResponsivePanelSlot final : public UPanelSlot
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameResponsivePanelSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameResponsivePanelSlot")
	}
	static class UGameResponsivePanelSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameResponsivePanelSlot>();
	}
};
DUMPER7_ASSERTS_UGameResponsivePanelSlot;

}

