#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GE_CamEffect_Corrosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Chimera_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GE_CamEffect_Corrosion.GE_CamEffect_Corrosion_C
// 0x0018 (0x0AC0 - 0x0AA8)
class UGE_CamEffect_Corrosion_C final : public UCrCameraGameplayEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Increased;                                         // 0x0AB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Decreased;                                         // 0x0AB1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB2[0x6];                                      // 0x0AB2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        LoopSoundAC;                                       // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GE_CamEffect_Corrosion(int32 EntryPoint);
	void OnAttributeChanged_987CD6BD43C0487E1D5069849F1AB46E(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue);
	void OnInitialized(class UAbilitySystemComponent* AbilitySystemComponent, TSubclassOf<class UGameplayEffect> GameplayEffect, class USceneComponent* OwnerRootComponent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GE_CamEffect_Corrosion_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GE_CamEffect_Corrosion_C")
	}
	static class UGE_CamEffect_Corrosion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGE_CamEffect_Corrosion_C>();
	}
};
DUMPER7_ASSERTS_UGE_CamEffect_Corrosion_C;

}

