#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KiBLII

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function KiBLII.KiBLIIFunctionLibrary.GetKeyboardLayoutsChars
// 0x0010 (0x0010 - 0x0000)
struct KiBLIIFunctionLibrary_GetKeyboardLayoutsChars final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiBLIIFunctionLibrary_GetKeyboardLayoutsChars;

// Function KiBLII.KiBLIIFunctionLibrary.RemapKey_QwertyToSystem
// 0x0030 (0x0030 - 0x0000)
struct KiBLIIFunctionLibrary_RemapKey_QwertyToSystem final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiBLIIFunctionLibrary_RemapKey_QwertyToSystem;

// Function KiBLII.KiBLIIFunctionLibrary.RemapKeyEvent_QwertyToSystem
// 0x0090 (0x0090 - 0x0000)
struct KiBLIIFunctionLibrary_RemapKeyEvent_QwertyToSystem final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FKeyEvent                              ReturnValue;                                       // 0x0048(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiBLIIFunctionLibrary_RemapKeyEvent_QwertyToSystem;

// Function KiBLII.KiBLIIFunctionLibrary.RemapKeyEvent_SystemToQwerty
// 0x0090 (0x0090 - 0x0000)
struct KiBLIIFunctionLibrary_RemapKeyEvent_SystemToQwerty final
{
public:
	struct FKeyEvent                              KeyEvent;                                          // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FKeyEvent                              ReturnValue;                                       // 0x0048(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_KiBLIIFunctionLibrary_RemapKeyEvent_SystemToQwerty;

}

