#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CraftingRoundProgressBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CraftingRoundProgressBar.WBP_CraftingRoundProgressBar_C
// 0x0028 (0x03C8 - 0x03A0)
class UWBP_CraftingRoundProgressBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 LevelProgressBarImage;                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               LevelProgressBar;                                  // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        LevelPercent;                                      // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InnerSize;                                         // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OuterSize;                                         // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_CraftingRoundProgressBar(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetBlackTint();
	void SetGreyTint();
	void SetProgressBrush(const struct FLinearColor& InColor);
	void SetProgressPercent(double ProgressPercentage);
	void SetWhiteTint();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateProgress();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_CraftingRoundProgressBar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_CraftingRoundProgressBar_C")
	}
	static class UWBP_CraftingRoundProgressBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CraftingRoundProgressBar_C>();
	}
};
DUMPER7_ASSERTS_UWBP_CraftingRoundProgressBar_C;

}

