#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SessionOverwriteConfirmation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SessionOverwriteConfirmation.WBP_SaveOverwriteConfirmation_C
// 0x0020 (0x03C0 - 0x03A0)
class WBP_SessionOverwriteConfirmation::UWBP_SaveOverwriteConfirmation_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Yes;                                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootCanvas;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                No;                                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_SaveOverwriteConfirmation_NO_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_SaveOverwriteConfirmation_NO_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_SaveOverwriteConfirmation_Yes_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_SaveOverwriteConfirmation_Yes_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	class UWidget* Down(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_SaveOverwriteConfirmation(int32 EntryPoint);
	class UWidget* Left(EUINavigation Navigation_0);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	class UWidget* Right(EUINavigation Navigation_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	class UWidget* Up(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL_FULLNAME("WidgetBlueprintGeneratedClass WBP_SessionOverwriteConfirmation.WBP_SaveOverwriteConfirmation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SaveOverwriteConfirmation_C")
	}
	static class WBP_SessionOverwriteConfirmation::UWBP_SaveOverwriteConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<WBP_SessionOverwriteConfirmation::UWBP_SaveOverwriteConfirmation_C>();
	}
};
DUMPER7_ASSERTS_WBP_SessionOverwriteConfirmation__UWBP_SaveOverwriteConfirmation_C;

// WidgetBlueprintGeneratedClass WBP_SessionOverwriteConfirmation.WBP_SessionOverwriteConfirmation_C
// 0x0018 (0x03B8 - 0x03A0)
class UWBP_SessionOverwriteConfirmation_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           RootCanvas;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Ok;                                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_SaveOverwriteConfirmation_Yes_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_SaveOverwriteConfirmation_Yes_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	class UWidget* Down(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_SessionOverwriteConfirmation(int32 EntryPoint);
	void InpActEvt_Gamepad_FaceButton_Bottom_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_Gamepad_FaceButton_Right_K2Node_InputKeyEvent_0(const struct FKey& Key);
	class UWidget* Left(EUINavigation Navigation_0);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	class UWidget* Right(EUINavigation Navigation_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	class UWidget* Up(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SessionOverwriteConfirmation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SessionOverwriteConfirmation_C")
	}
	static class UWBP_SessionOverwriteConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SessionOverwriteConfirmation_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SessionOverwriteConfirmation_C;

}

