#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuildingResultNotification

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "AuActorPlacement_structs.hpp"


namespace SDK::Params
{

// Function WBP_BuildingResultNotification.WBP_BuildingResultNotification_C.OnPlacementResultNotif
// 0x0001 (0x0001 - 0x0000)
struct WBP_BuildingResultNotification_C_OnPlacementResultNotif final
{
public:
	EAuAPPlacementResult                          PlacementResult;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BuildingResultNotification_C_OnPlacementResultNotif;

// Function WBP_BuildingResultNotification.WBP_BuildingResultNotification_C.ExecuteUbergraph_WBP_BuildingResultNotification
// 0x0050 (0x0050 - 0x0000)
struct WBP_BuildingResultNotification_C_ExecuteUbergraph_WBP_BuildingResultNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0004(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	EAuAPPlacementResult                          K2Node_Event_PlacementResult;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ToUpper_ReturnValue;                      // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
};
DUMPER7_ASSERTS_WBP_BuildingResultNotification_C_ExecuteUbergraph_WBP_BuildingResultNotification;

}

